[
  {
    "id": "caleb-downs",
    "name": "Caleb Downs",
    "position": "SAF",
    "school": "Ohio State",
    "rank": 1,
    "height": "6-0",
    "weight": "205",
    "year": "Junior",
    "analystRanks": {
      "B/R": 1,
      "CBS": 7,
      "ESPN": 5,
      "PFF": 1,
      "PFSN": 1,
      "The Athletic": 3
    },
    "analysis": "Caleb Downs has received first-round premonitions from the general consensus ever since he set foot on Alabama's campus as a five-star recruit. An instant producer at the CFB level, Downs was a star for the Crimson Tide defense in 2023, and then for Ohio State's Championship-caliber unit in 2024 and 2025. Downs' raw production underwhelms in comparison to his prestige, but don't let that fool you: On film, he's one of the best safety prospects in recent memory, and is a blue-chip player in the 2026 NFL Draft class.\n\nA fluid, explosive, and energized mover at 6'0\", 205 pounds, Downs is special in the box with his combined mobility, play pace, angle IQ, and physicality on blocks. He's an expert at running alleys, scraping through contact, and securing solo tackles, and his instant reaction-to-stimulus ensures he's always responsive on plays. And while his raw production in coverage makes him easy to overlook in space, his coverage game is just as exhilarating.\n\nDowns is an uber-instinctive cover man who can swiftly process route combinations, manage route relationships, transition with ease, and clamp down on stems from different alignments. He's the consummate \"glue guy\", with a cosmic football IQ and the versatility to play two-high, single-high, in the box as a rover, and even as a big-nickel in off-man and zone. Positional value will be discussed with Downs, but regardless, he has all the hallmarks of a future All-Pro who makes a defense better.",
    "positionRank": 1,
    "grade": 94.43
  },
  {
    "id": "arvell-reese",
    "name": "Arvell Reese",
    "position": "LB",
    "school": "Ohio State",
    "rank": 2,
    "height": "6-4",
    "weight": "243",
    "year": "Junior",
    "analystRanks": {
      "B/R": 6,
      "CBS": 5,
      "ESPN": 2,
      "PFF": 3,
      "PFSN": 2,
      "The Athletic": 1
    },
    "analysis": "Arvell Reese was a one-year starter for the Ohio State Buckeyes, who could end up riding that single season to single-digit NFL Draft capital. He was one of the Buckeyes' most dynamic defenders, particularly early in the season, and ended up earning 6.5 sacks, 10 tackles for loss, and consensus All-American honors. At 6'4\", 243 pounds, Reese has a tantalizing blend of explosive athleticism, length, and forklifting strength.\n\nHe used that strength consistently to stack-and-shed in the run game, plaster solo blockers into the turf as a blitzer, and make solo stops in gap invasion. Meanwhile, his range and fluidity make him dangerous as a rusher, and his lean, platinum-forged length and frame grants him awe-inspiring power capacity on long-arms and bull-rushes, when utilized with his elite explosive edge. The questions with Reese's profile stem from his ultimate projection.\n\nHis power and physicality are overwhelming as a SAM linebacker, as is his range and corrective twitch in pursuit, but he can get lost by misdirections, and he's not overly fluid in coverage. Meanwhile, as an EDGE convert, Reese's traits are in the 99th percentile, but he's relatively raw as a pass-rush operator. Right now, Reese is a complex \"tweener\" prospect, but his raw athletic upside and power grants him true X-factor potential.",
    "positionRank": 1,
    "grade": 91.22
  },
  {
    "id": "fernando-mendoza",
    "name": "Fernando Mendoza",
    "position": "QB",
    "school": "Indiana",
    "rank": 3,
    "height": "6-5",
    "weight": "225",
    "year": "RS Junior",
    "analystRanks": {
      "B/R": 5,
      "CBS": 1,
      "ESPN": 1,
      "PFF": 2,
      "PFSN": 6,
      "The Athletic": 7
    },
    "analysis": "Fernando Mendoza is the favorite to be the first overall pick, after a 2025 season that saw him win the Heisman Trophy and lead his Indiana Hoosiers to a Big Ten title and National Championship appearance. At 6'5\", 225 pounds, Mendoza has the ideal prototypical frame, along with quick feet, nimble pocket mobility, and understated creation capacity and off-script feel. He's a crisp rotational thrower who always gives his WR a chance, and also flashes high-end situational precision and layering ability.\n\nBeyond that, he has the rifle arm strength, pre-snap and post-snap recognition, and keen anticipation to make NFL-level throws both up the seams and outside the hashes. There's a degree of arm arrogance in Mendoza's game that he'll have to tamp down, but that's a byproduct of him seeing those miniscule windows and having the fearlessness to take chances. He's a pocket passer first; while he's a great linear athlete, his hip stiffness limits his appeal operating off-platform and sources mechanical instability on the move.\n\nHowever, in the pocket, he's a gunslinger with a perfectly calibrated risk propensity pallet and a penchant for delivering in key moments, who resembles a young, peak Carson Palmer. He's a clear franchise QB candidate, who can elevate an organization toward Super Bowl contention.",
    "positionRank": 1,
    "grade": 90.69
  },
  {
    "id": "rueben-bain-jr",
    "name": "Rueben Bain Jr.",
    "position": "EDGE",
    "school": "Miami (FL)",
    "rank": 4,
    "height": "6-3",
    "weight": "275",
    "year": "Junior",
    "analystRanks": {
      "B/R": 2,
      "CBS": 2,
      "ESPN": 6,
      "PFF": 5,
      "PFSN": 3,
      "The Athletic": 6
    },
    "analysis": "Rueben Bain Jr. has been a disruptive defender for as long as he's been on the college football circuit. After joining the Hurricanes as a four-star recruit, Bain racked up 7.5 sacks, 13 tackles for loss, and three forced fumbles in his true freshman campaign.\n\nBain's sophomore season was less productive due to a calf injury, but he returned to form as a legitimate game-wrecker at his best in 2025. He earned All-American honors in the process of accruing 8.5 sacks, 13 TFLs, and a strong PFSN EDGE Impact score of 82.7. At 275 pounds, Bain has a rare body type for the position, with elite compact mass and natural leverage, and he's an explosive long-track accelerator with awesome raw hand power.\n\nWith his power and raw strength, Bain can sledge through tackles and overwhelm 1-on-1 as a pass-rusher, but he also has the hyper-elite sturdiness to absorb combo and duo blocks in the run game, and sets an edge with unflinching consistency. While power is Bain's primary mode, he has a deep pass-rush bag and smooth upper-lower synergy, superb strength, IQ, and pursuit range in run defense, and surprising flexibility as a finisher. There has been talk of him potentially transitioning to DT in the NFL, but he fits best as an alignment-versatile EDGE, where he can use extended runways to channel power.\n\nIn that role, Bain can be a plus starter and situational game-wrecker in the NFL similar to how he was in college.",
    "positionRank": 1,
    "grade": 89.35
  },
  {
    "id": "jeremiyah-love",
    "name": "Jeremiyah Love",
    "position": "RB",
    "school": "Notre Dame",
    "rank": 5,
    "height": "6-0",
    "weight": "214",
    "year": "Junior",
    "analystRanks": {
      "B/R": 4,
      "CBS": 10,
      "ESPN": 3,
      "PFF": 4,
      "PFSN": 5,
      "The Athletic": 5
    },
    "analysis": "Jeremiyah Love has followed in the footsteps of Ashton Jeanty and Bijan Robinson as the next RB prospect to contend for early first-round capital. At 6'0\", 214 pounds, Love is a bit lighter and leaner than his predecessors, but he nonetheless plays above his weight class in terms of physicality, and he's an elastic, turbocharged long-strider whose blend of short-area quickness, throttle freedom, and breakaway speed routinely leaves defenders in the lurch. As an athlete, Love has superlative short-range and long-range dynamic ability, which he maximizes with sharp vision, patience, spatial IQ, and manipulative tendencies setting up gaps.\n\nAnd while he's not the heaviest, he's able to work through contact nonetheless with his balance, lower-body action, and fearless tenacity. Overall, Love is a bona fide RB1, who also excelled as a receiving threat and RAC weapon in 2025. He bears similarity to Ahman Green, and has a productive career with All-Pro potential in his future.",
    "positionRank": 1,
    "grade": 89.68
  },
  {
    "id": "carnell-tate",
    "name": "Carnell Tate",
    "position": "WR",
    "school": "Ohio State",
    "rank": 6,
    "height": "6-3",
    "weight": "195",
    "year": "Junior",
    "analystRanks": {
      "B/R": 8,
      "CBS": 4,
      "ESPN": 11,
      "PFF": 8,
      "PFSN": 4,
      "The Athletic": 10
    },
    "analysis": "Carnell Tate is PFSN's WR1 in the 2026 NFL Draft, and a true X-factor in waiting. He first showed promise with a 52-733-4 receiving line in 2024, producing in spite of his place as the Buckeyes' third option alongside Jeremiah Smith and first-round NFL Draft pick Emeka Egbuka. But in 2024, Tate's technical feel was still underdeveloped.\n\nHe was primarily a vertical threat for Ohio State, who lacked polish. He flipped the script 180 degrees in 2025, reinventing his game and becoming a true route running expert with rare sink, throttle control, and stem IQ for his size. Tate still has the long-strider range, body control, and logic-defying catch-point focus that makes him so potent in 50-50 situations (he boasts a jaw-dropping 28.2% catch rate over expectation, per TruMedia), but at the same time, he's a deadly multi-level separator who can win 1-on-1, convert on clutch downs, and generate big plays.\n\nHe's not an overly dynamic RAC threat, but as a complete X-receiver, Tate has All-Pro upside within the exceedingly uncommon and invaluable George Pickens mold.",
    "positionRank": 1,
    "grade": 91
  },
  {
    "id": "jordyn-tyson",
    "name": "Jordyn Tyson",
    "position": "WR",
    "school": "Arizona State",
    "rank": 7,
    "height": "6-2",
    "weight": "200",
    "year": "RS Junior",
    "analystRanks": {
      "B/R": 10,
      "CBS": 3,
      "ESPN": 9,
      "PFF": 7,
      "PFSN": 9,
      "The Athletic": 8
    },
    "analysis": "Jordyn Tyson entered the 2026 NFL Draft cycle as PFSN's preliminary WR1, and he remains a very real WR1 candidate near the top of the board. At 6'1\", 195 pounds, Tyson blends the line between bigger catch-dominating WRs and smaller route-dominating ones. At his size, he's an effortless accelerator, and a snappy and fluid short-area mover, with bristling foot quickness and elastic stride freedom that translates well both as a stem operator and in the RAC phase.\n\nHe's a composed downfield tracker who can make claustrophobic catches at high speeds, and he's a budding route technician whose malleable makeup and panic-inducing speed produces limitless possibilities as a separator. The biggest question mark of Tyson's evaluation isn't anything on film; rather, it's his durability. He never played through a full season at the collegiate level, and has a torn ACL, MCL, and PCL on his record from his time at Colorado.\n\nThat major injury hasn't at all affected Tyson's mobility or fluidity as an athlete, but the medical evaluation at the NFL Combine will be key if he is to keep his standing alongside Tate and Lemon. Nevertheless, if Tyson can stay healthy, he's arguably the most complete three-level threat in the 2026 NFL Draft.",
    "positionRank": 2,
    "grade": 90.59
  },
  {
    "id": "peter-woods",
    "name": "Peter Woods",
    "position": "DT",
    "school": "Clemson",
    "rank": 8,
    "height": "6-3",
    "weight": "315",
    "year": "Junior",
    "analystRanks": {
      "B/R": 9,
      "CBS": 8,
      "ESPN": 14,
      "PFF": 9,
      "PFSN": 10,
      "The Athletic": 12
    },
    "analysis": "Peter Woods entered the 2026 NFL Draft cycle as one of the few blue-chip prospects on PFSN's board, and a prime contender for the top overall spot. His 2025 season was a notable regression, but he was still one of the more consistent pieces on Clemson's defensive line, and his flashes of brilliance will ensure he remains in Round 1 range. At 6'3\", 315 pounds, Woods blends natural leverage, a hyperdense frame, rare raw power, and near-inhuman attack explosiveness with a violent disposition, ready-made rush and run defense execution, and vast alignment versatility.\n\nWoods isn't the longest player, and he occasionally drifts too far upright and loses lower-body load post-contact. And particularly in 2025, he appeared visibly less flexible than he did a year prior -- a potential byproduct of him adding over 10 pounds in weight. Woods' optimal playing weight may be lighter than he existed in 2025, but regardless, he has the hyper-elite explosion, lateral agility, and point-of-attack power to be an alignment-versatile disruptor at 3-tech and beyond, and he's still climbing toward his all-league ceiling.",
    "positionRank": 1,
    "grade": 88.41
  },
  {
    "id": "david-bailey",
    "name": "David Bailey",
    "position": "EDGE",
    "school": "Texas Tech",
    "rank": 9,
    "height": "6-3",
    "weight": "250",
    "year": "Senior",
    "analystRanks": {
      "B/R": 11,
      "CBS": 16,
      "ESPN": 4,
      "PFF": 6,
      "PFSN": 14,
      "The Athletic": 13
    },
    "analysis": "David Bailey has skyrocketed up the 2026 NFL Draft board, largely on account of his unmatched pass-rush dynamism and production on later downs. In 2025, after transferring from Stanford, Bailey emerged as the star of Texas Tech's elite defensive line and a consensus All-American, amassing 14.5 sacks, 19.5 tackles for loss, three pass breakups, three forced fumbles, and an elite PFSN EDGE Impact grade of 92.9, that stands as the best score in the entire nation. At 6'3\", 250 pounds, with plus proportional length, Bailey is a lean, hyper-explosive rush linebacker with a logic-defying first-step, deadly off-setting twitch and energy, a ruthless motor, and the searing speed to run the arc against hapless blockers.\n\nHe flashes legitimate speed-to-power with his fast-striding acceleration, compact mass, and length, and while he can be more consistent in run defense, he has flashed the ability to properly stack-and-shed and control blocks 1-on-1. As of now, Bailey is best as a pass-rush specialist; he needs to improve his lower-body strength to avoid giving up displacement at the NFL level, or he risks losing early-down utility. Additionally, he can improve his discipline, as his over-aggression can lead to penalties.\n\nBut regardless, Bailey's pass-rush value is at the caliber that very few other players can replicate. He's a banshee off the edge with blue-chip upside as a pass-rush presence, and the building blocks are there for him to build a complete three-down game.",
    "positionRank": 2,
    "grade": 88.59
  },
  {
    "id": "spencer-fano",
    "name": "Spencer Fano",
    "position": "OT",
    "school": "Utah",
    "rank": 10,
    "height": "6-6",
    "weight": "308",
    "year": "Junior",
    "analystRanks": {
      "B/R": 13,
      "CBS": 6,
      "ESPN": 7,
      "PFF": 17,
      "PFSN": 11,
      "The Athletic": 11
    },
    "analysis": "Spencer Fano is one of the favorites to be the first tackle taken in the 2026 NFL Draft, and his raw talent serves as a powerful separator underneath a profile that's becoming more refined.The 6'5\", 304-pound Fano has a combined athletic and power profile that's near-impossible to replicate. His acceleration is lethal when traversing gaps, launching off the line, and exploding into space, and his burst, length, and leverage make him a natural-born displacer in the run game, with a combative finishing mentality. As a pass blocker, Fano's anchor footwork still needs work, but he improved his feet replacement and anchor swivel in 2025.\n\nHe's always brought rapid recalibration quickness and force as a hand fighter, along with incredible recovery athleticism and range, but in 2025, he built off of that quickness with improved hand strike precision and upper-lower sync, adding upkicks and violent snatches to his game. A scheme-versatile run blocking savant with the elite matching athleticism and recovery to thrive in pass protection, Fano has impact starter potential.",
    "positionRank": 1,
    "grade": 89.15
  },
  {
    "id": "jermod-mccoy",
    "name": "Jermod McCoy",
    "position": "CB",
    "school": "Tennessee",
    "rank": 11,
    "height": "6-0",
    "weight": "193",
    "year": "RS Junior",
    "analystRanks": {
      "B/R": 7,
      "CBS": 9,
      "ESPN": 20,
      "PFF": 12,
      "PFSN": 17,
      "The Athletic": 9
    },
    "analysis": "Jermod McCoy is a frontrunner to challenge for the CB1 mantle in the 2026 NFL Draft, in spite of missing the entire 2025 season amidst his recovery from a torn ACL. At 5'11\", 193 pounds, McCoy doesn't quite have the desired size profile. But at his size, McCoy has solid proportional length, to go along with elite explosiveness, long-strider acceleration on the attack, and hyper-elite hip fluidity, deceleration, and malleability on transitions.\n\nHe's an instant closer off his plant-and-drive, and a fleet-footed and fluid short-area mover with easy matching athleticism. In press, he can stay square and dictate releases with physicality, and he's a smooth mover in zone with tremendous throttle control, vision, and reactive coil overtop route breaks. All this, and McCoy's playmaking might be his most exciting trait; he snagged four INTs in 2024.\n\nMcCoy's medical checks will be key, but if those prove sound, he's a complete, scheme-versatile cover man and a turnover generator in the mold of Darius Slay.",
    "positionRank": 1,
    "grade": 88.46
  },
  {
    "id": "keldric-faulk",
    "name": "Keldric Faulk",
    "position": "EDGE",
    "school": "Auburn",
    "rank": 12,
    "height": "6-6",
    "weight": "285",
    "year": "Junior",
    "analystRanks": {
      "B/R": 17,
      "CBS": 13,
      "ESPN": 12,
      "PFF": 13,
      "PFSN": 19,
      "The Athletic": 4
    },
    "analysis": "Keldric Faulk breaks the mold for what's possible at the EDGE position. At 6'5\", 288 pounds, the Auburn junior possesses top-flight lean mass, length and reach, and explosive, energized athleticism. His hyper-elite power profile, rare raw strength, and fast-striding pursuit speed makes him a multiphase nightmare in theory, but his pass-rush projection has caused debate in the lead-up to the 2026 NFL Draft cycle.\n\nFaulk flashed exciting growth as a pass-rusher en route to seven sacks and 11 TFLs in 2024, but that production stagnated in 2025. Faulk's run defense remained near-elite in 2025, to be sure; he's shown he can reset the line, stack-and-shed blocks, and set a firm edge with his raw explosion, length, and size-defying leverage acquisition skills. However, his pass-rush plan and counters remain inconsistent, as does his lower-body power application and pad level farther into pass-rush reps.\n\nFaulk possesses astronomical two-phase upside and inbuilt alignment versatility, but in the pass-rush phase, he's still a long way from realizing that potential. Purely from an archetypal standpoint, he's not dissimilar from Mykel Williams, who went 11th overall in the 2026 NFL Draft. With Faulk, you're gambling on the unrealized pass-rush upside, but can take comfort in his ready-made run defense profile.",
    "positionRank": 3,
    "grade": 88.12
  },
  {
    "id": "sonny-styles",
    "name": "Sonny Styles",
    "position": "LB",
    "school": "Ohio State",
    "rank": 13,
    "height": "6-4",
    "weight": "243",
    "year": "Senior",
    "analystRanks": {
      "B/R": 21,
      "CBS": 11,
      "ESPN": 10,
      "PFF": 10,
      "PFSN": 7,
      "The Athletic": 24
    },
    "analysis": "Sonny Styles at times gets overlooked alongside his teammate Arvell Reees, but there's a strong argument to make Styles is the true top off-ball LB in the class, with Reese being a potential EDGE convert. A former safety who started 12 games in 2023, Styles switched to LB in 2024 and was a revelation for the Buckeyes' Championship defense, racking up 100 tackles, 11 TFLs, six sacks, five PBUs, and a forced fumble. In 2025, Styles earned first-team All-Big Ten and All-American honors, and distinguished himself as one of the best defenders in the nation.\n\nAt 6'5\", 243 pounds, with over 33\" arms, Styles' size and length, combined with his explosiveness, quickness, and playmaking range, can take over in both phases, and he's an incredibly intelligent defender with elite read-and-react skills. With his safety background, he's an incredibly natural coverage defender who can manage short and intermediate zones, but he's also a combative block attacker, a shrewd gap invader, and a dynamic pass-rushing presence with bend and burst. Positional value will naturally come up in conversations regarding Styles, but he's a blue-chip LB prospect with his raw grade, and has All-Pro potential as a MIKE or WILL in the NFL.",
    "positionRank": 2,
    "grade": 92.8
  },
  {
    "id": "francis-mauigoa",
    "name": "Francis Mauigoa",
    "position": "OT",
    "school": "Miami (FL)",
    "rank": 14,
    "height": "6-6",
    "weight": "315",
    "year": "Junior",
    "analystRanks": {
      "B/R": 15,
      "CBS": 14,
      "ESPN": 8,
      "PFF": 19,
      "PFSN": 15,
      "The Athletic": 14
    },
    "analysis": "Francis Mauigoa has long been anticipated as a potential first-round pick in the 2026 NFL Draft. After joining the Hurricanes as a five-star recruit, he immediately entered the fray as a full-time starter at offensive tackle, and earned second-team All-ACC honors in 2024. In 2025, he was a first-team All-ACC competitor and a consensus All-American.\n\nAt 6'6\", 335 pounds, Mauigoa has exceptional mass and inbuilt power, and he's a nimble, explosive, and rangy mover with easy hip flexibility, torque, and realignment freedom. More than that, he's already an incredibly balanced mover and an advanced hand-fighter, who specializes as an opportunistic attacker with situational adaptability. Momentary lapses in intensity occasionally appear on his tape, and his middling length might hint at a more productive NFL future as a guard.\n\nNonetheless, he can be an impact starter at either spot, with a persistent poise and precision in pass protection and a mauling edge in the ground game.",
    "positionRank": 2,
    "grade": 88.26
  },
  {
    "id": "mansoor-delane",
    "name": "Mansoor Delane",
    "position": "CB",
    "school": "LSU",
    "rank": 15,
    "height": "6-0",
    "weight": "190",
    "year": "Senior",
    "analystRanks": {
      "B/R": 3,
      "CBS": 24,
      "ESPN": 16,
      "PFF": 14,
      "PFSN": 12,
      "The Athletic": 17
    },
    "analysis": "Mansoor Delane leaves the 2025 season as an almost four-year starter at the collegiate level, and he saved his best for last. In 2025, Delane amassed two INTs and 11 pass breakups, while earning the highest CB Impact score in the entire class, with a figure of 96.8. On top of that Impact score, Delane limited opposing QBs to a 26.7 passer rating per TruMedia, and he also boasts an insane forced incompletion percentage of 31.8%, and allows a reception just once every 26.8 coverage snaps.\n\nDelane is as lockdown as lockdown gets in coverage, and it's a product of his experience, coverage mobility, inherent technical versatility, playmaking propensity, and football IQ. At 6'0\", 187 pounds, Delane is a fast and fluid mover with great vertical speed, effortless stride variation and sink, and brisk recalibrative twitch. He has boundary-nickel flexibility, and is a formidable presence on crack-and-replace blocks in run support.\n\nHis tackling can be a bit more consistent, but that's one of a select few holes to poke in his game. Delane's coverage framework is arguably best-in-class, and he's a versatile and ultra-sound three-down defender outside of that, with All-Pro upside at the NFL level.",
    "positionRank": 2,
    "grade": 88.52
  },
  {
    "id": "makai-lemon",
    "name": "Makai Lemon",
    "position": "WR",
    "school": "USC",
    "rank": 16,
    "height": "5-11",
    "weight": "195",
    "year": "Junior",
    "analystRanks": {
      "B/R": 18,
      "CBS": 18,
      "ESPN": 15,
      "PFF": 11,
      "PFSN": 8,
      "The Athletic": 18
    },
    "analysis": "Makai Lemon managed to force his way into the WR1 discussion alongside Carnell Tate and Jordyn Tyson with an incredible 2025 campaign. He entered his junior year at USC as the Trojans’ leading receiver after a standout first season as a starter, posting 52 catches for 764 yards and three touchdowns in 2024. He followed that up with 79 catches for 1,156 yards and 11 touchdowns in 2025, as well as a top-five national PFSN WR Impact grade of 85.1.\n\nAt 5'11\" and 195 pounds, Lemon is an excellent route runner with electric play speed, sharp footwork, and impressive body control that allow him to create consistent separation. He tempos his routes with nuance and shows the awareness to find soft spots and win on releases and breaks, and he's an incredibly dynamic RAC threat with quickness and contact balance. But uncharacteristically for his size, his chief specialization is arguably as a 50-50 presence; he's an elite body control and timing technician in 50-50 situations with vice-grip hand strength.\n\nLemon's uncertain projection against press coverage is the only thing holding him back in the WR1 race. He aces the combined film and analytical evaluation, and is the next hybrid power-slot to take the league by storm after Jaxon Smith-Njigba.",
    "positionRank": 3,
    "grade": 89.17
  },
  {
    "id": "kenyon-sadiq",
    "name": "Kenyon Sadiq",
    "position": "TE",
    "school": "Oregon",
    "rank": 17,
    "height": "6-3",
    "weight": "245",
    "year": "Junior",
    "analystRanks": {
      "B/R": 14,
      "CBS": 22,
      "ESPN": 13,
      "PFF": 24,
      "PFSN": 16,
      "The Athletic": 15
    },
    "analysis": "Kenyon Sadiq entered his junior year at Oregon as one of the nation’s most intriguing tight end prospects, having posted a 24-308-2 receiving line in 2024 and adding five carries for 24 yards while backing up Terrance Ferguson. In 2025, he realized his potential as the true TE1 of the 2026 NFL Draft class, accruing 51 catches for 560 yards and eight TDs. At 6'3\" and almost 250 pounds, Sadiq has a hyper-dense and muscular frame, which he combines with elite explosive athleticism, fluidity, and seam-splitting speed.\n\nOregon utilized Sadiq's athleticism often in RAC and seam-beating situations, but he also grew as an independent separator, more than once using his quickness to off-set or freeze defenders at stems before surging into space. At the catch point, Sadiq's body control is a sight to behold, and he has the composure to hold strong in contact situations. Moreover, Sadiq's explosiveness and contact balance mix well in the RAC phase, and he's an extremely impressive blocker for his size, with a high degree of natural leverage, range, physicality, and alignment versatility.\n\nSadiq can still improve his lower-body strength in-line; Indiana exploited his preference for attack displacement as opposed to power resistance. Nevertheless, Sadiq profiles as an immediate two-phase asset in the NFL.",
    "positionRank": 1,
    "grade": 88.3
  },
  {
    "id": "avieon-terrell",
    "name": "Avieon Terrell",
    "position": "CB",
    "school": "Clemson",
    "rank": 18,
    "height": "5-11",
    "weight": "180",
    "year": "Junior",
    "analystRanks": {
      "B/R": 19,
      "CBS": 12,
      "ESPN": 22,
      "PFF": 18,
      "PFSN": 18,
      "The Athletic": 19
    },
    "analysis": "Avieon Terrell aims to keep both his school and family legacy alive by challenging for first-round capital in the 2026 NFL Draft. The younger brother of former Clemson great and current Falcons starter A.J. Terrell, Avieon has carved out his own place as a stalwart secondary defender for the Tigers.\n\nHe stacked two interceptions and 21 pass breakups over his final two seasons, and also took on a penchant for \"peanut punches\", racking up eight forced fumbles in the support phase. As a prospect, the younger Terrell doesn't quite have the same size-speed combination his brother had, but Avieon is nonetheless a Round 1 talent in his own right. Terrell is one of the most technically and schematically-versatile CBs in the class.\n\nWith his fast feet, fluid mobility, recovery burst, and sound technique, he can play press-man, flawlessly orient to WRs in off-man and toggle through techniques, or manage route relationships in zone. Terrell also has actionable slot-boundary versatility on day one, and he's a true two-phase playmaker with ball skills against the pass and a unique turnover-generating potential in run defense. An up-and-coming young player with an unnaturally high floor, Terrell has instant impact starter ability.",
    "positionRank": 3,
    "grade": 88.33
  },
  {
    "id": "kadyn-proctor",
    "name": "Kadyn Proctor",
    "position": "OT",
    "school": "Alabama",
    "rank": 19,
    "height": "6-7",
    "weight": "366",
    "year": "Junior",
    "analystRanks": {
      "B/R": 22,
      "CBS": 20,
      "ESPN": 23,
      "PFF": 25,
      "PFSN": 26,
      "The Athletic": 16
    },
    "analysis": "Kadyn Proctor is a mammoth offensive lineman, and the next in a long line of Alabama blockers who've made the NFL leap. The question is which position he'll usettle in at long-term. At 6'6\", 369 pounds, Proctor is a true outlier who plays with domineering size and power.\n\nHis hand power and torque can be overwhelming for solo defenders, and his anchor can be suffocating against opposing power rushes. Naturally, Proctor doesn't have elite range, mobility, or flexibility, and he could stand to trim down his weight at the professional level. In particular, his range and flexibility proved to be consistent issues against speed rushers on the outside in 2025.\n\nProctor does flash inspiring foot speed for his size, and he's technically sound for his age, with smooth and efficient footwork, and a strong sense of timing and precision as a hand fighter. Those elements could allow him to stick at OT as a quality starter, but he has impact starter upside inside at guard, where he resembles a prime Leonard Davis with his throttling hand power, devastating torque, and suffocating anchor strength.",
    "positionRank": 3,
    "grade": 85.05
  },
  {
    "id": "olaivavega-ioane",
    "name": "Olaivavega Ioane",
    "position": "OG",
    "school": "Penn State",
    "rank": 20,
    "height": "6-4",
    "weight": "330",
    "year": "Junior",
    "analystRanks": {
      "B/R": 24,
      "CBS": 15,
      "ESPN": 33,
      "PFF": 22,
      "PFSN": 21,
      "The Athletic": 26
    },
    "analysis": "Olaivavega \"Vega\" Ioane is one of the frontrunners to be the first guard taken in the 2026 NFL Draft. Ioane started his first five games in 2023, and then started all 16 games at left guard in 2024, and reprised his role as the Nittany Lions' resident iron man in 2025. At 6'4\", 330 pounds, Ioane fits the ideal profile of an NFL interior lineman.\n\nHe's not the most fleet of foot and can be lumbering on recovery, but he's still a fairly nimble mover who has acceptable functional mobility on the lateral plane, to pair with natural leverage, overwhelming hand power and torque, and impressive two-phase awareness. He can pick up stunts and keep rushers inside his frame in pass protection, while unleashing violent punches from neutral hip alignments, and he's a rangy, angle-sound, and assignment-sound run blocker who can generate copious amounts of movement. A certified mauler and people-mover with a great physical foundation and a technically-sound two-phase profile, Ioane raises an NFL unit's floor on day one.",
    "positionRank": 1,
    "grade": 87.6
  },
  {
    "id": "ty-simpson",
    "name": "Ty Simpson",
    "position": "QB",
    "school": "Alabama",
    "rank": 21,
    "height": "6-2",
    "weight": "208",
    "year": "Junior",
    "analystRanks": {
      "B/R": 28,
      "CBS": 32,
      "ESPN": 21,
      "PFF": 34,
      "PFSN": 30,
      "The Athletic": 2
    },
    "analysis": "Ty Simpson's sample size remains frustratingly small, but the Alabama passer took the NFL Draft world by storm with his quick ascent in 2025. Simpson waited his turn to start at Alabama, and at his best in 2025, that time developing appeared to have molded him into a clear Round 1 passer. But ugly losses to Oklahoma and Indiana exposed Simpson's biggest issues, and even through the wins later in the year, he proved more inconsistent than desired.\n\nOne of Simpson's best traits is his mechanical profile; he has some of the cleanest throwing form in the class, with consistent sync and hip torque across situations. And in his best moments, he's shown he can quickly discern coverage voids pre-snap and anticipate over the middle. That said, his post-snap processing and trigger run hot-and-cold, his situational precision falters too often in spite of his solid mechanics, and his non-elite arm strength shows up when attempting to drive passes downfield.\n\nWith his general freneticism, Simpson could've benefitted from returning to school, but in a scarce QB class, he's the best positioned to benefit. He resembles Marc Bulger with his talent profile and good-not-great operational skill set, and while he may never elevate a team to Super Bowl contention, a quality starting career is on the table.",
    "positionRank": 2,
    "grade": 84.92
  },
  {
    "id": "tj-parker",
    "name": "TJ Parker",
    "position": "EDGE",
    "school": "Clemson",
    "rank": 22,
    "height": "6-3",
    "weight": "260",
    "year": "Senior",
    "analystRanks": {
      "B/R": 23,
      "CBS": 17,
      "ESPN": 36,
      "PFF": 23,
      "PFSN": 27,
      "The Athletic": 25
    },
    "positionRank": 4,
    "grade": 84.66
  },
  {
    "id": "kc-concepcion",
    "name": "KC Concepcion",
    "position": "WR",
    "school": "Texas A&M",
    "rank": 23,
    "analystRanks": {
      "B/R": 16,
      "CBS": 21,
      "ESPN": 38,
      "PFF": 26,
      "PFSN": 25,
      "The Athletic": 27
    },
    "analysis": "KC Concepcion will be a darling of analytically-minded evaluators after his true freshman breakout at NC State. In his very first collegiate season, Concepcion caught 71 passes for 839 yards and 10 TDs, and added 320 yards on the ground at 7.8 yards per attempt -- good for 1,159 total yards from scrimmage and a total yardage share over 25%. His second season at NC State was much less efficient, but in a new environment in 2025, Concepcion was able to reclaim his standing in the NFL Draft pecking order.\n\nAt 5'11\", 187 pounds, Concepcion is a human joystick with incredible throttle control, change-of-direction, and spatial feel -- traits that lend well to natural separation, RAC ability, and usage versatility. He can still clean up focus drops at times, but his hand technique and catch-point control is otherwise sound. He's an incredibly dynamic RAC weapon, and he's shown he can beat press coverage with calculated quickness and bouts of targeted physicality, suggesting true impact starter and multi-alignment upside as a movement-Z receiver.",
    "positionRank": 4,
    "grade": 87.92
  },
  {
    "id": "kayden-mcdonald",
    "name": "Kayden McDonald",
    "position": "DT",
    "school": "Ohio State",
    "rank": 24,
    "height": "6-3",
    "weight": "326",
    "year": "Junior",
    "analystRanks": {
      "B/R": 55,
      "CBS": 25,
      "ESPN": 19,
      "PFF": 21,
      "PFSN": 20,
      "The Athletic": 21
    },
    "analysis": "Kayden McDonald followed in first-round pick Tyleik Williams' footsteps as Ohio State's starting nose tackle, and now he's on track to potentially mirror Williams' draft capital in the 2026 NFL Draft. A former four-star recruit, McDonald tips the scales at 6'3\", 326 pounds, and at his size, he has awesome on-attack explosiveness and raw power capacity. Juxtaposing McDonald with Williams, Williams was visibly more flexible and alignment versatile.\n\nNevertheless, McDonald serves his early-down purpose well as a double-team magnet, combo absorber, line reset specialist, and block shedder. Meanwhile, he has the high-level linear explosion and throttling point-of-attack power to cave in step-up space on passing downs, as well as the motor to finish plays. While he'll never be an elite pass-rush force, McDonald is an excellent orbit DT at 0-tech and 1-tech, with the overwhelming point-of-contact power to wreak havoc in the run game, and the juice to be a respectable three-down presence.",
    "positionRank": 2,
    "grade": 86.26
  },
  {
    "id": "cashius-howell",
    "name": "Cashius Howell",
    "position": "EDGE",
    "school": "Texas A&M",
    "rank": 25,
    "height": "6-2",
    "weight": "248",
    "year": "Senior",
    "analystRanks": {
      "B/R": 12,
      "CBS": 31,
      "ESPN": 26,
      "PFF": 15,
      "PFSN": 47,
      "The Athletic": 32
    },
    "analysis": "Cashius Howell rose to prominence at Bowling Green, where he accrued 9.5 sacks and 11 tackles for loss as a redshirt sophomore in 2023. Howell transferred to Texas A&M in 2024, and while he was at times lost in a rotation that included Shemar Stewart and Nic Scourton, he managed to flash promise with limited reps. In 2025, Howell achieved his own level of stardom, amassing 11.5 sacks, 14 TFLs, and six pass breakups.\n\nHe earned All-American honors for his play, and fielded a stellar PFSN EDGE Impact score of 82.8. While Howell isn't the longest or the heaviest rusher, he wins with a fluid finesse, easy acceleration, and attack instinct that makes blockers struggle to position against him, and he has a vast arsenal of moves -- from stutter-swims and rips to ghost moves and feigned extensions. He'll likely measure in with sub-31\" arms, and his power deficiency is a concern on film, as he struggles to consistently pop and displace blockers attacking inside the torso, and often avoids such strategies as a result.\n\nHowell's build and lacking power element relegates him to wide-alignment, odd-front rush LB roles, but in that role, he can thrive. He's a smooth and savvy pass-rush presence, whose upside as a designated pressure generator is astronomical, and his motor gives him value in pursuit.",
    "positionRank": 5,
    "grade": 82.18
  },
  {
    "id": "caleb-lomu",
    "name": "Caleb Lomu",
    "position": "OT",
    "school": "Utah",
    "rank": 26,
    "height": "6-6",
    "weight": "304",
    "year": "RS Sophomore",
    "analystRanks": {
      "B/R": 46,
      "CBS": 27,
      "ESPN": 17,
      "PFF": 27,
      "PFSN": 13,
      "The Athletic": 37
    },
    "analysis": "Caleb Lomu is one of two Utah tackles in contention for the top OT spot in the 2026 NFL Draft. At a long and lean 6'5\", 302 pounds, Lomu underpins his game with an incredible blend of explosion and flexibility, which amounts to awe-inspiring recovery athleticism. In the run game, while he's not as powerful as his teammate, he can pull off high-difficulty reach blocks and fulfill his assignments dutifully.\n\nAnd in 2025, he improved his point-of-attack power and displacement on down and base blocks. Meanwhile, in pass protection, Lomu is a malleable lower-body technician and a methodical, precise hand-fighter, whose hyper-elite flexibility serves as an ironclad failsafe to swivel his anchor, absorb power, acquire leverage, and play with controlled lean. A safe prospect who's stamped in pass protection and trending up in the run game, Lomu is worthy his assigned Round 1 status and has impact starter potential.",
    "positionRank": 4,
    "grade": 89.23
  },
  {
    "id": "cj-allen",
    "name": "CJ Allen",
    "position": "LB",
    "school": "Georgia",
    "rank": 27,
    "height": "6-1",
    "weight": "235",
    "year": "Junior",
    "analystRanks": {
      "B/R": 32,
      "CBS": 33,
      "ESPN": 27,
      "PFF": 28,
      "PFSN": 28,
      "The Athletic": 22
    },
    "positionRank": 3,
    "grade": 86.12
  },
  {
    "id": "denzel-boston",
    "name": "Denzel Boston",
    "position": "WR",
    "school": "Washington",
    "rank": 28,
    "height": "6-4",
    "weight": "209",
    "year": "Junior",
    "analystRanks": {
      "B/R": 38,
      "CBS": 36,
      "ESPN": 24,
      "PFF": 20,
      "PFSN": 35,
      "The Athletic": 20
    },
    "analysis": "Denzel Boston entered his junior season at Washington poised to headline the Huskies’ receiving corps after waiting his turn behind NFL-bound stars like Rome Odunze, Ja’Lynn Polk, and Jalen McMillan. Standing at 6'4\" and 209 pounds, Boston broke out in 2024 with a 63-834-9 receiving line, thriving as a red-zone mismatch and showing off his expansive catch radius and reliable hands. While not an especially twitchy athlete, Boston moves efficiently for his size, stacks cornerbacks on the outside with smooth explosion and long-strider speed, and competes well through contact.\n\nHe boasted a miniscule 1.2% drop rate in 2025 per TruMedia, while hauling in 881 yards and 11 TDs on 62 receptions. Boston's ability to high-point passes and make difficult grabs makes him a go-to weapon when space tightens, and he magnifies his vice-grip hand strength with intelligent timing control and catch-point positioning. With more than enough fluidity, tempo management skills, and zone IQ to function as a route runner, Boston has an appealing X-receiver profile, and has impact starter potential.",
    "positionRank": 5,
    "grade": 86.05
  },
  {
    "id": "brandon-cisse",
    "name": "Brandon Cisse",
    "position": "CB",
    "school": "South Carolina",
    "rank": 29,
    "height": "6-0",
    "weight": "190",
    "year": "Junior",
    "analystRanks": {
      "B/R": 54,
      "CBS": 44,
      "ESPN": 30,
      "PFF": 32,
      "PFSN": 23,
      "The Athletic": 23
    },
    "analysis": "Brandon Cisse is a young and ascending cornerback prospect who declared for the 2026 NFL Draft after a standout 2025 campaign that saw him earn a PFSN CB Impact grade of 80.9. Cisse will be just 21 years old as a rookie, and his coverage mobility is a massive strength; these two factors alone make him a viable early-round prospect. At 6'0\", 190 pounds, with functional length, Cisse is an exceedingly explosive, springy, and nimble mover with propulsive hip sink and elite short-area energy.\n\nHe's quick to react, with swarming lateral explosive range, and inspiring route vision in off-man and zone. Going further, he flashes high-level coordination as a catch-point playmaker, and he's extremely competitive in support. Where Cisse stands to improve the most is in press-man -- his timing and upper-lower sync are inconsistent -- and he can also be prone to biting on double-moves working with cushion.\n\nThat said, all of the physical tools and the temperament qualities are there to support Cisse's continued ascent toward becoming an impact NFL starter.",
    "positionRank": 4,
    "grade": 86.16
  },
  {
    "id": "akheem-mesidor",
    "name": "Akheem Mesidor",
    "position": "EDGE",
    "school": "Miami (FL)",
    "rank": 30,
    "height": "6-3",
    "weight": "280",
    "year": "RS Senior",
    "analystRanks": {
      "CBS": 41,
      "ESPN": 18,
      "PFF": 33,
      "PFSN": 55
    },
    "analysis": "Akheem Mesidor will be a 25-year old rookie, and he has an injury history to take note of, but if his medicals check out, he projects as an instant impact NFL player with a tantalizing skill set. At around 6'2 1/2\" and 273 pounds, he's a streamlined multi-alignment rusher with experience at 3-tech, 5-tech, and as far outside as 7-tech as a standup rusher. He's quick and explosive, with a lean and compact power profile, and he knows how to realign his hips to maximize force output and drive at contact.\n\nIn the passing game, he can be weaponized on stunts, or win 1-on-1 with a variety of swims, power rushes, and counters, and in the run game, he's strong and well-leveraged at the point, and instinctive with his gap alignment. Right away, Mesidor can bolster an NFL team's rotation considerably, and he has the tools and temperament to potentially be an impact starter in his relatively short prime window.",
    "positionRank": 6,
    "grade": 86.06
  },
  {
    "id": "emmanuel-mcneil-warren",
    "name": "Emmanuel McNeil-Warren",
    "position": "SAF",
    "school": "Toledo",
    "rank": 31,
    "height": "6-2",
    "weight": "182",
    "year": "Senior",
    "analystRanks": {
      "B/R": 20,
      "CBS": 29,
      "ESPN": 44,
      "PFF": 51,
      "PFSN": 43,
      "The Athletic": 39
    },
    "analysis": "Emmanuel McNeil-Warren is in line to be the first lower-conference player selected in the 2026 NFL Draft. He doesn't play the same position Toledo alumnus Quinyon Mitchell played, but is nonetheless a similarly dynamic prospect. At over 6'3\", 209 pounds, with over 32\" arms, McNeil-Warren has domineering size and length, which he pairs with wicked foot speed, bounding lateral explosiveness and agility, and terse two-phase physicality.\n\nHe's a force to be reckoned with in support with his fast-flowing play style and closing burst, but he's also shown he can manage short and intermediate zones in coverage with his smooth coverage mobility, process overlapping routes and keep spatial discipline in 2-on-1 situations, and make plays on the ball with his closing burst and proactive length usage. A strong fit for a traditional strong safety role, McNeil-Warren could be a value pick in the early Day 2 range.",
    "positionRank": 2,
    "grade": 84.76
  },
  {
    "id": "christen-miller",
    "name": "Christen Miller",
    "position": "DT",
    "school": "Georgia",
    "rank": 32,
    "height": "6-4",
    "weight": "305",
    "year": "Senior",
    "analystRanks": {
      "B/R": 37,
      "CBS": 38,
      "ESPN": 57,
      "PFF": 30,
      "PFSN": 32,
      "The Athletic": 33
    },
    "analysis": "Christen Miller isn't quite the caliber of DT prospect we've seen from Georgia in years past, but he's still a very real early-round candidate with an NFL-translatable superpower that underpins his game. At 6'4\", 315 pounds, with high-end natural leveraging, burst, and length, Miller has an eye-popping power profile that enables him to routinely reset the line in the run game. With sledgehammer hands, he can collapse blockers 1-on-1, and he has the raw power and strength to violently stack-and-shed.\n\nMiller is still developing as a pass-rusher beyond quick swims and raw power, as evidenced by his lacking production, but down the stretch in 2025, he flashed promise as a pass-rusher with his short-area quickness and heavy hand torque. Miller's slight hip flexibility deficiency does cap his pass-rush upside a bit, but his floor in run defense is sky-high with his reactive quickness and shedding ability, and he has the linear athleticism and point-resetting power profile to grow as a pass-down asset.",
    "positionRank": 3,
    "grade": 84.43
  },
  {
    "id": "colton-hood",
    "name": "Colton Hood",
    "position": "CB",
    "school": "Tennessee",
    "rank": 33,
    "height": "6-0",
    "weight": "195",
    "year": "RS Sophomore",
    "analystRanks": {
      "B/R": 56,
      "CBS": 55,
      "ESPN": 35,
      "PFF": 29,
      "PFSN": 29,
      "The Athletic": 31
    },
    "analysis": "Colton Hood began his collegiate career at Auburn, before transferring to Colorado to join a talented secondary alongside Travis Hunter and DJ McKinney. Rotating in between two high-profile NFL Draft prospects, Hood managed to produce on his own in 2024, earning honorable mention All-Big 12 recognition. He used that momentum to transfer a second time in 2025, making the move to Tennessee in the SEC.\n\nWith the Volunteers, Hood was again expected to be a CB2 playing across from Jermod McCoy, but McCoy's early-season injury thrust Hood into a CB1 role, where he thrived. In 2025, Hood racked up an INT, eight pass breakups, and 4.5 TFLs, while earning a near-elite PFSN CB Impact score of 87.3. At 6'0\", 195 pounds, Hood has an enticing blend of explosiveness, corrective twitch, reactive coil, proportional length, and physicality.\n\nHe's still learning to play with more patience and discipline, but he possesses clear early-round ability, with his coverage mobility as the foundation. Hood can stick to WRs in press-man, as well as suddenly redirect and explode through breaks in off-man and zone. His playmaking ability is stamped at the catch point, and he's a consistent tackler in support as well.\n\nIn time, Hood has the potential to become a high-end starter with inbuilt schematic versatility.",
    "positionRank": 5,
    "grade": 86.72
  },
  {
    "id": "caleb-banks",
    "name": "Caleb Banks",
    "position": "DT",
    "school": "Florida",
    "rank": 34,
    "height": "6-6",
    "weight": "330",
    "year": "Senior",
    "analystRanks": {
      "B/R": 96,
      "ESPN": 28,
      "PFF": 16,
      "PFSN": 22,
      "The Athletic": 41
    },
    "analysis": "Caleb Banks broke out with four sacks and seven TFLs in 2024, showing off blue-chip raw tools in the process. At 6'6\", 325 pounds, with arms over 35\", he has overwhelming size, length, and forklift power, to pair with inhuman burst and quickness at that size. His rare raw talent has grandfathered him into the \"stack-and-shed nightmare\" category, and he flashes excellence as a pass-rusher with swims, swipes, and long-arms.\n\nBanks needs more control and counter consistency, but his physical makeup is ready-made for instant impact at the NFL level. The major questions come from his medical history and lack of availability in 2025. He's had foot issues in the past and suffered another injury that required a procedure against LSU, and ultimately caused him to miss most of the 2025 season.\n\nThere's a definite lack of certainty regarding Banks' projection, on account of his small on-field sample size. That said, Banks has true 100th-percentile tools, and has the potential to be utilized as an alignment-versatile game-wrecker. The pre-draft cycle will determine how high he rises, but his raw potential is impossible to ignore.",
    "positionRank": 4,
    "grade": 88.5
  },
  {
    "id": "keionte-scott",
    "name": "Keionte Scott",
    "position": "CB",
    "school": "Miami (FL)",
    "rank": 35,
    "height": "6-0",
    "weight": "195",
    "year": "Senior",
    "analystRanks": {
      "CBS": 34,
      "ESPN": 39,
      "PFF": 54,
      "PFSN": 38
    },
    "analysis": "Keionte Scott emerged as one of the stars of Miami's National Championship run, and he has similarly ascended as an extremely compelling 2026 NFL Draft prospect. After drawing little national interest out of high school, Scott began his career at Snow College. After a two-year stretch that saw Scott serve as a team captain and two-time JUCO All-American, he transferred to Auburn.\n\nFor two years, Scott served as a rotational player for the Tigers, at times battling through injuries, before reaching his final evolution at Miami. In 2025 with the Hurricanes, he amassed 13 tackles for loss, five sacks, and two pick-sixes, while earning a PFSN CB Impact grade of 85. As a versatile nickel defender, Scott has one of the strongest foundations in the entire class.\n\nHe's an uber-explosive long-striding closer, a springy coverage and support defender, and an elite processor with a fast-flowing style and relentless physicality. He'll be an older rookie, but Scott has immediate impact potential as a nickel, with schematic versatility but a particular affinity for off-man and zone.",
    "positionRank": 6,
    "grade": 88.31
  },
  {
    "id": "emmanuel-pregnon",
    "name": "Emmanuel Pregnon",
    "position": "OG",
    "school": "Oregon",
    "rank": 36,
    "height": "6-5",
    "weight": "318",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 49,
      "CBS": 28,
      "ESPN": 32,
      "PFF": 42,
      "PFSN": 60,
      "The Athletic": 42
    },
    "analysis": "Emmanuel Pregnon spent three years at Wyoming and two at USC, then accentuated his rise from an unranked HS recruit to an early-round NFL Draft prospect with a first-team All-American campaign at Oregon. Pregnon will be an older rookie, which alone may serve as a separator for some teams against Ioane and Bisontis. Nevertheless, Pregnon projects as an immediate starter with impact potential, with some of the most menacing point-of-attack power output in recent memory.\n\nThe 6'5\", 320-pound Pregnon has overwhelming mass and width, and long, powerful levers for arms. His success at Oregon revolved around his ability to get hands on defenders quickly and violently, and anchor or redirect with his power and strength, but he also has more than enough lateral explosion and gap-to-gap range to reach landmarks and climb to the second level. Pregnon's most prevalent limitation is his flexibility; he's visibly stiff in his midsection, which can impact recovery at times.\n\nNevertheless, for a higher-hipped blocker, he leverages himself well, punishes rushers with active hands, sharp vision, and a steady anchor, and he's a professional DT dislodger in the run game, with gap and zone versatility.",
    "positionRank": 2,
    "grade": 84.18
  },
  {
    "id": "jake-golday",
    "name": "Jake Golday",
    "position": "LB",
    "school": "Cincinnati",
    "rank": 37,
    "height": "6-4",
    "weight": "240",
    "year": "Senior",
    "analystRanks": {
      "B/R": 48,
      "CBS": 26,
      "ESPN": 37,
      "PFF": 46,
      "PFSN": 61,
      "The Athletic": 38
    },
    "analysis": "Jake Golday is one of the more notable risers of the 2025 season, and a strong pre-draft process could help him become one of the first linebackers selected in the 2026 NFL Draft. At 6'4\", 240 pounds, Golday has the explosiveness and range to work sideline-to-sideline. He's an instinctive spatial navigator working through creases to make stops at the line, and he also has blitzing utility with his long-strider burst through gaps.\n\nAdditionally, with his size and length, he's able to take on and stack blocks at the second level, and he's shown he can make solo tackles with good form. In coverage, Golday has natural limitations that come from his non-elite sink and fluidity, and he also lacks great zone IQ and spatial awareness. That said, he can at least use his length to clog middle-field windows, and as a read-and-react SAM linebacker, he has the range, physicality, and block take-on to be a consistent presence.",
    "positionRank": 4,
    "grade": 81.72
  },
  {
    "id": "chris-johnson",
    "name": "Chris Johnson",
    "position": "CB",
    "school": "San Diego State",
    "rank": 38,
    "height": "6-0",
    "weight": "185",
    "year": "Senior",
    "analystRanks": {
      "B/R": 59,
      "CBS": 53,
      "ESPN": 29,
      "PFF": 43,
      "PFSN": 33
    },
    "analysis": "Chris Johnson was one of the best cornerbacks in college football in 2025, and he has a chance to be one of the first Group of Six prospects taken in the 2026 NFL Draft. At 6'0\", 185 pounds, Johnson is a bit smaller and lighter than preferred, and this plays into his stylistic preference to match with cushion in off-man coverage and zone. But in space, he's one of the best raw movers in the class, with hyperactive foot speed and recalibratory athleticism, crisp fluidity and transition freedom, and swarming range and closing ability out of breaks.\n\nHis coverage mobility helps set the foundation for his elite ball-hawking ability, and for his size, he does a great job engaging blocks and holding up in support on crack-and-replace reps. A high-level playmaker and click-and-close operator who sizes up well for his build in the run game, Johnson has impact starter potential.",
    "positionRank": 7,
    "grade": 85.27
  },
  {
    "id": "monroe-freeling",
    "name": "Monroe Freeling",
    "position": "OT",
    "school": "Georgia",
    "rank": 39,
    "height": "6-7",
    "weight": "315",
    "year": "Junior",
    "analystRanks": {
      "B/R": 95,
      "CBS": 23,
      "ESPN": 25,
      "PFF": 31,
      "PFSN": 44
    },
    "analysis": "Monroe Freeling declared for the 2026 NFL Draft as a true junior, and he'll assuredly be in the mix for an early-round selection at the OT spot. A former highly-touted recruit, Freeling towers at almost 6'7\", 315 pounds, with an overwhelming 84\" wingspan, and he distinguishes himself as an excellent athlete at that size, with menacing power capacity. He's extremely quick off the ball, with exceptional overall proportions, a stable center of gravity, and logic-defying flexibility and leverage acquisition skills at his size.\n\nHis hand usage pallet is still fairly basic at this stage; he can win more often than not with his sheer athleticism and reach. Still, Freeling has an incredibly strong foundation of inherent athleticism and soft skills, he's angle-sound and disciplined in the run game, and in time, he can grow to become an impact starter across both phases.",
    "positionRank": 5,
    "grade": 85.17
  },
  {
    "id": "r-mason-thomas",
    "name": "R Mason Thomas",
    "position": "EDGE",
    "school": "Oklahoma",
    "rank": 40,
    "height": "6-2",
    "weight": "249",
    "year": "Senior",
    "analystRanks": {
      "B/R": 43,
      "CBS": 75,
      "ESPN": 42,
      "PFF": 37,
      "PFSN": 40,
      "The Athletic": 40
    },
    "analysis": "R Mason Thomas flashed promise in limited action in 2022 and 2023, and broke out for the Sooners in 2024 with 9 sacks and 13 tackles for loss. In 2025, he maintained his previous level of production, logging 6.5 sacks, 9.5 TFLs, and earning a solid PFSN EDGE Impact score of 80.6. In-house comparisons will be drawn to former Sooners stud and current Broncos starter Nik Bonitto: Both players are relatively undersized at the EDGE position, but thrive behind their elite burst, bend, and quickness on the attack.\n\nIn truth, Thomas has a lot of work to do before he's the same caliber of player as Bonitto, but it's easy to see the vision. Thomas is a flash off the line with a superlative first step, and he has the combined natural leverage, hip flexibility, and ankle flexion to turn the corner while keeping speed. His motor runs hot, and he's shown he can properly size up and channel speed-to-power with his frame and lower-body action.\n\nThomas does get moved off the line often enough in run defense to fuel concern, and he may be relegated to a designated pass-rusher role at the NFL level. But in that role, Thomas' speed and disruptive imprint can pose a mismatch for opposing offenses.",
    "positionRank": 7,
    "grade": 83.69
  },
  {
    "id": "chris-bell",
    "name": "Chris Bell",
    "position": "WR",
    "school": "Louisville",
    "rank": 41,
    "height": "6-2",
    "weight": "220",
    "year": "Senior",
    "analystRanks": {
      "B/R": 67,
      "CBS": 68,
      "ESPN": 40,
      "PFF": 36,
      "PFSN": 45,
      "The Athletic": 28
    },
    "analysis": "Chris Bell has a profile that NFL teams continually fawn over each and every cycle. At 6'2\", 227 pounds, with 32\" arms and likely 4.4 speed, Bell brings a tantalizing mix of lean mass, play strength, playmaking range, short-area quickness, and long-strider explosion to the fold. His physical profile is dominating, and it enables him to contend in 1-on-1 situations on the vertical plane, as well as accrue devastating volumes of RAC with speed and contact balance.\n\nThe physical potential is where the appeal starts with Bell, but there's promising operational utility present on film as well. Bell has shown he can off-set DBs with fast feet and efficiency on releases and at stems. He can cut tight angles on breaks for his size, and he's a reliable hands-catcher over the middle.\n\nBell is a deadly three-level threat in the making, but his medical situation is a source of uncertainty. He tore his ACL late in the 2025 season, but it was a clean tear with minimal ligament damage, and he had successful surgery. He won't be able to test or take part in pre-draft activities, and his early-season availability may be in question, but as long as Bell is on track to a full recovery, he holds merit as a potential Top 50 pick with explosive movement-Z upside.",
    "positionRank": 6,
    "grade": 86.7
  },
  {
    "id": "keith-abney-ii",
    "name": "Keith Abney II",
    "position": "CB",
    "school": "Arizona State",
    "rank": 42,
    "height": "6-0",
    "weight": "190",
    "year": "Junior",
    "analystRanks": {
      "B/R": 89,
      "CBS": 46,
      "PFF": 35,
      "PFSN": 24
    },
    "analysis": "Keith Abney II was one of the stars of Arizona State's CFB Playoff run in 2024, amassing 52 tackles, three INTs, and nine PBUs in a breakout campaign. As a junior, he compounded that momentum, registering two INTs, 12 pass breakups, and an elite PFSN CB Impact score of 92.9. At around 5'11\",190 pounds, Abney is close to average size, but his most pivotal physical quality is his energized motion and foot speed, combined with his wicked play pace and mental urgency.\n\nHe doesn't quite have elite burst or long speed, but he's more than explosive enough, and he's extremely fluid decelerating and redirecting overtop routes, with a sharp competitive focus and quick processing capacity that enables him to play passes with precision. Abney can work in press-man with his hyper-disciplined mirror-motor, as well as pedal, plant, and drive with efficiency in off-man and zone, and he's unusually consistent as a tackler for his size. Abney's max outcome could be similar to Jaylon Johnson -- a non-elite athlete and at times overlooked prospect, who went on to be a stellar pro with his quicks, fluidity, and competitive consistency.",
    "positionRank": 8,
    "grade": 86.73
  },
  {
    "id": "chris-brazzell-ii",
    "name": "Chris Brazzell II",
    "position": "WR",
    "school": "Tennessee",
    "rank": 43,
    "height": "6-5",
    "weight": "200",
    "year": "RS Junior",
    "analystRanks": {
      "B/R": 34,
      "CBS": 37,
      "ESPN": 47,
      "PFF": 74,
      "PFSN": 54
    },
    "analysis": "Chris Brazzell II had early-round buzz after transferring from Tulane to Tennessee, but his first year with the Volunteers was a \"mulligan\" of sorts, as Brazzell struggled to secure consistent playing time behind future NFL Draft pick Dont'e Thornton. In 2025, however, Brazzell climbed back up the depth chart and took full advantage of his opportunity. At 6'5\", 200 pounds, Brazzell has all of the catch-point skills you'd expect.\n\nHe can create vertical separation and box out DBs with his frame, and he can snare high passes with steely focus and gravity-defying body control. Those elite catch-point traits translated to elite catch-point production in 2025; per TruMedia, he boasted a low 3.4% drop rate and an incredible 16.5% catch rate over expectation. That said, he's also a promising vertical route runner and mover for his size, with the smooth, gliding explosiveness and the effortless flexibility to create and capitalize on angle advantages.\n\nBrazzell isn't as efficient as a RAC presence, and he also has multiple driving violations on his record that will force teams to do due diligence. Nevertheless, if his off-field evaluation checks out, he has tantalizing upside as an explosive vertical-stressing WR2.",
    "positionRank": 7,
    "grade": 82.82
  },
  {
    "id": "anthony-hill-jr",
    "name": "Anthony Hill Jr.",
    "position": "LB",
    "school": "Texas",
    "rank": 44,
    "height": "6-3",
    "weight": "238",
    "year": "Junior",
    "analystRanks": {
      "B/R": 61,
      "CBS": 40,
      "ESPN": 52,
      "PFF": 38,
      "PFSN": 56
    },
    "analysis": "Anthony Hill Jr. amassed a laundry list of accolades in his short time at Texas. He was Big 12 Defensive Freshman of the Year in 2023, after making the leap as a five-star recruit.\n\nIn 2024, he was a first-team All-SEC defender and a first-team All-American, accumulating 113 tackles, 17 TFLs, eight sacks, an INT, a PBU, and four forced fumbles. And in 2025, he once again fielded first-team All-SEC honors while accruing 69 tackles, seven TFLs, four sacks, and two INTs. Looking at his pedigree, production, and his extraordinary physical talent at a lean 6'3\", 235 pounds, Hill passes the eye test as a truly uncommon physical talent.\n\nStylistically, he relies on that hyper-elite raw talent more often than desired. He's best as a run-and-chase linebacker who can eliminate angles upfield and run down runners in pursuit with his full-field range. Additionally, he functions as an incredibly dangerous blitzing threat with his speed and bend, and that same explosive athleticism grants him brisk closing ability in short coverage zones.\n\nHaving said all this, Hill still has room to improve his independent processing and technique at contact. He remains prone to overrunning angles in gap response and falling for option bait, his coverage instincts can be hot-and-cold, and he doesn't consistently attack or dictate in contact situations. Still, as a run-and-chase weapon and a blitzing dynamo in the WILL role on passing downs, Hill has immense upside.",
    "positionRank": 5,
    "grade": 83.29
  },
  {
    "id": "dillon-thieneman",
    "name": "Dillon Thieneman",
    "position": "SAF",
    "school": "Oregon",
    "rank": 45,
    "height": "6-0",
    "weight": "205",
    "year": "Junior",
    "analystRanks": {
      "B/R": 27,
      "CBS": 74,
      "ESPN": 43,
      "PFF": 49,
      "PFSN": 62,
      "The Athletic": 44
    },
    "analysis": "Dillon Thieneman presents optimal value in the Day 2 range as a two-high and roving specialist, who also has the ability to take on single-high responsibilities if needed. Thieneman was an immediate impact contributor as a true freshman at Purdue, accruing 106 tackles, two TFLs, six interceptions, two pass breakups, and two forced fumbles in that standout season. In 2024, he added five TFLs, a sack, and seven PBUs to his career totals.\n\nIn 2025, playing at Oregon, he more often played closer to the line in split-field and box safety roles, but nonetheless remained productive, accruing 96 tackles, 3.5 TFLs, two picks, and five PBUs. At 6'0\", 207 pounds, Thieneman is one of the most intelligent and versatile defenders on the circuit. He's explosive and fluid in coverage, with excellent spatial reasoning skills, route vision, and reaction speed, and he's tenacious and disciplined in support, with sharp play recognition skills, inspiring angle consistency, and incredibly sure tackling ability at the contact point.\n\nThieneman doesn't quite have elite top-end athleticism or fluidity, but his functional athletic floor, paired with his elite mental game and translatable physicality, insulates his value as a future starting safety in split-field schemes.",
    "positionRank": 3,
    "grade": 83.89
  },
  {
    "id": "max-klare",
    "name": "Max Klare",
    "position": "TE",
    "school": "Ohio State",
    "rank": 46,
    "height": "6-5",
    "weight": "243",
    "year": "Junior",
    "analystRanks": {
      "B/R": 50,
      "CBS": 54,
      "ESPN": 41,
      "PFF": 69,
      "PFSN": 37
    },
    "analysis": "Max Klare took his talents from West Lafayette to Columbus this year, suiting up for the Ohio State Buckeyes after a standout 2024 season with the Purdue Boilermakers. It took him a few weeks to get a rhythm, but Klare eventually delivered a quality year at Ohio State, catching 43 passes for 448 yards and two scores. Klare's production naturally inspires confidence, and his tape generates further NFL Draft excitement.\n\nAt 6'4\", 240 pounds, Klare is an instinctive receiving threat with the burst, quickness, flexibility, and spatial IQ to separate independently. He has smooth body control as a catcher, and is an aggressive RAC threat who uses overwhelming leg churn and lower-body action to drive through would-be tackles. Klare's pass-catching profile is extremely appealing, and his immediate blocking versatility and utility upside further magnifies that appeal.\n\nWhile Klare has room to add on more mass at the NFL level, he's a versatile run-game asset who can block in-line, acquire leverage, drive his legs, keep gap integrity, and fulfill his assignments with reliability.",
    "positionRank": 2
  },
  {
    "id": "dangelo-ponds",
    "name": "D'Angelo Ponds",
    "position": "CB",
    "school": "Indiana",
    "rank": 47,
    "height": "5-9",
    "weight": "170",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 39,
      "CBS": 47,
      "ESPN": 78,
      "PFF": 57,
      "PFSN": 41
    },
    "positionRank": 9,
    "grade": 88.31
  },
  {
    "id": "caleb-tiernan",
    "name": "Caleb Tiernan",
    "position": "OT",
    "school": "Northwestern",
    "rank": 48,
    "height": "6-7",
    "weight": "325",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 65,
      "CBS": 48,
      "ESPN": 53,
      "PFF": 45,
      "PFSN": 69,
      "The Athletic": 35
    },
    "analysis": "Caleb Tiernan has started over 40 games across his collegiate career, taking notable reps at both left and right tackle. At the very least, he profiles as a stellar swing tackle candidate right away in his NFL career, but he has legitimiate starting utility as well, and could be a candidate to move inside. Following a long line of NFL talents at tackle for the Northwestern Wildcats, Tiernan builds his reputation on being an extremely well-rounded two-phase blocker.\n\nWhile not overly explosive, he's quick enough for his 6'7\", 325-pound size, with precise and heavy hands and stalwart latch strength. In the run game, he's angle-sound with great urgency and physicality, with quality leverage acquisition skills, and as a pass blocker, he dutifully subscribes to the \"wide base, tight hands\" mantra, and is exceedingly alert against stunts. He has below-average proportional length, which -- combined with his taller frame -- can put him in difficult recovery and re-anchor situations at times, but as a swing tackle or eventual starter at guard, he holds merit.",
    "positionRank": 6
  },
  {
    "id": "lee-hunter",
    "name": "Lee Hunter",
    "position": "DT",
    "school": "Texas Tech",
    "rank": 49,
    "height": "6-4",
    "weight": "321",
    "year": "Senior",
    "analystRanks": {
      "B/R": 108,
      "CBS": 35,
      "ESPN": 34,
      "PFF": 53,
      "PFSN": 39
    },
    "analysis": "Lee Hunter will be a 24-year old rookie, so he may fall outside some teams' age thresholds, but he nonetheless profiles as arguably the most complete nose tackle prospect in the 2026 NFL Draft, and an instant impact interior defensive lineman. Hunter logged 4 sacks and 20.5 tackles for loss at UCF through 2023 and 2024, and upon transferring to Texas Tech, he maintained his high-end production, with 2.5 sacks, 8.5 TFLs, and a strong PFSN DT Impact grade of 81.9. At around 6'4\", 325 pounds, Hunter has excellent natural leverage and mass to go along with good proportional length.\n\nHe's an explosive, energized mover at his size who flashes devastating power output 1-on-1. He has the anchor and latch strength to absorb combo blocks and double teams, and his motor ensures that he's always around the ball.",
    "positionRank": 5,
    "grade": 85.35
  },
  {
    "id": "jadarian-price",
    "name": "Jadarian Price",
    "position": "RB",
    "school": "Notre Dame",
    "rank": 50,
    "height": "5-11",
    "weight": "210",
    "year": "RS Junior",
    "analystRanks": {
      "B/R": 29,
      "CBS": 58,
      "PFF": 60,
      "PFSN": 92,
      "The Athletic": 36
    },
    "analysis": "Jadarian Price naturally gets overlooked at times in the shadow of Heisman finalist and likely first-round pick Jeremiyah Love, but make no mistake: Price is just as compelling as an NFL Draft prospect in his own range. Price might be a bit smaller and leaner than Love, but his utility as a creator and an explosive vertical threat should translate on Sundays. Price has a great blend of vision, spatial instincts, foot speed, smooth fluidity, and cutting range, and he goes 0-to-100 in a blink when he has a runway to attack.\n\nPrice never proved himself at a high volume as a receiving threat, but he has actionable value as a pass protector, and his athletic talents suggest he has more to show as a RAC weapon. In addition to his immediate value as a change-of-pace back, he also doubles as an elite kick return weapon with his speed and spatial instinct; he housed two kick returns in his final collegiate season.",
    "positionRank": 2,
    "grade": 82.09
  },
  {
    "id": "chandler-rivers",
    "name": "Chandler Rivers",
    "position": "CB",
    "school": "Duke",
    "rank": 51,
    "height": "5-10",
    "weight": "185",
    "year": "Senior",
    "analystRanks": {
      "B/R": 31,
      "PFF": 67,
      "PFSN": 71
    },
    "positionRank": 10,
    "grade": 81.67
  },
  {
    "id": "germie-bernard",
    "name": "Germie Bernard",
    "position": "WR",
    "school": "Alabama",
    "rank": 52,
    "height": "6-1",
    "weight": "204",
    "year": "Senior",
    "analystRanks": {
      "B/R": 88,
      "CBS": 78,
      "ESPN": 50,
      "PFF": 40,
      "PFSN": 76,
      "The Athletic": 30
    },
    "analysis": "Germie Bernard doesn't have the elite athletic upside of some of the 2026 class' top pass-catchers, but he has the profile of a WR who'll be picked on Day 2 and go on to be a very solid pro. At 6'0\", 209 pounds, he's a densely-built WR with great baseline explosion and agility. While he's not an overly twitchy mover and is more of a zone-beater than a man-beater, Bernard has a functional route tree and good stem IQ, he has strong hands over the middle, and he's a venerable RAC threat with his measured burst, foot speed, and contact balance.\n\nIn addition to his three-level receiving value, he's also a standout blocker with the play strength to hold up at the point and direct defensive backs out of plays. A tailor-made quality WR2, Bernard has the skill set to out-produce his draft capital in the right environment.",
    "positionRank": 8,
    "grade": 82.39
  },
  {
    "id": "omar-cooper-jr",
    "name": "Omar Cooper Jr.",
    "position": "WR",
    "school": "Indiana",
    "rank": 53,
    "height": "6-0",
    "weight": "201",
    "year": "Junior",
    "analystRanks": {
      "B/R": 91,
      "CBS": 30,
      "ESPN": 60,
      "PFF": 59,
      "PFSN": 64
    },
    "analysis": "Omar Cooper Jr. is one half of Indiana's dynamic duo at WR, and like his teammate Elijah Sarratt, it's entirely possible he's off the board within the Top 100 picks in the 2026 NFL Draft. At 6'0\", 201 pounds, Cooper is a dense, compact pass-catcher with a low center of gravity and effortless explosiveness and vertical stretching.\n\nHe can extend seams as a RAC threat with his range and contact balance, and he has the quickness and prying strength to work through adjacent contact -- but he also flashes great salesmanship and tempo control as a route runner. Drops can be an issue on occasion for Cooper, and he has room to keep refining his route tree in the intermediate range, but overall, he's a budding three-level threat with a particular affinity for RAC accumulation and vertical advances.",
    "positionRank": 9
  },
  {
    "id": "emmett-johnson",
    "name": "Emmett Johnson",
    "position": "RB",
    "school": "Nebraska",
    "rank": 54,
    "height": "5-11",
    "weight": "200",
    "year": "Junior",
    "analystRanks": {
      "B/R": 36,
      "PFF": 82,
      "PFSN": 65
    },
    "analysis": "Emmett Johnson was one of the breakout stars of the 2025 regular season, and would be a prime contender for RB2 if he declares for the 2026 NFL Draft. A lean but well-leveraged creator at 5'11\", 200 pounds, Johnson sets himself apart with his blistering foot speed, cutting flexibility, 360-degree vision and spatial feel, and explosiveness out of cuts. He doesn't have the mass to churn through contact and break tackles consistently, but his constant leg action enables him to keep his balance through crowds, and he's an expert at managing space, pressing, manipulating defenders, and capitalizing with his hyper-elite creative profile.\n\nOn top of it all, he's a competent receiving presence, too. Johnson is a future starter, with immediate spark-plug utility.",
    "positionRank": 3,
    "grade": 84.1
  },
  {
    "id": "zachariah-branch",
    "name": "Zachariah Branch",
    "position": "WR",
    "school": "Georgia",
    "rank": 55,
    "height": "5-10",
    "weight": "180",
    "year": "Junior",
    "analystRanks": {
      "B/R": 45,
      "CBS": 87,
      "ESPN": 31,
      "PFF": 83
    },
    "analysis": "Zachariah Branch entered his junior year at Georgia after transferring from USC, where he showcased electrifying athleticism and flashed greatness as a pass-catcher. At 5'10\", 180 pounds, Branch boasts game-breaking speed, as he showed in high school while winning state titles in the 100-meter dash, 200-meter dash, and long jump. He's an ultra-dynamic return presence with a future as a special teams weapon, but the 2025 season saw him take a noticeable leap in development as a WR.\n\nBranch remains relatively raw as an intermediate separator, but his rare burst and open-field talent give him unguardable upside if he can continue refining his craft. In spite of his size, he's a tough and steely convertor at the catch point, with exceptional body control and focus, and he logged the third-highest PFSN WR Impact grade in the entire nation, with a score of 85.6. Branch will have value right away as a potentially devastating weapon on designed touches and as a return man, and his quickness, speed, and recalibrative athleticism underscore additional upside as a route runner and vertical thrat.",
    "positionRank": 10
  },
  {
    "id": "deontae-lawson",
    "name": "Deontae Lawson",
    "position": "LB",
    "school": "Alabama",
    "rank": 56,
    "height": "6-2",
    "weight": "228",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 42,
      "ESPN": 59,
      "PFF": 48,
      "PFSN": 98
    },
    "analysis": "Deontae Lawson was a full-time starter for the Alabama Crimson Tide for the better part of four years, and he has the combined experience and talent to earn the allure of NFL evaluators. Lawson began his Crimson Tide career as a primary special teamer, but took on more defensive snaps down the stretch in 2022, and his role only grew from there. In 2025, Lawson accumulated 89 tackles, 4.5 tackles for loss, 1.5 sacks, and four pass breakups.\n\nAs succinctly as it can be put, Lawson is just a good football player. He's not quite the transcendant talent his former teammate Jihaad Campbell was, but Lawson is sound in both phases of the game. In run defense, he's a twitched-up attacker who processes gaps quickly, explodes downhill, and takes on blocks with all of his long 239-pound frame.\n\nMeanwhile, in the pass game, he has great coverage mobility, depth discipline, and hip leverage IQ in zone, and he's aggressive on the attack as a blitzer. An experienced MIKE, Lawson can fill a void as a quality second-level commander at the next level.",
    "positionRank": 6,
    "grade": 80.96
  },
  {
    "id": "zion-young",
    "name": "Zion Young",
    "position": "EDGE",
    "school": "Missouri",
    "rank": 57,
    "height": "6-5",
    "weight": "265",
    "year": "Senior",
    "analystRanks": {
      "B/R": 53,
      "CBS": 107,
      "ESPN": 45,
      "PFF": 47,
      "PFSN": 94,
      "The Athletic": 29
    },
    "analysis": "Zion Young carries on a long line of Missouri edge defenders who have fielded early-round interest in the 2026 NFL Draft. A transfer from Michigan State, Young flashed promise in his first SEC play in 2024, then achieved career-best numbers in 2025, accruing 6.5 sacks, 16.5 tackles for loss, and two forced fumbles. At around 6'5\", 255 pounds, with over 33\" arms, Young has a picture-perfect combination of linear explosive athleticism, lean mass, and proportional length, all of which aids in his power generation and hand force at contact on power rushes.\n\nIn the run game, Young proves effective at acquiring initial leverage, resetting the point, and staying engaged in pursuit, while as a pass-rusher, his raw tools present much for tackles to contend with. Young's pass-rush plan and counter arsenal still need development, and teams must do their due diligence on a DWI arrest this past December. Still, Young is an up-and-coming talent with the raw talent and motor to hone.",
    "positionRank": 8,
    "grade": 79.94
  },
  {
    "id": "kamari-ramsey",
    "name": "Kamari Ramsey",
    "position": "SAF",
    "school": "USC",
    "rank": 58,
    "height": "6-0",
    "weight": "205",
    "year": "Senior",
    "analystRanks": {
      "B/R": 35,
      "CBS": 96,
      "ESPN": 88,
      "PFF": 55,
      "PFSN": 46
    },
    "analysis": "Kamari Ramsey transferred from UCLA to USC in 2024, and quickly became a \"glue guy\" for the Trojans' last line of defense. Able to play safety or nickel, Ramsey's versatility can serve as the meshing point for an NFL secondary, and he has a truly complete pallet of tools and skills across the board. With his 6'0\", 204-pound frame, he brings lightning-quick foot speed and coverage recalibration, as well as impeccable balance and fluidity on his pedal.\n\nWhile fast feet can yield a lack of control for other prospects, Ramsey doesn't fall victim to this. He's incredibly smooth, fluid, and composed working overtop routes and managing route relationships, and his high-level football IQ assists in maintaining discipline. On the attack, Ramsey is explosive and physical, and on the vertical plane, he scarcely gets outrun.\n\nHis lacking ball production does shed light on his inconsistent catch-point precision and eye discipline, and he has room to improve as a playmaker. But overall, he's a complete nickel prospect with actionable split-field safety versatility, who could outplay his draft capital.",
    "positionRank": 4,
    "grade": 83.9
  },
  {
    "id": "josiah-trotter",
    "name": "Josiah Trotter",
    "position": "LB",
    "school": "Missouri",
    "rank": 59,
    "height": "6-2",
    "weight": "237",
    "year": "RS Sophomore",
    "analystRanks": {
      "CBS": 43,
      "PFF": 61,
      "PFSN": 88
    },
    "analysis": "Josiah Trotter declared for the 2026 NFL Draft as just a redshirt sophomore, after transferring to Missouri from West Virginia and racking up 84 total tackles, 13 tackles for loss, and two sacks in a standout campaign. The son of Jeremiah Trotter Sr. and the younger brother of Jeremiah Trotter Jr., Josiah Trotter assuredly has the pedigree, and this past season, his flashes of dominance -- particularly as an early-down defender inside the box and between the tackles -- provided fodder for an exciting projection.\n\nHe can still improve his blind spot awareness and playmaking ability in coverage, but at around 6'2\", 237 pounds, Trotter is a sturdily-built second-level presence with great explosiveness, range, and physicality. He can sift through congestion with his quickness and gap processing, and he has the length, strength, and point-of-contact tenacity to stack blocks and close lanes before they develop.",
    "positionRank": 7,
    "grade": 83.78
  },
  {
    "id": "romello-height",
    "name": "Romello Height",
    "position": "EDGE",
    "school": "Texas Tech",
    "rank": 60,
    "height": "6-3",
    "weight": "240",
    "year": "Senior",
    "analystRanks": {
      "B/R": 58,
      "CBS": 45,
      "PFF": 56,
      "PFSN": 100
    },
    "positionRank": 9,
    "grade": 78.62
  },
  {
    "id": "elijah-sarratt",
    "name": "Elijah Sarratt",
    "position": "WR",
    "school": "Indiana",
    "rank": 61,
    "height": "6-2",
    "weight": "209",
    "year": "Senior",
    "analystRanks": {
      "B/R": 33,
      "CBS": 99,
      "ESPN": 80,
      "PFF": 65,
      "PFSN": 49
    },
    "analysis": "Elijah Sarratt has been one of the most productive WRs in college football since 2022, and he maintained that reputation this year. He eclipsed 1,000 yards with James Madison in 2023, and led the Indiana Hoosiers in catches, receiving yards, and receiving touchdowns during the team's surprise CFB Playoff campaign in 2024. In 2025, he achieved a career-high 15 TDs, distinguishing himself as a deadly catch-point and red-zone threat against the highest level of competition.\n\nAt 6'2\", 209 pounds, Sarratt fits a mold of WR that has been polarizing time and time again on the NFL Draft circuit. He's not the most explosive, nor does he have seam-stretching speed, but he has the necessary foot speed, sink, and tempo IQ to separate independently, and at the catch point, he's a high-level convertor and a true late-hands master with extraordinary composure, timing sense, and body control. That toughness and play strength translates in the RAC phase as well, and as a blocker, where Sarratt brings consistent effort and plays smart.\n\nAthletic traits do matter, but elite execution supersedes them at the NFL level, and Sarratt is a platinum-level operator who has the sky-high floor to underlie tantalizing usage versatility, production upside, and utility as a chain-mover and red-zone trump card.",
    "positionRank": 11,
    "grade": 83.76
  },
  {
    "id": "chase-bisontis",
    "name": "Chase Bisontis",
    "position": "OG",
    "school": "Texas A&M",
    "rank": 62,
    "height": "6-5",
    "weight": "315",
    "year": "Junior",
    "analystRanks": {
      "B/R": 52,
      "CBS": 93,
      "PFF": 88,
      "PFSN": 31
    },
    "analysis": "Chase Bisontis returned to Texas A&M in 2025 as a 6'6\", 320-pound junior who started nearly every game since arriving in College Station, shifting from right tackle in 2023 to his more natural spot at left guard in 2024. In 2025, Bisontis put together his best season yet, earning third-team All-SEC honors while catapulting into the conversation to be the top guard in the class. At his size, Bisontis has extremely impressive knee bend, hip fluidity, and overarching flexibility on recovery, and he's a high-level athlete who can match rushers laterally, reach his run-game landmarks with ease, and climb to the second level.\n\nIn the past, his run blocking has been his strength; he's explosive and tenacious at the point of attack. However, his pass protection reached new heights in 2025, and he now stands as one of the most balanced and well-leveraged pass-game operators in the class, with a sturdy center of gravity, active hands, and excellent upper-lower sync. He's not quite as strong or powerful as Ioane, but Bisontis still has the high-floor and high-ceiling combination that NFL teams gravitate to, and he has impact starter upside in both phases.",
    "positionRank": 3,
    "grade": 86.12
  },
  {
    "id": "lt-overton",
    "name": "LT Overton",
    "position": "EDGE",
    "school": "Alabama",
    "rank": 63,
    "height": "6-3",
    "weight": "278",
    "year": "Senior",
    "analystRanks": {
      "B/R": 26,
      "CBS": 106,
      "ESPN": 95,
      "PFF": 52,
      "PFSN": 52
    },
    "analysis": "LT Overton is a captivating talent who blends the line between \"edge rusher\" and \"defensive lineman\". Though he still has plenty of additional upside left to unearth, Overton's pedigree as a former five-star, combined with his high-end flashes, will tantalize NFL evaluators. Overton never reached elite-level production in four years on the collegiate stage, and his pass-rush execution is still very raw.\n\nHowever, Overton has the inbuilt versatility to be readily deployed on stunts and as a looper, and he's a force to be reckoned with at contact in the run game. At around 6'2 1/2\" and 274 pounds, with near-34\" arms and explosive vertical and lateral burst, Overton has all of the desired physical tools as a primary power producer. And on power rushes, he's flashed the agility and flexibility to realign his hips into contact, siphon lower-body power through urgent leg drive, and plow tackles off of their spot.\n\nOverton's frame and physical profile is NFL-ready and applicable to hybrid schemes through alignment versatility, but the next step in his development will be to develop his rush arsenal and produce more at an independent level. Regardless, Overton's raw talent makes him an immediate rotational boon, and impact starter potential is present down the line.",
    "positionRank": 10,
    "grade": 82.81
  },
  {
    "id": "julian-neal",
    "name": "Julian Neal",
    "position": "CB",
    "school": "Arkansas",
    "rank": 64,
    "height": "6-2",
    "weight": "200",
    "year": "Senior",
    "analystRanks": {
      "CBS": 56,
      "ESPN": 56,
      "PFF": 84,
      "PFSN": 72
    },
    "analysis": "Julian Neal was one of the more notable risers of the 2025 regular season, and he's now positioned as a compelling Day 2 prospect in the 2026 NFL Draft. At 6'2\", 208 pounds, Neal has the desired size-athleticism combo among NFL teams, and he's quietly a very complete prospect past the physical profile. Even at his size, Neal has eye-catching explosiveness, reactive athleticism, and coil, and he can weaponize his quickness and hip fluidity to mirror WRs in press and off-man, as well as match route concepts in zone.\n\nHe's an effective playmaker at the catch point, and he's ultra-reliable in run support, with keen instincts for resetting his base, engaging blocks, and securing stops as a solo tackler. He might not have elite vertical speed or swivel fluidity, and his plant-and-drive footwork still stands to improve -- all of which leave him somewhat susceptible to big plays at times when his recovery fails him -- but aside from that, there aren't many holes to poke in his game. As a long and quick cover man with technical variability and rock-solid support chops, Neal has quality starter potential.",
    "positionRank": 11,
    "grade": 83.24
  },
  {
    "id": "connor-lew",
    "name": "Connor Lew",
    "position": "OC",
    "school": "Auburn",
    "rank": 65,
    "height": "6-3",
    "weight": "300",
    "year": "Junior",
    "analystRanks": {
      "B/R": 105,
      "CBS": 49,
      "ESPN": 61,
      "PFF": 63,
      "PFSN": 59
    },
    "analysis": "Connor Lew is both one of the youngest and the most pro-ready centers in the 2026 NFL Draft. He became a starter midway through his true freshman season, taking over for the injured Avery Jones, and didn't relinquish the job from that point onward. He received Freshman All-American recognition for his performance that year, and proceeded to start every game at the fulcrum for the Tigers in 2024.\n\nAt 6'3\", 302 pounds, Lew is naturally well-leveraged, but also has great lower-body mass, strength, and explosion. While he's not overly powerful, he can reach his landmarks and stack blocks efficiently in the run game, and he's a smooth anchor operator with active hands in the pass game. Lew's quick ascension is a testament to his football IQ, but he also has the physical talent to lock in early-round standing.\n\nA torn ACL suffered in October could muddy his stock, but he has declared nonetheless, and has Top 100 appeal if his medicals check out.",
    "positionRank": 1,
    "grade": 83.47
  },
  {
    "id": "gennings-dunker",
    "name": "Gennings Dunker",
    "position": "OG",
    "school": "Iowa",
    "rank": 66,
    "height": "6-5",
    "weight": "315",
    "year": "Senior",
    "analystRanks": {
      "B/R": 101,
      "CBS": 79,
      "ESPN": 51,
      "PFF": 44,
      "PFSN": 68
    },
    "analysis": "Gennings Dunker is the name you see when you look up \"old-school offensive lineman\" in the dictionary. He's a barrel-chested brute with a mammoth upper body and explosive lower-body power. And as you'd expect from an old-school lineman, he relishes the chance to bury defenders on blocks any chance he gets.\n\nDunker excels at firing off the snap and driving his legs in the run game, and he has the high-level raw power element to generate hefty displacement off the line. Meanwhile, in pass protection, he's quietly very sound when it comes to playing balanced, square, and timing his punches effectively. He's somewhat stiff in the hips -- a factor that impacts his lateral recovery and reduction against sped rushers -- and he lacks high-end length.\n\nThose two factors will likely push Dunker inside to guard, but he's a quality talent and a tone-setter who has quality starter upside at OG, and at least has experience and functional ability at OT.",
    "positionRank": 4,
    "grade": 80.26
  },
  {
    "id": "jakobi-lane",
    "name": "Ja'Kobi Lane",
    "position": "WR",
    "school": "USC",
    "rank": 67,
    "height": "6-4",
    "weight": "200",
    "year": "Junior",
    "analystRanks": {
      "B/R": 60,
      "CBS": 59,
      "ESPN": 54,
      "PFF": 97,
      "PFSN": 75
    },
    "positionRank": 12,
    "grade": 82.15
  },
  {
    "id": "genesis-smith",
    "name": "Genesis Smith",
    "position": "SAF",
    "school": "Arizona",
    "rank": 68,
    "height": "6-2",
    "weight": "204",
    "year": "Junior",
    "analystRanks": {
      "CBS": 50,
      "PFF": 104,
      "PFSN": 53
    },
    "analysis": "Genesis Smith declared as a true junior after registering an interception, eight pass breakups, and a PFSN Safety Impact score of 84.7 in 2025. At 6'2\", 204 pounds, Smith has rare range and long-strider speed as a center-fielder and single-high safety, and his playmaking instincts are stellar. But he's not just a one-trick pony with his center-fielder skills.\n\nHe can sink, redirect, and manage space in intermediate zones as well, and he's a rocket reacting and closing on the ball. As a pure coverage defender, Smith is one of the best safeties in the class with his coverage mobility, route vision, spatial reasoning, and playmaking range. However, there's no skirting around the fact that he's a major work-in-progress as a run support player.\n\nHe at least has the size and willingness to play downhill, but his pursuit angles, take-on technique against blocks, and tackling form are all poor, and must improve as he makes the NFL leap. If you're comfortable projecting off of his size and range, then he's assuredly worth the early-round investment with his elite coverage ability. On the back end, with rare single-high utility and two-high flex, Smith is a steadying presence and a consistent turnover threat for quarterbacks who prove too bold.",
    "positionRank": 5,
    "grade": 83.98
  },
  {
    "id": "aj-haulcy",
    "name": "AJ Haulcy",
    "position": "SAF",
    "school": "LSU",
    "rank": 69,
    "height": "6-0",
    "weight": "222",
    "year": "Senior",
    "analystRanks": {
      "B/R": 120,
      "CBS": 63,
      "ESPN": 74,
      "PFF": 41,
      "PFSN": 51
    },
    "positionRank": 6,
    "grade": 84.58
  },
  {
    "id": "blake-miller",
    "name": "Blake Miller",
    "position": "OT",
    "school": "Clemson",
    "rank": 70,
    "height": "6-6",
    "weight": "315",
    "year": "Senior",
    "analystRanks": {
      "B/R": 82,
      "CBS": 103,
      "ESPN": 69,
      "PFF": 77,
      "PFSN": 36
    },
    "analysis": "Blake Miller has room to keep building up his game, but he has one of the highest ceilings in the 2026 NFL Draft OT class. The long 6'6\", 315-pound right tackle logged almost 4,000 snaps and 54 starts as a rare four-year starter, and he ended with his best, most consistent season yet in 2025. At his size, Miller is one of the most natural movers in the entire 2026 OL class.\n\nHe's an uber-explosive attacker off the snap and a light-footed puller with hyper-elite lateral and second-level range. His ability to cover ground and reach landmarks is matched only by his knee bend, movement balance, and synergetic feel in pass protection. And in 2025, he's showed notable development with his anchor footwork, strength, and lower-body control.\n\nHe can still cut down on lapses in extension timing at the apex, but he's a true run-game catalyst with endless schematic flexibility and reliable pass blocking utility working 1-on-1 and against stunts.",
    "positionRank": 7,
    "grade": 85.87
  },
  {
    "id": "max-iheanachor",
    "name": "Max Iheanachor",
    "position": "OT",
    "school": "Arizona State",
    "rank": 71,
    "height": "6-6",
    "weight": "330",
    "year": "Senior",
    "analystRanks": {
      "B/R": 146,
      "CBS": 19,
      "ESPN": 55,
      "PFF": 115,
      "PFSN": 34
    },
    "analysis": "Max Iheanachor originally comes from Nigeria, and didn't play football in high school. But just several years into his career, he's already emerged as a potential early-round prospect in the 2026 NFL Draft. At around 6'5\", 315 pounds, with over 34\" arms, Iheanachor checks all of the physical boxes NFL evaluators will look for.\n\nHe's long, strong, and explosive, with elite foot speed and reactive athleticism. Additionally, for his experience level, he has an inspiring pass set and sense of synergy in pass protection, and he's an urgent, powerful run blocker who knows how to flip his hips to stack blocks, seal out pursuit defenders, and find creative solutions when defenders muddy gap looks. He'll be a slightly older rookie, but Iheanachor has the tools and intangibles to be a quality starter as a natural right tackle.",
    "positionRank": 8,
    "grade": 84.48
  },
  {
    "id": "domonique-orange",
    "name": "Domonique Orange",
    "position": "DT",
    "school": "Iowa State",
    "rank": 72,
    "height": "6-4",
    "weight": "325",
    "year": "Senior",
    "analystRanks": {
      "B/R": 69,
      "CBS": 86,
      "PFF": 64,
      "PFSN": 117,
      "The Athletic": 34
    },
    "analysis": "Domonique Orange, nicknamed \"Big Citrus\", is the ideal nose tackle prototype. He's 6'2\", 328 pounds, with near-34\" levers for arms. He can play with natural leverage and attack opposing linemen with power in the pass game, and he can latch, anchor, and limit displacement against run blocks.\n\nNaturally, he's not an elite disruptor 1-on-1, but Orange makes his money by being an immovable mass at the fulcrum. He can two-gap while stationary or while on the move against zone blocks, he can stack and shed, and he has surprising pursuit range and a relentless motor. For odd and hybrid-front schemes, Orange can be a definite force multiplier and early-down gap enforcer.\n\nHe frees up other players to make plays, and has measured playmaking value of his own.",
    "positionRank": 6,
    "grade": 79.53
  },
  {
    "id": "joshua-josephs",
    "name": "Joshua Josephs",
    "position": "EDGE",
    "school": "Tennessee",
    "rank": 73,
    "height": "6-3",
    "weight": "245",
    "year": "Senior",
    "analystRanks": {
      "B/R": 71,
      "CBS": 76,
      "ESPN": 91,
      "PFF": 62,
      "PFSN": 74
    },
    "analysis": "Joshua Josephs is one of the more polarizing EDGE prospects in the 2026 NFL Draft. At around 6'3\", 234 pounds, Josephs is underweight, and he'll need to add more mass at the next level. Nevertheless, he's able to contend in run defense and stack blocks with his over-34\" arms, and he also has a great feel for acquiring leverage and loading his base.\n\nJosephs' high floor in run defense defies expectation, and his pass-rushing framework is theoretically sound. Josephs is explosive, agile, and fluid at his size, with a clear understanding of upper-lower synergy, timing, and precision working the arc. He keeps tackles on their toes with his unique blend of athleticism and length, and he's a threat to generate momentum-changing plays on money downs.\n\nThat said, his pass-rush production didn't match up with his tools in college. His PFSN EDGE Impact score in 2025 was a middling 77.7, and per TruMedia, he achieved a true dropback pressure rate of just 7.5%. Josephs doesn't channel power consistently with his upper-tier explosiveness and length, and his suspect raw strength makes him susceptible to snatches and forceful strikes against larger opponents.\n\nWith his run defense profile, raw tools, and natural leveraging, he projects as a quality rotational presence with serviceable starting appeal in odd-front schemes, but he needs to improve his power element before he can reach his ceiling as a quality two-phase starter.",
    "positionRank": 11,
    "grade": 80.71
  },
  {
    "id": "jack-endries",
    "name": "Jack Endries",
    "position": "TE",
    "school": "Texas",
    "rank": 74,
    "height": "6-4",
    "weight": "236",
    "year": "Junior",
    "analystRanks": {
      "B/R": 40,
      "CBS": 90,
      "ESPN": 100,
      "PFF": 70,
      "PFSN": 89
    },
    "analysis": "Jack Endries transferred to Texas after a strong 2024 campaign at California that saw him haul in 56 catches for 623 yards and two scores. He now aims to keep the Longhorns' draft streak at TE alive after Ja'Tavion Sanders was selected in 2023, and Gunnar Helm was selected in 2024. Endries wasn't as productive as expected at Texas in 2025, but the offense's struggles early in the year contributed to this dip in production, and Endries' stock was strong enough that he chose to declare anyway.\n\nAt around 6'4\", 240 pounds, Endries isn't the biggest TE target, but he's quick, explosive, and nuanced as a route runner and stem operator. He has legitimate vertical speed for his size, which he can use to stretch seams, and he's a strong-handed catcher with churning RAC ability. He still has room to improve his play strength and multi-alignment blocking utility, but he has immediate value as a vertical seam and RAC threat in a rotation.",
    "positionRank": 3
  },
  {
    "id": "michael-trigg",
    "name": "Michael Trigg",
    "position": "TE",
    "school": "Baylor",
    "rank": 75,
    "height": "6-4",
    "weight": "240",
    "year": "Senior",
    "analystRanks": {
      "B/R": 62,
      "CBS": 64,
      "PFF": 73,
      "PFSN": 113
    },
    "analysis": "Michael Trigg was a highly-touted high school recruit who bounced around from USC to Ole Miss, and finally to Baylor, where he at last caught on in 2024 and 2025. Across the 2025 season, Trigg racked up 50 catches for 694 yards and six touchdowns -- all career-highs. At 6'3\", 250 pounds, with over 34\" arms and 11' hands, Trigg has a spidery frame built for snatching high-difficulty receptions, and he's made a habit of producing acrobatic and one-handed grabs with the Bears.\n\nHe doesn't provide much at all as a blocking presence, and that'll be an area for improvement in the NFL if he doesn't want to be limited by formation -- but he's undoubtedly a dynamic receiving threat with seam and red-zone utility.",
    "positionRank": 4,
    "grade": 80.33
  },
  {
    "id": "darrell-jackson-jr",
    "name": "Darrell Jackson Jr.",
    "position": "DT",
    "school": "Florida State",
    "rank": 76,
    "height": "6-5",
    "weight": "337",
    "year": "Senior",
    "analystRanks": {
      "B/R": 86,
      "CBS": 101,
      "ESPN": 68,
      "PFF": 85,
      "PFSN": 86,
      "The Athletic": 43
    },
    "analysis": "Darrell Jackson Jr. is a mid-round nose tackle prospect in the 2026 NFL Draft. Set to be a 23-year old rookie, Jackson has transferred twice in his career -- first from Maryland to Miami, and then from Miami to Florida State -- but he's played his best ball with the Seminoles.\n\nAt 6'5\", 330 pounds, with over 35\" arms, Jackson is a force to be reckoned with from interior alignments. He's a tree stump in run defense with elite point-of-attack strength and displacement absorption, and he also flashes the requisite power, torque, and motor to disrupt 1-on-1 and generate gravity as a pass-rusher, even if he isn't the most explosive. His ceiling is capped a bit by his non-elite athleticism, but he has the make-up of a solid pro.",
    "positionRank": 7,
    "grade": 82.13
  },
  {
    "id": "jaishawn-barham",
    "name": "Jaishawn Barham",
    "position": "LB",
    "school": "Michigan",
    "rank": 77,
    "height": "6-3",
    "weight": "243",
    "year": "Senior",
    "analystRanks": {
      "CBS": 57,
      "PFF": 101,
      "PFSN": 79
    },
    "analysis": "Jaishawn Barham was a heavily anticipated transfer addition for the Michigan Wolverines in 2024, after accruing 10 TFLs and 7 sacks in his first two seasons at Maryland. Barham's first season at Michigan wasn't as fruitful as many hoped. He met expectations with his physicality at 6'3\", 248 pounds, but proved hot-and-cold both with his instincts and comfort, both in gap patrol and in coverage.\n\nBarham is an explosive, supercharged athlete at his size with awe-inspiring power and pop at contact, which he can use to control blocks and stack-and-shed. That said, he might be best utilized in a reactive SAM-backer role and as a rotational edge rusher, where he can stay close to the line, play to his strengths, and serve as a valuable pass-rush catalyst.",
    "positionRank": 8
  },
  {
    "id": "zakee-wheatley",
    "name": "Zakee Wheatley",
    "position": "SAF",
    "school": "Penn State",
    "rank": 78,
    "height": "6-2",
    "weight": "200",
    "year": "Senior",
    "analystRanks": {
      "B/R": 25,
      "CBS": 95,
      "ESPN": 83,
      "PFF": 93,
      "PFSN": 102
    },
    "positionRank": 7,
    "grade": 81.42
  },
  {
    "id": "malachi-lawrence",
    "name": "Malachi Lawrence",
    "position": "EDGE",
    "school": "UCF",
    "rank": 79,
    "height": "6-4",
    "weight": "270",
    "year": "Senior",
    "analystRanks": {
      "CBS": 39,
      "ESPN": 81,
      "PFF": 146,
      "PFSN": 58
    },
    "positionRank": 12,
    "grade": 83.62
  },
  {
    "id": "malik-muhammad",
    "name": "Malik Muhammad",
    "position": "CB",
    "school": "Texas",
    "rank": 80,
    "height": "6-0",
    "weight": "188",
    "year": "Junior",
    "analystRanks": {
      "B/R": 30,
      "CBS": 105,
      "ESPN": 82,
      "PFF": 105,
      "PFSN": 84
    },
    "analysis": "Malik Muhammad is an early declare in the 2026 NFL Draft, who holds merit as a mid-to-late Day 2 option with impact starter upside at the CB position. A former four-star recruit, Muhammad excelled in 2025, earning a strong 83.1 PFSN CB Impact score. Per TruMedia, he allowed a mere 59.4 QB Rating on targets to his side of the field, and more often than not, he dissuaded targets entirely; he went over 10 coverage snaps per target, and allowed just a half-yard per coverage snap.\n\nAt a proportionally long 6'0\", 190 pounds, Muhammad has all of the requisite physical tools to be a scheme-diverse cover man. He's extremely explosive and fluid, with great long speed, effervescent reactive coil, easy sink and redirection, and he combines that physical pallet with elite raw processing and route vision working in zone. His over-arching physicality is the biggest flaw in his game; he brings excellent effort and tenacity, but he's extremely inconsistent with his footwork and targeted physicality in press-man, and in run support, he routinely struggles to take proper angles, engage blocks effectively, or secure tackles.\n\nThat said, if Muhammad can continue refining his technique and targeted physicality, he has the high-level coverage athleticism and mental acuity to be an asset on the back end.",
    "positionRank": 12,
    "grade": 82.15
  },
  {
    "id": "antonio-williams",
    "name": "Antonio Williams",
    "position": "WR",
    "school": "Clemson",
    "rank": 81,
    "height": "5-11",
    "weight": "190",
    "year": "RS Junior",
    "analystRanks": {
      "B/R": 72,
      "CBS": 82,
      "ESPN": 64,
      "PFF": 94,
      "PFSN": 95
    },
    "analysis": "Antonio Williams is the ideal WR prospect for evaluators who marry film and analytical indicators. He was an immediate breakout as a true freshman, accounting for almost 20% of his team's receiving output. In 2024, he accounted for over 23% of Clemson's receiving volume, and nearly one-third of the team's total passing touchdowns.\n\nAnd in 2025, he remained productive amidst a stark downturn for the Tigers' offensive efficiency as a whole. As his high volume would imply, the 5'11\", 190-pound Williams is a natural-born separator with rare throttle and angle freedom as a mover, and his lightning-level twitch aids him both as a route technician and a RAC weapon. He doesn't have the widest catch radius and does fall victim to focus drops at times, though 2025 was his best year yet at the catch point; per TruMedia, he logged just a 2.8% drop rate and a 10.27% catch rate over expectation.\n\nDurability is an ongoing concern, but Williams' dual-sided separation and RAC framework is tried and true at the NFL level.",
    "positionRank": 13,
    "grade": 83.57
  },
  {
    "id": "davison-igbinosun",
    "name": "Davison Igbinosun",
    "position": "CB",
    "school": "Ohio State",
    "rank": 82,
    "height": "6-2",
    "weight": "195",
    "year": "Senior",
    "analystRanks": {
      "B/R": 47,
      "CBS": 125,
      "ESPN": 46,
      "PFF": 145,
      "PFSN": 50
    },
    "analysis": "Davison Igbinosun joined Jim Knowles at Ohio State in 2023 and immediately took a place in the defense's starting lineup. In 2024, Igbinosun returned alongside Denzel Burke and Jordan Hancock, and helped the Buckeyes earn their first National Championship in over a decade. There were clear flaws on Igbinosun's tape in 2024, but Igbinosun drastically improved in 2025, and solidified his stock in the process.\n\nIn 2024, Igbinosun was over-reliant on extraneous physicality and very penalty-prone (he drew 16 flags in 2024), and inconsistent upper-lower sync threw his fluidity into question. In 2025, he was almost lockdown with his blend of size, length, short-area quickness, sink, and closing speed, and cut his penalty count down to just five. Igbinosun is still more comfortable in press-man than he is in off-man and zone, where spatial management and pedal balance is more important, and he has room to keep playing with more discipline and measure as a catch-point competitor.\n\nIn spite of these inconsistencies, Igbinosun is a tantalizing physical talent with ideal speed, quickness, length, and competitive toughness. He can match, redirect, dictate, and squeeze WRs against the boundary as a natural press-man CB, he can play the ball with precision, and he's formidable in support.",
    "positionRank": 13,
    "grade": 84.15
  },
  {
    "id": "gabe-jacas",
    "name": "Gabe Jacas",
    "position": "LB",
    "school": "Illinois",
    "rank": 83,
    "height": "6-3",
    "weight": "270",
    "year": "Senior",
    "analystRanks": {
      "B/R": 81,
      "CBS": 100,
      "PFF": 39,
      "PFSN": 115
    },
    "analysis": "Gabe Jacas headlines Illinois’ defense heading into his senior year, bringing a power-packed profile at 6'3\", 275 pounds and coming off a 2024 campaign with 74 tackles, 13 tackles for loss, eight sacks, and three forced fumbles. For much of his career, Jacas has thrived from a two-point stance as an OLB, where his mobility for his size stands out, but his strength and leverage suggest he could offer even more impact as a three-point DE in a 3-4 or 4-3 front. Though Jacas is a well-rounded edge with strong knock-back power, his ceiling is capped by a lack of elite top-end traits, projecting him more as a dependable starter or valuable NFL rotation piece rather than a blue-chip prospect.",
    "positionRank": 9,
    "grade": 80.9
  },
  {
    "id": "skyler-bell",
    "name": "Skyler Bell",
    "position": "WR",
    "school": "UConn",
    "rank": 84,
    "height": "6-0",
    "weight": "185",
    "year": "Senior",
    "analystRanks": {
      "B/R": 107,
      "PFF": 79,
      "PFSN": 66
    },
    "analysis": "Skyler Bell originally played for the Wisconsin Badgers, where he flashed promise, but never got a chance to catch on due to inconsistent offensive structure and quarterback play. He transferred to UConn in 2024, and achieved career-highs in all metrics in his first season there -- but his 2025 campaign was something entirely different. It only took Bell nine games to reach the doorstep of 1,000 yards, and he ended the year with 101 catches, 1,278 yards, 13 touchdowns, and a near-elite PFSN WR Impact score of 85.\n\nThe 6'0\", 185-pound pass-catcher has one of the most complete three-level threat frameworks in the 2026 class. He's explosive and energized as a mover, with a full route tree, vertical splicing, steely ball tracking, and dynamic RAC chops. Focus drops were an issue in 2024, but he's even cleaned that up -- making his profile one of the most well-rounded in the upcoming group.\n\nHe'll be an older rookie, but he compensates by posing as an immediate starter with inside-outside versatility.",
    "positionRank": 14,
    "grade": 83.69
  },
  {
    "id": "will-lee-iii",
    "name": "Will Lee III",
    "position": "CB",
    "school": "Texas A&M",
    "rank": 85,
    "height": "6-1",
    "weight": "189",
    "year": "Senior",
    "analystRanks": {
      "B/R": 66,
      "CBS": 98,
      "PFF": 103,
      "PFSN": 70
    },
    "analysis": "Will Lee III began his collegiate career at the JUCO level, and built his way up to the SEC, where he grew into an all-conference defender at the highest stage. He produced two interceptions and 10 pass breakups in 2024, and while 2025 was a slight step in the wrong direction, Lee still put quality reps on tape, particularly in press-man. Lee thrives as a domineering physical presence.\n\nAt 6'1\", with arms near 32\" long, his disruptive radius is a definite strength, and at his size, he's quick-firing and surprisingly fluid, with venerable short-area twitch, reactive athleticism, and coil on redirections. There's still room for Lee to keep refining his technique, particularly with his footwork and positioning in press and on his pedal. And without elite long-track explosiveness and vertical speed, Lee's technical margin for error is somewhat slimmer.\n\nNevertheless, he's the kind of size-adjusted mover and competitor who has lockdown potential with his fluidity, fast recalibration, and competitive zeal. His plus processing ensures that he can react quickly in the mirror-motor phase, or manage route combinations and execute crisp speed turns in zone. He's sound and tenacious in support, and he's a consistent playmaking threat.\n\nHis technical consistency will define his ceiling, as Lee's profile invites a level of inherent volatility, but he's nonetheless a starting talent with three-down respectability.",
    "positionRank": 14,
    "grade": 82.61
  },
  {
    "id": "derrick-moore",
    "name": "Derrick Moore",
    "position": "EDGE",
    "school": "Michigan",
    "rank": 86,
    "height": "6-3",
    "weight": "260",
    "year": "Senior",
    "analystRanks": {
      "B/R": 63,
      "CBS": 131,
      "ESPN": 75,
      "PFF": 75,
      "PFSN": 78
    },
    "positionRank": 13,
    "grade": 81.89
  },
  {
    "id": "taurean-york",
    "name": "Taurean York",
    "position": "LB",
    "school": "Texas A&M",
    "rank": 87,
    "height": "5-10",
    "weight": "227",
    "year": "Junior",
    "analystRanks": {
      "B/R": 92,
      "PFF": 80,
      "PFSN": 82
    },
    "analysis": "Taurean York joined the Texas A&M Aggies as a three-star recruit in 2023, and immediately emerged as a full-time starter. In 2024, he was named a team captain as a true sophomore, and in 2025, he functioned as the team's \"green dot\" LB, calling signals pre-snap and getting teammates into position. At 5'10\", with likely sub-31\" arms, Taurean York won't be every defensive coordinator's preferred mold.\n\nBut for those who can look past the size, York stands out as one of the best MIKE linebackers in the class. He's an elite processor who can command his unit pre-snap and toy with offensive protection looks to get favorable matchups, and he's a fast-flowing support presence post-snap, who can erase running space with his lightning-quick burst and closing speed. On top of it all, he's a fluid and instinctive coverage LB.\n\nAs one might expect, York's tackling can be inconsistent at times with his lacking length, but he has good take-on, angle IQ, and form overall, and his impact as a central second-level presence arguably outweighs any volatility at contact. While his size will always be a slight limitation, York has the range and mental proficiency to supersede it and thrive as an NFL starter.",
    "positionRank": 10,
    "grade": 81
  },
  {
    "id": "eli-stowers",
    "name": "Eli Stowers",
    "position": "TE",
    "school": "Vanderbilt",
    "rank": 88,
    "height": "6-4",
    "weight": "235",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 134,
      "CBS": 61,
      "ESPN": 65,
      "PFF": 50,
      "PFSN": 133
    },
    "analysis": "Eli Stowers stands out as one of the best, most efficient receiving TEs in the 2026 NFL Draft class. At around 6'4\" and 240 pounds, with near-33\" arms, he's a lean and long-limbed pass-catcher who boasts effervescent athleticism for his size. He's twitched-up out of his stance, explosive when attacking vertical, and he has the requisite hip sink to sustain acceleration through transitions and gain separation later in routes.\n\nAt the catch, Stowers contends just as well, too. He brings elite body control and contortion ability to the fold, along with stifling hand strength in positions of imbalance, and he's more competitive than you'd expect in the RAC phase with his leaner build. Stowers' 85.1 PFSN WR Impact score was near-elite in 2025, and per TruMedia, he achieved a mind-boggling 2.7 yards per route run.\n\nAs one might expect, the tradeoff with Stowers comes in his blocking utility. He splits out as a big-slot often, and doesn't have the play strength or power to hold up or displace consistently in-line, and his effort wanes at times as well. He fits the Oronde Gadsden II mold of a primary big-slot mismatch weapon, but in that role, he has the traits to produce in spite of his slight schematic limitations.",
    "positionRank": 5
  },
  {
    "id": "isaiah-world",
    "name": "Isaiah World",
    "position": "OT",
    "school": "Oregon",
    "rank": 89,
    "height": "6-8",
    "weight": "318",
    "year": "Senior",
    "analystRanks": {
      "B/R": 122,
      "CBS": 77,
      "ESPN": 79,
      "PFF": 92,
      "PFSN": 77
    },
    "analysis": "Isaiah World was Oregon's premier transfer portal addition in 2025, after starting three consecutive seasons at Nevada and earning All-Mountain West honors in 2023 and 2024. World started predominantly at right tackle in 2022, before moving to the left side, and he manned the blindside for the Ducks as a redshirt senior. At around 6'6\", 320 pounds, with near-35\" arms, World moves with easy explosiveness and nimble feet, and is aptly-named, with the frame of a real-life world-lifting titan.\n\nThat frame comes with all the raw power and strength you'd expect. At contact, World can dominate opponents with his force output and torque, he can throttle inserting defenders off their feet with his explosive power as a puller, and he's a mauler who plays to the whistle and seeks to overwhelm. Despite being an older prospect, he's still relatively reliant on his natural tools; he needs to improve his strike timing and precision, and he doesn't have the high-end flexibility to compensate or aid in consistent recovery.\n\nNevertheless, World's ceiling is one of the highest in the class, and his raw tools and tenacity translate at guard if he doesn't have the requisite refinement at OT.",
    "positionRank": 9,
    "grade": 80.2
  },
  {
    "id": "austin-barber",
    "name": "Austin Barber",
    "position": "OT",
    "school": "Florida",
    "rank": 90,
    "height": "6-6",
    "weight": "314",
    "year": "Senior",
    "analystRanks": {
      "B/R": 94,
      "CBS": 42,
      "ESPN": 96,
      "PFF": 111,
      "PFSN": 111
    },
    "analysis": "Austin Barber is one of the more seasoned 2026 NFL Draft offensive line prospects. Entering the 2025 season, he started 26 total games at the CFB level, with reps at both left and right tackle, and he added 12 more starts at left tackle in his final season. With his experience, he's adopted a level of comfort in pass protection that few ascending OTs can match.\n\nAt 6'5\", 314 pounds, with stellar length and proportional mass, Barber passes the ideal size thresholds, and he's an explosive, nimble athlete who covers ground with ease out of his stance. Both in his stance and when matching, Barber's flexibility and easy knee bend helps him acquire leverage, and he can load and re-exert to maximize force on his punches. He's still learning how to channel full power in the run game, as well as how to properly anchor and keep upper-lower sync on passing downs, but he has eventual starting upside and left-right versatility as a swing tackle in the immediate timeline.",
    "positionRank": 10,
    "grade": 81.12
  },
  {
    "id": "jonah-coleman",
    "name": "Jonah Coleman",
    "position": "RB",
    "school": "Washington",
    "rank": 91,
    "height": "5-9",
    "weight": "228",
    "year": "Senior",
    "analystRanks": {
      "B/R": 115,
      "CBS": 116,
      "PFF": 78,
      "PFSN": 57
    },
    "analysis": "Jonah Coleman's efficiency dipped a bit in 2025, but overall, he was an incredibly productive rusher across his four collegiate seasons. He totaled over 3,000 career yards and 34 touchdowns on the ground, and in 2025, he achieved a career-high 15 rushing scores, while also catching 31 passes for 354 yards and two scores. At around 5'9\", 229 pounds, Coleman is a compact, hyper-dense, and well-leveraged runner with energized foot speed and angle recalibration as a setup operator.\n\nHe's not overly explosive, nor does he have a dangerous top gear in space, but he compensates with his size-adjusted quickness, cutting flexibility, vision, and spatial IQ, and he can work through contact with his engagement balance and physicality. While not a home-run threat, Coleman has all the hallmarks of a quality volume back.",
    "positionRank": 4,
    "grade": 82.46
  },
  {
    "id": "keylan-rutledge",
    "name": "Keylan Rutledge",
    "position": "OG",
    "school": "Georgia Tech",
    "rank": 92,
    "height": "6-4",
    "weight": "330",
    "year": "Senior",
    "analystRanks": {
      "B/R": 90,
      "CBS": 65,
      "PFF": 127,
      "PFSN": 87
    },
    "analysis": "Keylan Rutledge arrived at Middle Tennessee in 2022 and almost instantly factored into the starting rotation. After starting 17 games for the Blue Raiders, he transferred to Georgia Tech and made a similarly quick impact for the Yellow Jackets. He was a two-time first-team All-ACC competitor in his time under Brent Key, and in 2025, he was a first-team All-American.\n\nNow, entering the 2026 NFL Draft, Rutledge stands out as a potential gem in the middle-round range. At around 6'4\", 330 pounds, Rutledge is a compact block of fury inside the tackles; in fact, there's an argument to make no offensive lineman brings more energy and relentless zeal than him on a down-to-down basis. Rutledge is similarly energized with his foot speed and play pace, and he has the combined mass and width to levy devastating bouts of hand force and rotational torque.\n\nIn the run game, he's assignment-sound, angle-sound, and role versatile, with the hip flexibility to execute reach blocks, and in pass protection, he blends the line between patience and proactivity well, and is aggressive on help blocks. His limited knee bend affects his leverage acquisition and pad level maintenance, but he has the temperament to be a tone-setter on Sundays.",
    "positionRank": 5,
    "grade": 81.4
  },
  {
    "id": "eli-raridon",
    "name": "Eli Raridon",
    "position": "TE",
    "school": "Notre Dame",
    "rank": 93,
    "height": "6-7",
    "weight": "251",
    "year": "Senior",
    "analystRanks": {
      "B/R": 76,
      "PFF": 120,
      "PFSN": 96
    },
    "analysis": "Eli Raridon is one of the more intriguing TE prospects in the 2026 NFL Draft. He's dealt with injuries in the past, but was mostly healthy in 2025, and turned in a career-best campaign as a result. He caught 32 passes for 482 yards, and while he didn't score any touchdowns, he proved his mettle time and time again as a venerable seam-splicing and RAC threat in open space.\n\nAt around 6'7\", 252 pounds, Raridon is a long and lean TE with great measurables, as well as good baseline explosiveness, foot speed, and open-field pace. He's a high-quality blocker who can work in-line, pull, or track defenders in space, and as a receiver, he melds efficient acceleration, bend, zone IQ, body control, and strong hands to function as a quality intermediate safety blanket.",
    "positionRank": 6,
    "grade": 82.05
  },
  {
    "id": "jude-bowry",
    "name": "Jude Bowry",
    "position": "OT",
    "school": "Boston College",
    "rank": 94,
    "height": "6-5",
    "weight": "311",
    "year": "Senior",
    "analystRanks": {
      "B/R": 80,
      "CBS": 89,
      "PFF": 124
    },
    "analysis": "Jude Bowry has a chance to carry on Boston College's recent trend of NFL offensive line production, one year after Ozzy Trapilo was selected in Round 2. Bowry started all 12 games at LT in 2024, after previously earning his first career starts at RT in 2022, and then started nine more games at left tackle in 2025 while serving as a team captain. At 6'5\", 308 pounds, with plus proportional length, Bowry's elite raw power component stands out, as does his powerful explosion and energized athletic ability in close quarters.\n\nBowry has a potentially dominant physical profile, which he maximizes with his all-out mauler mentality. His game still needs refinement, as his knee bend, pad level, lower-body action, stunt vision, and angle discipline can all be inconsistent. Nevertheless, he can be a quality Day 1 swing OT, with starting upside and schematic versatility.",
    "positionRank": 11
  },
  {
    "id": "jalon-kilgore",
    "name": "Jalon Kilgore",
    "position": "SAF",
    "school": "South Carolina",
    "rank": 95,
    "height": "6-1",
    "weight": "211",
    "year": "Senior",
    "analystRanks": {
      "B/R": 44,
      "ESPN": 97,
      "PFF": 129,
      "PFSN": 125
    },
    "analysis": "Jalon Kilgore profiles as one of the most unique and multifaceted defensive backs in the 2026 NFL Draft. At 6'1\", 219 pounds, with sprawling length and charged-up explosion, he's taken reps at boundary CB, nickel, box safety, and field safety. Kilgore's versatility is a testament to his intelligence, vision, and football IQ -- all traits that he used in tandem with his physical gifts to rack up three TFLs, five INTs, and five PBUs in 2024.\n\nAnd in 2025, he followed up his breakout season with two INTs and 10 pass breakups, along the way earning an elite PFSN DB Impact score of 91.6. While his muscle-bound 219-pound frame imbues his game with modest hip stiffness at times, Kilgore has the corrective and reactive athleticism to match and plant-and-drive overtop stems, and with his closing speed, he can operate as a seam-runner and erase mid-range separation, hawk over ill-fated passes and punish in support. Best as a big-nickel but built with all-encompassing positional flexibility, Kilgore can be a dynamic \"glue guy\" for an NFL defense.",
    "positionRank": 8,
    "grade": 79.02
  },
  {
    "id": "anthony-lucas",
    "name": "Anthony Lucas",
    "position": "EDGE",
    "school": "USC",
    "rank": 96,
    "height": "6-5",
    "weight": "285",
    "year": "Senior",
    "analystRanks": {
      "B/R": 154,
      "CBS": 85,
      "PFF": 68,
      "PFSN": 90
    },
    "analysis": "Anthony Lucas brings a perplexing evaluation to the fold in the 2026 NFL Draft cycle. A true senior and a former five-star recruit, Lucas passes the eye test with his long 6'5\", 272-pound frame and energized athleticism. However, the production and consistency haven't quite come along for him, even in his fourth season.\n\nThe high-end flashes on tape are extremely enticing. At his size, Lucas has actionable power, stacking strength in the run game, and has shown he can win with inside counters using his lateral agility and heavy hands. Much of his evaluation is ultimately a projection, but he has even and odd-front versatility as a stand-up or hand-in-the-dirt rusher.",
    "positionRank": 14,
    "grade": 82.11
  },
  {
    "id": "trinidad-chambliss",
    "name": "Trinidad Chambliss",
    "position": "QB",
    "school": "Ole Miss",
    "rank": 97,
    "height": "6-1",
    "weight": "200",
    "year": "Junior",
    "analystRanks": {
      "B/R": 112,
      "CBS": 113,
      "ESPN": 63,
      "PFF": 66,
      "PFSN": 152
    },
    "analysis": "Trinidad Chambliss has been a revelation for the Ole Miss Rebels, after leading the Ferris State Bulldogs to a Division II National Championship and earning a spot as a Harlon Hill Trophy finalist in 2024. Chambliss has been a key catalyst in the Rebels reaching the CFB Playoff semifinals, even after the loss of head coach Lane Kiffin, and he's one of the few QBs in the nation with an elite PFSN QB Impact grade over 90. At around 6'1\", 200 pounds, Chambliss is average-sized at best, with middling arm strength and elasticity, but he nonetheless proves more than competent as a prospect with his athleticism, hyper-elite creative instincts, quick coverage discernment, and anticipation in the short and intermediate ranges.\n\nChambliss always has an answer, and that quality should make him a popular value pick for teams in the middle rounds.",
    "positionRank": 3,
    "grade": 79.78
  },
  {
    "id": "dani-dennis-sutton",
    "name": "Dani Dennis-Sutton",
    "position": "EDGE",
    "school": "Penn State",
    "rank": 98,
    "height": "6-5",
    "weight": "270",
    "year": "Senior",
    "analystRanks": {
      "B/R": 57,
      "CBS": 136,
      "ESPN": 72,
      "PFF": 89,
      "PFSN": 155
    },
    "analysis": "Dani Dennis-Sutton was productive across from top-three draft pick Abdul Carter in 2024, amassing 8.5 sacks and 13 TFLs. In 2025, he echoed that production with 8.5 sacks and 12 TFLs, at times taking over games with his relentless motor and sheer tenacity. Dennis-Sutton has inbuilt limitations that place a cap on his upside, but he nonetheless holds merit as a mid-round rotational target.\n\nAt 6'4\", 266 pounds, he has ideal frame density and length, to go along with great explosiveness, arc-running speed, venerable raw power, and an underlying urgency that never dies. Dennis-Sutton's fluidity is a major concern, as he doesn't have the bend or ankle mobility to consistently reduce or make quick transitions, and he still lacks a consistent pass-rush plan. Nevertheless, Dennis-Sutton's motor and power profile ensures he can contend at contact when operating on the attack, and those same traits, in tandem with his motor, make him a force to be reckoned with in run defense and pursuit.",
    "positionRank": 15,
    "grade": 78.3
  },
  {
    "id": "jake-slaughter",
    "name": "Jake Slaughter",
    "position": "OC",
    "school": "Florida",
    "rank": 99,
    "height": "6-4",
    "weight": "303",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 104,
      "CBS": 108,
      "ESPN": 86,
      "PFF": 76,
      "PFSN": 141
    },
    "analysis": "Jake Slaughter started 33 games at center, playing for Florida in the SEC gauntlet for his entire career. In 2025, he achieved the third-highest PFSN OL Impact score in the entire nation, with an elite grade of 93.3, while allowing just four pressures. The metrics speak heavily in favor of Slaughter, but his professional projection is a bit more complicated.\n\nAt a lean 303 pounds, Slaughter lacks high-end mass or length, and he doesn't have high-end explosiveness to compensate either; all of this visibly detracts from his maximum power capacity at contact, particulary in the run game. Slaughter is intelligent and assignment-sound, but isn't a natural-born displacer, and he shines more as a pure pass protector. In the pass blocking phase, Slaughter's fluid and light-footed lateral athleticism enables him to match and stay square to threats.\n\nHe can gather rushers with precise, active hands, flexible leveraging, and upper-lower sync. And pre-snap, he has experience calling out blitz threats and commanding the front. Slaughter will best fit pass-heavy offenses, but regardless, he has the potential to be a quality NFL starter if he can withstand NFL power and siphon out more of his own.",
    "positionRank": 2,
    "grade": 78.48
  },
  {
    "id": "kaytron-allen",
    "name": "Kaytron Allen",
    "position": "RB",
    "school": "Penn State",
    "rank": 100,
    "height": "5-11",
    "weight": "217",
    "year": "Senior",
    "analystRanks": {
      "B/R": 70,
      "CBS": 133,
      "ESPN": 98,
      "PFF": 113,
      "PFSN": 103
    },
    "analysis": "Kaytron Allen was often viewed as the \"Robin\" to Nicholas Singleton's \"Batman\" in the Penn State backfield leading into 2025, but Allen emerged as the comfortably superior prospect in 2025, and excelled as the most stable presence in the Nittany Lions' entire offensive arsenal. Allen rushed for a career-high 1,303 yards and 15 touchdowns, at an extremely healthy 6.5 yards per carry in an extremely predictable Penn State offense, and he also logged the eighth-highest PFSN RB Impact score of the year at 89.8. Singleton has a much more compelling north-south athletic profile, but for teams in search of physical volume backs with ingrained running instincts, Allen is the favorable selection.\n\nThe 5'10\", 220-pound Allen is built with a thick midsection and thicker quads, and he possesses surprising cutting flexibility and angle freedom for his build. More than that, he's a swift processor who can work off angle fluctuations early in reps, navigate congestion, and finish downhill. He's delivers punishment at contact, but his 2.43 yards before contact per rush (TruMedia) corroborates his vision, efficient footwork, and cutting ease.\n\nCombine all this with Allen's willingness as a pass protector and lead blocker, and he's an ideal if non-explosive volume back who'll see the field early and often.",
    "positionRank": 5,
    "grade": 82.42
  },
  {
    "id": "deion-burks",
    "name": "Deion Burks",
    "position": "WR",
    "school": "Oklahoma",
    "rank": 101,
    "height": "6-3",
    "weight": "210",
    "year": "Senior",
    "analystRanks": {
      "B/R": 41,
      "PFF": 87,
      "PFSN": 183
    },
    "analysis": "Deion Burks first emerged as a third-year player at Purdue in 2023, accumulating 47 catches for 629 yards and seven scores. He'd ride that momentum to a transfer opportunity with Oklahoma in the SEC, but injuries relegated him to just five games of action in 2024. In 2025, Burks returned with a vengeance, quickly establishing himself as the top target for QB and fellow draft hopeful John Mateer.\n\nBurks racked up 225 yards and two scores in the first three games, and eclipsed the 100-yard mark in a standout performance against the vaunted Michigan defense. At 5'10\", 182 pounds, Burks fits the mold of a dual-sided separation and RAC threat. He excels on schemed touches with his explosiveness, speed, and twitch, but he's also a savvy zone navigator who can splice into Cover 2 holes with his range, and make smooth body-control catches.",
    "positionRank": 15,
    "grade": 78.89
  },
  {
    "id": "dontay-corleone",
    "name": "Dontay Corleone",
    "position": "DT",
    "school": "Cincinnati",
    "rank": 102,
    "height": "6-1",
    "weight": "335",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 117,
      "CBS": 91,
      "PFF": 58,
      "PFSN": 153
    },
    "analysis": "Dontay Corleone, nicknamed \"the Godfather\", has been a standout defender on the CFB stage ever since he set foot on the field at Nippert Stadium. Born and raised in Cincinnati, he had an opportunity to transfer after his 3-sack, 6-TFL redshirt freshman season, but chose to see out and finish his career with his hometown squad. At 6'1\", 320 pounds, Corleone is an incredibly unique archetype at the DT position.\n\nHe's stout and squatty, with stellar mass and proportional length, all of which amounts to superb gap control and power absorption at nose tackle. However, at his size, he also has legitimate pass-rush juice, hand power, and rush nuance, which he's utilized to remain a consistent threat on passing downs. Traditional nose tackles with pass-rush appeal are few and far between, and Corleone fits that rare blueprint.",
    "positionRank": 8
  },
  {
    "id": "daylen-everette",
    "name": "Daylen Everette",
    "position": "CB",
    "school": "Georgia",
    "rank": 103,
    "height": "6-1",
    "weight": "190",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 75,
      "CBS": 135,
      "PFF": 71,
      "PFSN": 142
    },
    "analysis": "Daylen Everette returns as a senior and an established two-year starter, who still carries early-round aspirations after joining the Bulldogs' vaunted defense as a five-star recruit back in 2022. Everette's first season as a starter was up-and-down, but his potential nonetheless popped off the screen, and his 2024 campaign was a step in the right direction. At 6'1\", 190 pounds, with gliding long-strider speed, Everette appears most comfortable in side-saddle and trail, where he can position himself to wall off opponents and contend for targets.\n\nHe flourished as a playmaker and turnover generator with 3 INTs in 2024, but he still needs to iron out inconsistencies reducing overtop comeback routes and getting off blocks in the run game. For zone-heavy NFL schemes, he's a worthy early-round contender, but there's work left to be done.",
    "positionRank": 15
  },
  {
    "id": "carson-beck",
    "name": "Carson Beck",
    "position": "QB",
    "school": "Miami (FL)",
    "rank": 104,
    "height": "6-4",
    "weight": "220",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 51,
      "ESPN": 58,
      "PFF": 91,
      "PFSN": 224
    },
    "analysis": "Carson Beck was a QB1 candidate entering the 2025 NFL Draft cycle. His 2024 campaign was reasonably productive, and Georgia still went 11-2 under his watch, but a notable regression in accuracy and decision making led Beck to return to school and transfer to Miami for his final season. In his final season, Beck helped lead Miami to a National Championship appearance, but his stock remains tempered.\n\nHe had surgery to repair the UCL in his right arm after the 2025 season, and his arm simply hasn't been the same since. Arm strength was once a positive of Beck's profile, but it is now a weakness, and it places a greater limitation on his outlook. He has the processing ability and checkdown awareness to be a quality backup, but even as an exclusive pocket passer, he can experience bouts of inaccuracy and arm arrogance that induce volatility.\n\nPurely a Day 3 prospect, Beck's experience underlies his value as a QB2 in the NFL.",
    "positionRank": 4,
    "grade": 72.38
  },
  {
    "id": "jacob-rodriguez",
    "name": "Jacob Rodriguez",
    "position": "LB",
    "school": "Texas Tech",
    "rank": 105,
    "height": "6-1",
    "weight": "235",
    "year": "Senior",
    "analystRanks": {
      "B/R": 123,
      "CBS": 122,
      "ESPN": 89,
      "PFF": 90,
      "PFSN": 107
    },
    "positionRank": 11,
    "grade": 78.63
  },
  {
    "id": "brian-parker-ii",
    "name": "Brian Parker II",
    "position": "OG",
    "school": "Duke",
    "rank": 106,
    "height": "6-5",
    "weight": "300",
    "year": "RS Junior",
    "analystRanks": {
      "B/R": 99,
      "CBS": 111,
      "PFF": 100,
      "PFSN": 116
    },
    "analysis": "Brian Parker II is a compelling mid-round offensive line prospect in the 2026 NFL Draft, who closely follows his fellow alumnus Graham Barton as a potential interior offensive line convert at the tackle position. Parker actually played center in high school, before switching out to tackle with the Blue Devils, where he's mainly played right tackle over left. At 6'5\", 300 pounds, Parker has a densely-built frame with impressive overall mass and good proportions, and while he's not close to the athlete that Barton is, Parker still has enough functional athleticism to get out of his stance, reach landmarks, and swivel, and he can punish opponents with overwhelming rotational torque and driving power at the point.\n\nAt the very least, he's a five-position flex lineman who provides immediate depth. At his best, he's a long-term starter at center or guard.",
    "positionRank": 6,
    "grade": 79.86
  },
  {
    "id": "armaj-reed-adams",
    "name": "Ar'maj Reed-Adams",
    "position": "OG",
    "school": "Texas A&M",
    "rank": 107,
    "height": "6-5",
    "weight": "325",
    "year": "Senior",
    "analystRanks": {
      "CBS": 138,
      "ESPN": 49,
      "PFF": 138
    },
    "positionRank": 7
  },
  {
    "id": "joe-royer",
    "name": "Joe Royer",
    "position": "TE",
    "school": "Cincinnati",
    "rank": 108,
    "height": "6-5",
    "weight": "250",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 131,
      "CBS": 132,
      "ESPN": 48,
      "PFF": 114,
      "PFSN": 120
    },
    "analysis": "Joe Royer is an intriguing mid-round TE prospect with tantalizing receiving upside at the NFL level. Having accrued 938 yards and seven touchdowns over his past two seasons, Royer distinguished himself as a consistent pass-game threat and a primary target for Brendan Sorsby. At around 6'4\" and 255 pounds, Royer sports a dense and compact build, with very good proportions.\n\nThough his length runs on the shorter side proportionally, slightly impacting his catch radius, he's a very sure-handed target, who also has the separation framework to create space on his own. He's a fleet-footed and fluid mover leading into stems, he has the hip flexibility to sink and hinge around efficiently, and his mobility profile supports a full route tree. As a blocker, Royer's want-to is present, at the very least.\n\nHe needs to improve his leveraging and power sustain at the NFL level, as that can hurt his utility in-line. That said, he has immediate rotational appeal as a potential pass-game asset with serviceable blocking value, and quality starter upside is present.",
    "positionRank": 7,
    "grade": 80.07
  },
  {
    "id": "mike-washington-jr",
    "name": "Mike Washington Jr.",
    "position": "RB",
    "school": "Arkansas",
    "rank": 109,
    "height": "6-2",
    "weight": "228",
    "year": "Senior",
    "analystRanks": {
      "B/R": 79,
      "PFF": 133,
      "PFSN": 119
    },
    "analysis": "Mike Washington Jr. was one of the nation's most efficient runners in 2025, securing a strong PFSN RB Impact grade of 88.6 while rumbling for 1,070 yards and eight touchdowns on over six yards per carry. Washington took stops at Buffalo and New Mexico State along the way to Arkansas, and thrived against SEC competition in his final season.\n\nAt around 6'1\", 225 pounds, he's a big-bodied one-cut back with explosive north-south athleticism, the vision to quickly identify initial lanes, and the pressing IQ to bait defenders out of corridors while keeping speed. Washington's size and burst come at the cost of high-end short-area agility and hip fluidity, and he must improve his ball security at the next level. But he's nonetheless an instinctive runner who knows how to maximize his skill set, and can finish runs with physicality and punishing leg churn.\n\nHe's also a competent pass-catcher with RAC chops on swings and screens, and he holds up his end as a pass protector. In the immediate timeline, Washington projects as a physical rotational RB and sparkplug, but has scheme-diverse starter and volume upside with his build, burst, footwork, and intangibles.",
    "positionRank": 6,
    "grade": 80.66
  },
  {
    "id": "logan-jones",
    "name": "Logan Jones",
    "position": "OC",
    "school": "Iowa",
    "rank": 110,
    "height": "6-3",
    "weight": "302",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 116,
      "CBS": 128,
      "ESPN": 76,
      "PFF": 165,
      "PFSN": 81
    },
    "analysis": "Logan Jones was the Rimington Award winner in 2025, as well as the leader of a Joe Moore Award-winning Iowa offensive line. Though he'll be an older rookie at 25 years old, Jones brings a wealth of experience as a four-year collegiate starter, and projects as an early starter in zone-heavy schemes. At around 6'3\", 300 pounds, with sub-31\" arms, Jones' size serves as a potential inhibiting factor for schematic versatility.\n\nThat said, Jones has distinguished himself as an elite zone-blocking center in the run game, with expansive explosive range, expert-level angle IQ, swift hip flexibility at landmarks, and a finishing mentality that defies his below-average size. In pass protection, Jones is sound as well; he has elite stunt vision and reactive quickness, as well as smooth synergetic feel. That said, his anchor footwork and leveraging against power can be inconsistent, exacerbating concerns surrounding his on-field play strength and displacement resistance.\n\nWith his shorter arms, narrower frame, and lack of contact authority, Jones may always be somewhat susceptible to power rushes, but he nonetheless compensates with his sound two-phase game, intelligence, and S-tier athleticism.",
    "positionRank": 3,
    "grade": 80.58
  },
  {
    "id": "tyreak-sapp",
    "name": "Tyreak Sapp",
    "position": "EDGE",
    "school": "Florida",
    "rank": 111,
    "height": "6-3",
    "weight": "265",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 73,
      "CBS": 118,
      "PFF": 99,
      "PFSN": 167
    },
    "analysis": "Tyreak Sapp might not be the highest-ranked Florida defender on PFSN's board, but he was the heart and soul of the Gators defense in 2024, with 7 sacks, 13 TFLs, and 2 forced fumbles to his name. His production stalled in 2025, but he still has a compelling outlook for evaluators, with projected alignment versatility. At 6'3\", 275 pounds, he's a compact, high-mass, well-leveraged edge defender with fleet-footed acceleration, smooth lateral agility, inspiring ankle flexion and bend capacity, imposing strength at contact, and a red-hot motor on all three downs.\n\nWith his sawed-off build, Sapp does bring less-than-ideal length to the table, which limits his maximum raw power capacity at times. To that end, his margin for error is slimmer against longer blockers, and he's still refining his hand usage and precision. Nevertheless, the build, the motor, and the upward trajectory sells his stock.",
    "positionRank": 16,
    "grade": 76.98
  },
  {
    "id": "oscar-delp",
    "name": "Oscar Delp",
    "position": "TE",
    "school": "Georgia",
    "rank": 112,
    "height": "6-5",
    "weight": "245",
    "year": "Junior",
    "analystRanks": {
      "B/R": 103,
      "CBS": 143,
      "PFF": 164,
      "PFSN": 48
    },
    "analysis": "Oscar Delp isn't the same caliber of prospect that Brock Bowers was for Georgia two cycles ago, but Delp nevertheless has tantalizing athletic upside and early-round appeal in the coming 2026 NFL Draft. Standing around 6'5\", 245 pounds, Delp caught 21 passes for 248 yards and 4 TDs in 2024, then added a career-high 261 yards in 2025. The production doesn't excite, but Delp remained a steady presence in spite of the Bulldogs' up-and-down passing game.\n\nThrough the air, he's showcased his explosive RAC element, ability to stem and decelerate on quick curls, and find soft spots in zone coverage. In addition to his serviceable receiving utility, Delp is a truly elite two-phase blocking TE who can operate in-line, on the move as a puller and lead blocker, and protect the QB on passing downs. He's a schematic cheat code with supercharged athleticism to mold, and in short order, he could be an impact two-phase starter.",
    "positionRank": 8,
    "grade": 83.99
  },
  {
    "id": "skyler-gill-howard",
    "name": "Skyler Gill-Howard",
    "position": "DT",
    "school": "Texas Tech",
    "rank": 113,
    "height": "6-1",
    "weight": "290",
    "year": "Senior",
    "analystRanks": {
      "ESPN": 94,
      "PFF": 106,
      "PFSN": 145
    },
    "positionRank": 9
  },
  {
    "id": "sam-roush",
    "name": "Sam Roush",
    "position": "TE",
    "school": "Stanford",
    "rank": 114,
    "height": "6-5",
    "weight": "260",
    "year": "Senior",
    "analystRanks": {
      "B/R": 106,
      "ESPN": 93,
      "PFF": 102,
      "PFSN": 165
    },
    "analysis": "Sam Roush joined the Stanford Cardinal in 2022 and saw immediate action as a rotational blocker and special teams contributor. In 2023, he emerged as a full-time starter as a true sophomore, and he caught 40 passes as a junior in 2024. Roush's senior campaign was his most productive; he accrued 49 catches for 545 yards and two touchdowns, earning a strong PFSN TE Impact grade of 83.9.\n\nThe raw talent has always been clear with Roush, and that's part of what allowed him to acclimate so quickly at the collegiate level. At around 6'5\", 260 pounds, Roush has great size and explosiveness, to go along with steely competitive toughness and physicality. He's an excellent blocking presence who, though he experiences lapses in balance and technical control, has the range, corrective quickness, and power profile to position himself effectively and drive through blocks.\n\nMeanwhile, as a pass-catcher, his production is a function of his smooth seam-splitting athleticism and box-out ability. Roush's catching technique can be tighter and more consistent, and his stem work as a route runner still needs major work, but he passes the requisite athletic and intangible thresholds, and his efficiency as a producer bodes well for his development as a potential high-end TE2 and eventual starter down the line.",
    "positionRank": 9,
    "grade": 76.18
  },
  {
    "id": "trey-zuhn-iii",
    "name": "Trey Zuhn III",
    "position": "OT",
    "school": "Texas A&M",
    "rank": 115,
    "height": "6-6",
    "weight": "319",
    "year": "Senior",
    "analystRanks": {
      "B/R": 137,
      "CBS": 51,
      "PFF": 159,
      "PFSN": 124
    },
    "analysis": "Trey Zuhn III returned to Texas A&M in 2025 after earning draftable grades from scouts in 2025 as a tackle. In 2025, he earned first-team All-SEC honors while flexing between tackle, guard, and center. Center could ultimately be where Zuhn sticks at the NFL level, but in truth, he has three-position versatility inside, and his experience at tackle serves as an anchor for his utility.\n\nStanding at 6'6\" and 319 pounds, Zuhn brings imposing size, strength, and impressive foot speed and flexibility. His arm length under 32\" is less than ideal, and is a prime driver of Zuhn's likely transition inside, but for a taller lineman, he has the flexibility and leverage acquisition skills to fit in easily playing interior alignments. His quick feet and hands, stout anchor, and competitive edge in both pass protection and the run game insulate his value, and in time, he could be a quality starter at the fulcrum.\n\nAt the very least, he's an asset as a depth piece.",
    "positionRank": 12,
    "grade": 77.61
  },
  {
    "id": "cade-klubnik",
    "name": "Cade Klubnik",
    "position": "QB",
    "school": "Clemson",
    "rank": 116,
    "height": "6-2",
    "weight": "210",
    "year": "Senior",
    "analystRanks": {
      "B/R": 64,
      "CBS": 124,
      "PFF": 117,
      "PFSN": 169
    },
    "analysis": "Cade Klubnik is a former five-star recruit and historic high school producer, who grew to become one of the more prolific passers in college football. His senior season was a notable regression, however, that saw him put up inconsistent film as a processor and field general down-over-down. At 6'2\", 210 pounds, he's not quite the big-armed prototypical passer you'd expect in contention for early-round capital, but he's nonetheless a very compelling talent.\n\nAt his best, he's an electric point guard-style passer in the mold of Bo Nix, with dynamic athleticism, universal off-platform throwing ability, and endless arm angle freedom. However, his abundance of physical talent is marred by a lack of consistent post-snap discernment, field vision, and anticipation, and his situational accuracy took a step back in 2025. Klubnik still holds mid-round appeal as an ideal backup in West Coast-style schemes, but he's a developmental QB in the mental category, who might not get the development he needs at the next level.\n\nNevertheless, if he can expand on the flashes of leverage IQ and spatial awareness, he has starting upside.",
    "positionRank": 5,
    "grade": 77.43
  },
  {
    "id": "tim-keenan-iii",
    "name": "Tim Keenan III",
    "position": "DT",
    "school": "Alabama",
    "rank": 117,
    "height": "6-2",
    "weight": "326",
    "year": "Senior",
    "analystRanks": {
      "B/R": 83,
      "CBS": 126,
      "ESPN": 90,
      "PFF": 126,
      "PFSN": 178
    },
    "positionRank": 10,
    "grade": 78.57
  },
  {
    "id": "garrett-nussmeier",
    "name": "Garrett Nussmeier",
    "position": "QB",
    "school": "LSU",
    "rank": 118,
    "height": "6-2",
    "weight": "200",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 74,
      "CBS": 146,
      "PFF": 81,
      "PFSN": 182
    },
    "analysis": "Garrett Nussmeier is one of the most polarizing QB prospects in the 2026 NFL Draft, particularly after a 2025 season that saw him benched down the stretch. At 6'1\", 200 pounds, he's not a prototypically-built QB. He doesn't have elite athleticism or creation ability, and his arm is middling.\n\nBut in spite of these limiting elements, there's no denying his gamer mentality. Defying his frame, Nussmeier isn't afraid to stand in and deliver tough throws under pressure, nor is he scared of getting out in the flats and operating off-platform. He's also one of the most advanced processors in the class, with moments of high-level pre-snap command, anticipation, and gunslinger grit on film.\n\nThe \"gunslinger\" moniker swings both ways for Nussmeier, who is prone to taking ill-advised risks more often than preferred, and his accuracy did not progress in 2025. With average tools, his margin for errorr is slimmer, and this likely relegates to a backup and spot-starter role in the NFL. That said, with the right support and time to reset, he has the requisite mental acuity, and could carve out a career similar to Andy Dalton at his best.",
    "positionRank": 6,
    "grade": 78.33
  },
  {
    "id": "brenen-thompson",
    "name": "Brenen Thompson",
    "position": "WR",
    "school": "Mississippi State",
    "rank": 119,
    "height": "5-9",
    "weight": "170",
    "year": "Senior",
    "analystRanks": {
      "B/R": 126,
      "CBS": 60,
      "PFF": 172,
      "PFSN": 127
    },
    "analysis": "Brenen Thompson will satiate teams that have a need for speed in the 2026 NFL Draft. Thompson boasts a blistering 100-meter dash record of 10.18 seconds, which serves as a direct representation of his on-field speed. While he struggled produce consistently at Texas and Oklahoma through his first three seasons, he effectively broke out with Mississippi State in 2025, accruing 57 catches for 1,054 yards and six touchdowns, as well as a strong PFSN WR Impact score of 82.4.\n\nWith Thompson weighing in at just 170 pounds, there will be questions about his frame translates at the next level. Nevertheless, he contends well as a ball-tracker and body-control artist on the vertical plane, and he has the stem IQ and fluidity to create separation not just with his speed, but with nuance in tighter spaces. His lighter frame naturally limits his appeal withstanding contact in the RAC, but as a vertical catalyst, multi-level separator, and open-field RAC threat, he holds merit as a potential Top 100 pick.",
    "positionRank": 16,
    "grade": 81.95
  },
  {
    "id": "parker-brailsford",
    "name": "Parker Brailsford",
    "position": "OC",
    "school": "Alabama",
    "rank": 120,
    "height": "6-2",
    "weight": "290",
    "year": "Junior",
    "analystRanks": {
      "B/R": 142,
      "CBS": 97,
      "PFF": 181,
      "PFSN": 67
    },
    "analysis": "Parker Brailsford is the definition of a \"natural\" at the center position. He redshirted his first year at Washington, but emerged as an All-American and an All-Big 12 performer across the Huskies CFB Playoff run in 2023. In 2024, Brailsford followed head coach Kalen DeBoer to Alabama, and didn't miss a beat against SEC competition, earning second-team All-American honors in his first run with the Crimson Tide.\n\nAnd in 2025, he earned third-team All-SEC honors. At 6'2\", 290 pounds, Brailsford is a touch undersized, but he makes up for it with elite athleticism and blocking range, nearly infallible leverage and pad level, and surprising compact play strength and power output. A fulcrum blocker in the mold of NFL standout Aaron Brewer, Brailsford can be an impact starter in zone-oriented schemes.",
    "positionRank": 4,
    "grade": 83.32
  },
  {
    "id": "malachi-fields",
    "name": "Malachi Fields",
    "position": "WR",
    "school": "Notre Dame",
    "rank": 121,
    "height": "6-4",
    "weight": "222",
    "year": "Senior",
    "analystRanks": {
      "B/R": 77,
      "PFF": 98,
      "PFSN": 191
    },
    "positionRank": 17,
    "grade": 76.48
  },
  {
    "id": "eric-mcalister",
    "name": "Eric McAlister",
    "position": "WR",
    "school": "TCU",
    "rank": 122,
    "height": "6-3",
    "weight": "205",
    "year": "RS Senior",
    "analystRanks": {
      "CBS": 71,
      "PFF": 123,
      "PFSN": 172
    },
    "positionRank": 18
  },
  {
    "id": "drew-shelton",
    "name": "Drew Shelton",
    "position": "OT",
    "school": "Penn State",
    "rank": 123,
    "height": "6-5",
    "weight": "305",
    "year": "Senior",
    "analystRanks": {
      "B/R": 138,
      "CBS": 123,
      "ESPN": 84,
      "PFF": 135,
      "PFSN": 132
    },
    "analysis": "Drew Shelton should be near the top of your list if you want a lineman who provides both positional versatility and security at left tackle. Shelton burned his redshirt in 2022 and started five games as a true freshman, and was used as a rotational lineman across the front in 2023. He saved his best yet for 2024, starting all 16 games on the blindside while locking down NFL-caliber opponents each week.\n\n2025 was a slight step back for Shelton, whose non-elite anchor strength and apex-sealing range were exposed, particularly by superlative talents such as Arvel Reese. Nevertheless, he's a compelling prospect with potential Top 100 appeal. At 6'5\", 307 pounds, Shelton's length and overall measureables are close to average, but he's a quick-footed and nimble short-area mover and a fluid athlete, whose violent hands present pop in the run game and menacing finishing ability on snatch-and-traps in the pass game.\n\nA technically-sound pass protector and a dutiful run blocker with a tenacious edge, Shelton has NFL starter ability and projected interior flex.",
    "positionRank": 13,
    "grade": 82.29
  },
  {
    "id": "demond-claiborne",
    "name": "Demond Claiborne",
    "position": "RB",
    "school": "Wake Forest",
    "rank": 124,
    "height": "5-10",
    "weight": "195",
    "year": "Senior",
    "analystRanks": {
      "B/R": 148,
      "CBS": 114,
      "PFF": 121,
      "PFSN": 109
    },
    "analysis": "Demond Claiborne is one of the most dynamic RB prospects in the 2026 NFL Draft. Though he's a bit lighter and undersized, he compensates with a devastating elusion fusion. He's incredibly explosive working upfield, but he also has elite lateral mobility and offsetting abiltiy on the horizontal plane, as well as size-defying contact balance churning through arm tackles.\n\nClaiborne's combination of skills makes him incredibly hard to not only tackle 1-on-1, but also get a read on with pursuit angles. He's more deferential to interior running and doesn't have great peripheral vision, as he'll pass up open lanes outside in attempt to churn through congestion, a style that doesn't always mesh with his build. He'll never be an all-out brawler through contact or an elite goal-line threat, but his dynamic creative skill set is tailor-made for a standout sparkplug role on Sundays.",
    "positionRank": 7,
    "grade": 82.39
  },
  {
    "id": "jc-davis",
    "name": "J.C. Davis",
    "position": "OT",
    "school": "Illinois",
    "rank": 125,
    "height": "6-5",
    "weight": "320",
    "year": "Senior",
    "analystRanks": {
      "CBS": 121,
      "PFF": 110,
      "PFSN": 138
    },
    "positionRank": 14,
    "grade": 78.58
  },
  {
    "id": "dallen-bentley",
    "name": "Dallen Bentley",
    "position": "TE",
    "school": "Utah",
    "rank": 126,
    "height": "6-4",
    "weight": "264",
    "year": "Senior",
    "analystRanks": {
      "CBS": 141,
      "ESPN": 77,
      "PFF": 184,
      "PFSN": 91
    },
    "analysis": "Dallen Bentley is a sleeper in the 2026 TE class who could end up securing Day 2 capital and back up that billing in the NFL. At around 6'4\", 265 pounds, Bentley is one of the more sturdily-built players in the class, with a well-leveraged and high-mass frame with decent width and length. At that size, in Utah's run-heavy offense, he's easy to misconstrue as an exclusive early-down bully.\n\nTo be clear, he absolutely lives up to that image in the run game; he's explosive, tenacious on the attack, with fast and active feet and hands, driving power, quality leveraging, and physicality. That said, Bentley also doubles as a high-level receiving threat, as evidenced by his 2025 production. As a separator, he can off-set, sink, and redirect on short routes to find space, he's a stolid catch-point operator through contact, and he has the explosion and balance to accrue RAC.\n\nHe can be more consistent properly finding soft spots in zone coverage, and he's not the most flexible contortionist, but he nonetheless projects as a potential impact starter with every-down utility.",
    "positionRank": 10,
    "grade": 83.94
  },
  {
    "id": "michael-taaffe",
    "name": "Michael Taaffe",
    "position": "SAF",
    "school": "Texas",
    "rank": 127,
    "height": "6-0",
    "weight": "189",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 118,
      "PFF": 118,
      "PFSN": 136
    },
    "analysis": "Michael Taaffe enters his fifth year at Texas as a savvy, 6'0\", 189-pound safety whose journey from walk-on to starter highlights his football IQ and perseverance. Primarily deployed as a deep safety, Taaffe consistently demonstrates excellent footwork, quick recognition, and the ability to process the game at a high level, which are traits that allow him to stay on top of routes. While he’s slender for the position and can struggle wrapping up in space, Taaffe’s instincts, physicality, and smart play make him a reliable anchor in the Longhorns’ secondary and a respected leader on the back end.",
    "positionRank": 9,
    "grade": 80.05
  },
  {
    "id": "kevin-coleman-jr",
    "name": "Kevin Coleman Jr.",
    "position": "WR",
    "school": "Missouri",
    "rank": 128,
    "height": "5-11",
    "weight": "180",
    "year": "Senior",
    "analystRanks": {
      "CBS": 102,
      "PFF": 177,
      "PFSN": 93
    },
    "analysis": "Kevin Coleman Jr. is one of the hidden gems of the 2026 NFL Draft. Evaluators will be curious about his background, as he played at four different schools in four collegiate seasons.\n\nThe reason for his final transfer in 2025 was clear, however: He wanted to return home to St. Louis and play for his hometown team, the Missouri Tigers. Though the Tigers struggled at times in 2025, partly due to subpar QB play, Coleman thrived as the team's most efficient weapon.\n\nHe caught 66 passes for 732 yards and a score, and the advanced numbers give him an even greater endorsement. Coleman's two-year PFSN WR Impact score of 81.7 is stellar, and per TruMedia in 2025, he logged 2.55 yards per route run, a 13.11% catch rate over expectation, and an exceedingly low 2.5% drop rate. Coleman is undersized, but competes at the catch point with resounding consistency and a verifiable clutch gene, and his separation profile exhilarates on film.\n\nHe's one of the twitchiest, most fluid movers in the entire class, whose keen understanding of spatial manipulation and tempo enables him to win versus press, decouple easily on double-move routes, and splice his way into open zones. Right away, Coleman is a plus rotational WR with return ability, and he has starting potential as a movement-Z.",
    "positionRank": 19,
    "grade": 83.01
  },
  {
    "id": "kage-casey",
    "name": "Kage Casey",
    "position": "OT",
    "school": "Boise State",
    "rank": 129,
    "height": "6-5",
    "weight": "311",
    "year": "Senior",
    "analystRanks": {
      "B/R": 85,
      "CBS": 72,
      "PFF": 179,
      "PFSN": 163
    },
    "positionRank": 15,
    "grade": 78.71
  },
  {
    "id": "ted-hurst",
    "name": "Ted Hurst",
    "position": "WR",
    "school": "Georgia State",
    "rank": 130,
    "height": "6-3",
    "weight": "185",
    "year": "Senior",
    "analystRanks": {
      "B/R": 102,
      "PFF": 142,
      "PFSN": 139
    },
    "analysis": "Ted Hurst has the potential to be one of the earliest-selected Group of Six players on the offensive side of the ball. At a long and lean 6'3\" and 193 pounds, Hurst has an imposing build and catch radius, to pair with gliding long-strider acceleration and speed working the intermediate and deep ranges. With his frame and long-strider range alone, Hurst can splice up seams and box out smaller defenders with instinctive positioning, timing, smooth body control, and snare high-difficulty passes with quick reaction speed and sound catch technique.\n\nThat catch-point appeal is expected at his size, but what defies expectation is Hurst's hip fluidity, bend, and stride retraction freedom as a route runner. Hurst can actively stem and press DBs upfield with his speed, before sinking and retracting into open voids. Hurst isn't as efficient as a RAC threat, nor does he have as much consistency working against press and early contact.\n\nNevertheless, his combined separation and catch-point profile is extremely appealing at 6'3\", and he has more than enough long speed to stretch seams and threaten vertical as well.",
    "positionRank": 20,
    "grade": 81.96
  },
  {
    "id": "kyle-louis",
    "name": "Kyle Louis",
    "position": "LB",
    "school": "Pittsburgh",
    "rank": 131,
    "height": "6-0",
    "weight": "225",
    "year": "Junior",
    "analystRanks": {
      "B/R": 164,
      "CBS": 104,
      "ESPN": 67,
      "PFF": 178,
      "PFSN": 129
    },
    "positionRank": 12
  },
  {
    "id": "robert-spears-jennings",
    "name": "Robert Spears-Jennings",
    "position": "SAF",
    "school": "Oklahoma",
    "rank": 132,
    "height": "6-1",
    "weight": "219",
    "year": "Senior",
    "analystRanks": {
      "B/R": 78,
      "CBS": 139,
      "PFF": 174
    },
    "positionRank": 10
  },
  {
    "id": "eric-rivers",
    "name": "Eric Rivers",
    "position": "WR",
    "school": "Georgia Tech",
    "rank": 133,
    "height": "5-11",
    "weight": "180",
    "year": "Senior",
    "analystRanks": {
      "CBS": 66,
      "PFF": 125,
      "PFSN": 200
    },
    "positionRank": 21
  },
  {
    "id": "josh-cameron",
    "name": "Josh Cameron",
    "position": "WR",
    "school": "Baylor",
    "rank": 134,
    "height": "6-1",
    "weight": "224",
    "year": "Senior",
    "analystRanks": {
      "B/R": 93,
      "CBS": 84,
      "PFF": 199,
      "PFSN": 151
    },
    "analysis": "Josh Cameron had three years of marginal production at Baylor, but he emerged in 2024 with a 52-754-10 receiving line, becoming a favorite target for Bears QB Sawyer Robertson. He followed up that 2024 campaign with a 2025 campaign that saw him achieve career-highs in receptions (69) and yards (872), while earning a respectable 76.8 PFSN WR Impact score. Cameron's late breakout and non-elite efficiency may scare away analytically-minded evaluators, but there's a lot to like on the film.\n\nAt 6'1\", 218 pounds, he's a uniquely-built WR with high-level frame density, compact mass, proportional length, and long-strider burst, but he also has the ability to reduce and use stride variations to separate quickly. He has strong hands at the catch point, and he's built for RAC with his contact balance and burst. Cameron doesn't have field-stretching speed, and his athletic profile isn't elite, but there's a lot of utility in his short and intermediate route tree, chain-moving catch reliability, and active RAC element.",
    "positionRank": 22,
    "grade": 79.82
  },
  {
    "id": "nicholas-singleton",
    "name": "Nicholas Singleton",
    "position": "RB",
    "school": "Penn State",
    "rank": 135,
    "height": "6-0",
    "weight": "226",
    "year": "Senior",
    "analystRanks": {
      "B/R": 100,
      "ESPN": 66,
      "PFF": 109,
      "PFSN": 197
    },
    "analysis": "Nicholas Singleton is a gifted playmaker who's been long anticipated as a 2026 NFL Draft prospect. The 6'0\", 226-pound RB, who totaled almost 4,500 yards from scrimmage and 54 scores across his four-year career, has been clocked at 23.6 MPH, and is rumored to run the 40-yard dash at 4.35 seconds. It isn't surprising that, on film, Singleton's vertical explosion and seam-stretching speed is one of his best traits, and he can use that explosive element to create chunk plays both on outside runs and designed targets.\n\nSingleton's vision, creative instincts, and hip flexibility are all suspect, but he's a versatile receiving back with a clear usage plan in the ground game: Get him in space on more linear wide-zone concepts and let his speed and forward-churning physicality take over. As a creator, Singleton's lacking vision and hip flexibility limit his RB1 upside, but he's worthy of a spot in an RB rotation as a north-south sparkplug and designed screen threat.",
    "positionRank": 8,
    "grade": 78.23
  },
  {
    "id": "harold-perkins-jr",
    "name": "Harold Perkins Jr.",
    "position": "LB",
    "school": "LSU",
    "rank": 136,
    "height": "6-1",
    "weight": "222",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 125,
      "CBS": 134,
      "PFF": 140,
      "PFSN": 147
    },
    "analysis": "Harold Perkins Jr. has a complicated 2026 NFL Draft evaluation, but there's no denying his status as a bona fide CFB star. He was a consensus five-star recruit before joining up with the LSU Tigers, and across his first two campaigns, he racked up 13 sacks, 26 TFLs, 2 INTs, 7 PBUs, and 7 forced fumbles.\n\nHe was set to have another big year in 2024, but tore his ACL just four games into the season. In 2025, Perkins is set to return as the hybrid STAR defender in LSU's defensive scheme -- a position-less designation that compounds a lack of clarity with his NFL projection. He's an electric pass-rusher and pursuit threat, with some range and playmaking ability in zone coverage, but he might be too small to play traditional early-down LB roles, and he needs to improve his man coverage technique to exist as a hybrid in the NFL.",
    "positionRank": 13,
    "grade": 79.82
  },
  {
    "id": "marlin-klein",
    "name": "Marlin Klein",
    "position": "TE",
    "school": "Michigan",
    "rank": 137,
    "height": "6-6",
    "weight": "250",
    "year": "Senior",
    "analystRanks": {
      "B/R": 136,
      "PFF": 108,
      "PFSN": 185
    },
    "positionRank": 11
  },
  {
    "id": "daequan-wright",
    "name": "Dae'Quan Wright",
    "position": "TE",
    "school": "Ole Miss",
    "rank": 138,
    "height": "6-4",
    "weight": "255",
    "year": "Senior",
    "analystRanks": {
      "B/R": 119,
      "PFF": 152,
      "PFSN": 161
    },
    "positionRank": 12
  },
  {
    "id": "drew-allar",
    "name": "Drew Allar",
    "position": "QB",
    "school": "Penn State",
    "rank": 139,
    "height": "6-5",
    "weight": "235",
    "year": "Senior",
    "analystRanks": {
      "B/R": 109,
      "PFF": 119,
      "PFSN": 213
    },
    "analysis": "Drew Allar is perhaps the most quintessential \"prototypical QB\" in the 2026 NFL Draft. A former five-star recruit, he has the frame at 6'5\", 235 pounds. He has the rocket arm, and he has the nimble mobility and arm elasticity to work off-platform.\n\nHe also accrued a glowing record of 26-9 in his time as a starter, and helped lead Penn State to the CFB Playoff semifinals in 2024, showing glimpses of very real pre-snap command, post-snap processing, and break anticipation in the process. While Allar has an enticing blend of raw talent and offensive command, however, flaws remain on his profile. His accuracy and precision runs very hot-and-cold, his dropback and release mechanics are near liability level, and he's not the level of rushing threat to create his way out of bad situations consistently.\n\nHis season-ending ankle injury suffered in November also clouds his immediate availability. Allar will check all the cosmetic boxes for teams, and he'll be just a 22-year old rookie despite being a three-year collegiate starter. He's a low-price, low-risk investment in later rounds, but his mechanics essentially need to be rebuilt from the ground up before he can take live reps reliably.",
    "positionRank": 7,
    "grade": 69.51
  },
  {
    "id": "roman-hemby",
    "name": "Roman Hemby",
    "position": "RB",
    "school": "Indiana",
    "rank": 140,
    "height": "6-0",
    "weight": "208",
    "year": "Senior",
    "analystRanks": {
      "B/R": 153,
      "ESPN": 99,
      "PFF": 189
    },
    "analysis": "Roman Hemby arrived at Indiana after four years at Maryland, where he never saw more than 190 carries in a season but built a reputation as one of college football’s most dependable all-purpose backs. At Indiana, he eclipsed 1,000 yards for the first and only time in his career, all while maintaining his trademark efficiency. At 6'0\", 208 pounds, Hemby pairs a sturdy, compact frame with outstanding vision and burst, and he's a quality elusive threat with his crisp footwork and smooth lateral mobility.\n\nWith over 100 career catches and just three drops, he boasts some of the surest hands out of the backfield as a bonus. Hemby doesn't have domineering physicality or strength, nor is he particularly effective in pass protection, but Hemby’s play speed, patience, and one-cut quickness make him a natural fit in zone schemes. Projecting forward, his skill set profiles best as a versatile rotational back or pass-game specialist.",
    "positionRank": 9
  },
  {
    "id": "dametrious-crownover",
    "name": "Dametrious Crownover",
    "position": "OT",
    "school": "Texas A&M",
    "rank": 141,
    "height": "6-7",
    "weight": "335",
    "year": "Senior",
    "analystRanks": {
      "ESPN": 87,
      "PFF": 231,
      "PFSN": 123
    },
    "analysis": "Dametrious Crownover has the tools to win the allure of an NFL team in the first two rounds, and he's quickly trending up on the operational side. The 6'7\", 335-pound blocker was originally a tight end recruit -- if you can believe it. He played two ways between TE and defensive end in high school, before being molded into a starting offensive tackle in College Station.\n\nHe first became a full-time starter in 2024, and he never relinquished the right tackle job after that. At his size, with over 35\" arms, Crownover is truly an overwhelming physical specimen, with the powerful explosion and force potential to plow defenders out of gaps. But beyond his run game utility, he's visibly grown as a pass protector.\n\nHe has a clean pass set, good patience, and strong anchor footwork, and he seems destined to eventually start on the NFL stage. At his size, natural deficiencies in leverage acquisition and knee bend limit Crownover's situational malleability at times, but he nevertheless presents compelling upside for teams that value superlative size and power at OT.",
    "positionRank": 16,
    "grade": 80.37
  },
  {
    "id": "zxavian-harris",
    "name": "Zxavian Harris",
    "position": "DT",
    "school": "Ole Miss",
    "rank": 142,
    "height": "6-7",
    "weight": "320",
    "year": "Senior",
    "analystRanks": {
      "B/R": 156,
      "CBS": 144,
      "PFF": 173,
      "PFSN": 122
    },
    "positionRank": 11
  },
  {
    "id": "jadon-canady",
    "name": "Jadon Canady",
    "position": "DB",
    "school": "Oregon",
    "rank": 143,
    "height": "5-11",
    "weight": "185",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 113,
      "PFF": 176,
      "PFSN": 160
    },
    "positionRank": 1,
    "grade": 78.86
  },
  {
    "id": "gracen-halton",
    "name": "Gracen Halton",
    "position": "DT",
    "school": "Oklahoma",
    "rank": 144,
    "height": "6-2",
    "weight": "292",
    "year": "Senior",
    "analystRanks": {
      "B/R": 151,
      "ESPN": 62,
      "PFF": 236
    },
    "analysis": "Gracen Halton promises a ton of untapped potential to organizations who are willing to work through early imperfections in run defense and pass-rush execution. He's long been heralded as a high-level athlete. Coming out of high school with a four-star billing, Halton had a documented 33\" vertical before joining up with the Sooners.\n\nLast year, that elite explosiveness was particularly visible, as Halton played in 13 games with 3 starts, and logged 5 sacks and 6 TFLs. The 6'2\", 285-pound defensive lineman has yet to serve as a full-time starter, and it's easy to see why. His hand usage is very rudimentary at this stage, and his primary function is to serve as a power generator who punctures blocking schemes and pushes the pocket.\n\nBut if Halton can start to put it all together, he has early-round upside.",
    "positionRank": 12
  },
  {
    "id": "treydan-stukes",
    "name": "Treydan Stukes",
    "position": "CB",
    "school": "Arizona",
    "rank": 145,
    "height": "6-2",
    "weight": "200",
    "year": "Senior",
    "analystRanks": {
      "CBS": 73,
      "PFF": 270,
      "PFSN": 106
    },
    "analysis": "Treydan Stukes will be an older rookie as a sixth-year senior, and he also has a lengthy medical history that could cloud his stock at the NFL Combine. Still, if his medicals check out, he stands out as one of the biggest potential value acquisitions in the 2026 NFL Draft. A former walk-on who developed into a mult-year team captain, Stukes worked through injuries to emerge as one of the best defensive backs in college football in 2025.\n\nHe achieved an elite PFSN CB impact grade of 90.4, while allowing a meager 35.9 QB Rating and generating incompletions on a whopping 15% of his targets, per TruMedia. Sporting a lean frame, Stukes is an explosive, quick-footed, and fluid mover in coverage, who weaponizes his hyper-elite processing, route vision, and adaptability with calculated, efficient footwork, rapid reaction, and proactive physicality at contact. Stukes is most comfortable in zone coverage and off-man, as he operates better with cushion to read, react, and manage positioning.\n\nIn zone-heavy schemes, he has clear quality starter and potential impact starter ability as a natural nickel defender who can also seamlessly rotate back to safety on a situational basis, or to enact coverage disguises.",
    "positionRank": 16,
    "grade": 83.94
  },
  {
    "id": "tanner-koziol",
    "name": "Tanner Koziol",
    "position": "TE",
    "school": "Houston",
    "rank": 146,
    "height": "6-7",
    "weight": "240",
    "year": "Senior",
    "analystRanks": {
      "B/R": 114,
      "PFF": 150,
      "PFSN": 187
    },
    "analysis": "Tanner Koziol specializes as a premier pass-game weapon in the 2026 NFL Draft TE class. Towering at 6'7\", he resembles a power forward on the turf with his height, lean mass, and box-out ability. For his size, he's a plus functional athlete, too.\n\nHe's fairly fluid as a mover with solid hip flexibility, sink, foot speed, and tempo freedom, all of which proves conducive to independent separation and zone navigation. Koziol can use his smooth mobility and size to throttle up seams and corners, and he proves proficient at using late hands and sharp timing to control positioning in 1-on-1 situations, before capitalizing with body control. In the blocking phase, Koziol is much less consistent; he stands to add more mass, power, and play strength, as his sustain can suffer post-contact.\n\nThat said, at the very least, he has usage versatility. He can block off motions and insert into interior gaps, or get out in space, and for a taller TE, he has the bend and flexibility to properly acquire leverage. In the immediate timeline, Koziol is a receiving TE first, with smooth mobility and fairly sound hands, but there is blocking upside present if he can improve his presence at contact.",
    "positionRank": 13,
    "grade": 77.65
  },
  {
    "id": "bud-clark",
    "name": "Bud Clark",
    "position": "SAF",
    "school": "TCU",
    "rank": 147,
    "height": "6-2",
    "weight": "185",
    "year": "Senior",
    "analystRanks": {
      "B/R": 110,
      "PFF": 183,
      "PFSN": 164
    },
    "positionRank": 11,
    "grade": 78.75
  },
  {
    "id": "domani-jackson",
    "name": "Domani Jackson",
    "position": "CB",
    "school": "Alabama",
    "rank": 148,
    "height": "6-1",
    "weight": "190",
    "year": "Senior",
    "analystRanks": {
      "B/R": 84,
      "PFF": 185,
      "PFSN": 199
    },
    "analysis": "Domani Jackson has one of the highest ceilings in the 2026 class. He was a five-star recruit out of California, who tied the state record in the 100-meter dash with a blistering time of 10.25. Jackson's freak athleticism was his calling card, but a season-ending knee injury slowed his advance at the CFB level.\n\nAfter an up-and-down sophomore season at USC in 2023, Jackson transferred to Alabama in 2024, where he produced his best tape yet, by far. Jackson's 1-of-1 athleticism shines on tape. He can match anyone and everyone with his hyperactive twitch, foot speed, and reactive coil, and his deep speed ensures no one can stack him in trail.\n\nOutside of upside, however, he still leaves a lot to be desired, as his lack of discipline and inconsistent motor has lost him starting reps in 2025. In the right NFL environment, he could see quality development.",
    "positionRank": 17,
    "grade": 78.2
  },
  {
    "id": "leveon-moss",
    "name": "Le'Veon Moss",
    "position": "RB",
    "school": "Texas A&M",
    "rank": 149,
    "height": "5-11",
    "weight": "210",
    "year": "Senior",
    "analystRanks": {
      "B/R": 111,
      "PFF": 147,
      "PFSN": 222
    },
    "positionRank": 10,
    "grade": 76.8
  },
  {
    "id": "zane-durant",
    "name": "Zane Durant",
    "position": "DT",
    "school": "Penn State",
    "rank": 150,
    "height": "6-1",
    "weight": "287",
    "year": "Senior",
    "analystRanks": {
      "B/R": 132,
      "PFF": 201,
      "PFSN": 150
    },
    "analysis": "Zane Durant is on a steep upward trajectory after a 3-sack, 11-TFL 2024 campaign, and he has very real first-round potential in the 2026 NFL Draft. Measuring in at 6'1\", 288 pounds, with arms over 32\", Durant has a picture-perfect combination of natural leverage and proportional length, and he combines that with elite first-step and gap-splicing explosion off the snap. He's a wicked penetrator in the run game who can ID blocking concepts and get skinny through gaps, but he also has impressive lower-body power for his size, which he can channel with his natural leverage to stack and slab blocks 1-on-1.\n\nMeanwhile, in the pass-rush phase, Durant can use his burst, lateral agility, violent hands, and flexibility to terrorize blockers and QBs all in sequence. Durant is tailor-made to be an odd-front disruptor, with impact starter upside.",
    "positionRank": 13,
    "grade": 78.57
  },
  {
    "id": "lander-barton",
    "name": "Lander Barton",
    "position": "LB",
    "school": "Utah",
    "rank": 151,
    "height": "6-5",
    "weight": "240",
    "year": "Senior",
    "analystRanks": {
      "B/R": 129,
      "CBS": 129,
      "PFF": 229
    },
    "analysis": "Lander Barton returns for his senior season at Utah as a 6'4\", 236-pound linebacker with outstanding size, range, and versatility that make him projectable across multiple defensive schemes. Renowned as a sure tackler and highly effective run defender, Barton’s intelligence and athleticism enable him to handle various roles, including coverage responsibilities (even if he has some limitations in man coverage and moving backward). While his excellent size, movement skills, and technique point to every-down NFL potential, finding more consistent ways to defeat blocks will be key for him to take the next step.\n\nWith refinement, Barton profiles as a scheme-diverse, reliable starter in the pros.",
    "positionRank": 14
  },
  {
    "id": "taylen-green",
    "name": "Taylen Green",
    "position": "QB",
    "school": "Arkansas",
    "rank": 152,
    "height": "6-6",
    "weight": "230",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 87,
      "PFF": 209,
      "PFSN": 227
    },
    "analysis": "Taylen Green stands to benefit as one of the more traits-rich quarterbacks in the sparse 2026 NFL Draft class. The Mountain West Freshman of the Year back in 2022, Green took his talents to Arkansas and failed to show substantial year-over-year development, but nonetheless managed to enthrall with flashes of elite physical talent and 1-on-1 discernment. At his best, Green showed he could layer the ball over second-level defenders with pace and touch, operate off-platform on designed rollouts, and generate eye-catching velocity from different launch points.\n\nHowever, Green's field vision, accuracy, and risk aversion remain sore areas, even after four years as a starter. Green can catapult up boards with a strong pre-draft cycle, and has the raw physical talent of a starter, but it remains to be seen if he can handle the hastened pace of the NFL. In the right environment, with time to sit, he could grow, but his more likely outcome is that of a backup and eventual spot-starter.",
    "positionRank": 8,
    "grade": 76.41
  },
  {
    "id": "jalon-daniels",
    "name": "Jalon Daniels",
    "position": "QB",
    "school": "Kansas",
    "rank": 153,
    "height": "6-0",
    "weight": "220",
    "year": "Senior",
    "analystRanks": {
      "B/R": 158,
      "PFF": 166,
      "PFSN": 210
    },
    "positionRank": 9
  },
  {
    "id": "john-michael-gyllenborg",
    "name": "John Michael Gyllenborg",
    "position": "TE",
    "school": "Wyoming",
    "rank": 154,
    "height": "6-5",
    "weight": "250",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 150,
      "PFF": 158,
      "PFSN": 228
    },
    "analysis": "John Michael Gyllenborg joined the Wyoming Cowboys as a three-star recruit in 2021 and redshirted his first season with the team. After taking time to build up his frame in 2022, Gyllenborg's production peaked across the 2023 and 2024 seasons, where he combined for 53 catches, 785 yards, and six touchdowns across that two-year stretch. His production dipped in 2025, but Gyllenborg still has the physical gifts to earn the allure of NFL teams.\n\nAt around 6'5\", 251 pounds, Gyllenborg is tall and lean, with elite explosive athleticism. He can get upfield in a blink as a seam threat or working off motions, and he has the long speed to stretch creases and get behind the second level. Additionally, with his tall frame, he's shown he can properly box out defenders, play positioning, and secure tough catches.\n\nOutside of his value as a seam and vertical threat, Gyllenborg's game has its question marks. While he's tall and well-built, his arms are short; this reduces his catch radius and doesn't play well with his inconsistent leverage and pad level as a blocker. On early downs, Gyllenborg's utility remains limited, but if he can stay healthy, he has the explosive athleticism, ankle mobility, receiving chops, and play pace worth banking on in the later rounds.",
    "positionRank": 14,
    "grade": 76.17
  },
  {
    "id": "cameron-ball",
    "name": "Cameron Ball",
    "position": "DT",
    "school": "Arkansas",
    "rank": 155,
    "height": "6-5",
    "weight": "326",
    "year": "Senior",
    "analystRanks": {
      "ESPN": 85,
      "PFF": 276,
      "PFSN": 195
    },
    "positionRank": 14,
    "grade": 78.23
  },
  {
    "id": "rayshaun-benny",
    "name": "Rayshaun Benny",
    "position": "DT",
    "school": "Michigan",
    "rank": 156,
    "height": "6-3",
    "weight": "296",
    "year": "Senior",
    "analystRanks": {
      "B/R": 141,
      "PFF": 207,
      "PFSN": 212
    },
    "positionRank": 15,
    "grade": 77.56
  },
  {
    "id": "jamarion-miller",
    "name": "Jamarion Miller",
    "position": "RB",
    "school": "Alabama",
    "rank": 157,
    "analystRanks": {
      "B/R": 130,
      "PFF": 246,
      "PFSN": 205
    },
    "analysis": "Jamarion Miller was given a chance to emerge as a lead back in 2025 and failed to do so definitively. In fact, 2025 featured his worst efficiency yet as a runner, and cast doubt on his ultimate NFL upside. Nonetheless, Miller has clear value as a utility player, and has flashed legitimate NFL traits.\n\nDespite tipping the scales at 220 pounds, he's an uber-explosive runner with slashing lateral burst and eye-catching angle freedom and flexibility on one-cut plays. That same angle freedom shows up as a route runner, where he's displayed the ability to off-set defenders and create separation on angle routes and other quick concepts. To top it off, Miller is a near-elite blocker with unmatched competitive energy.\n\nHis inconsistent vision and spatial awareness limit his upside as a volume back and confine him to a rotational role, but his multi-phase utility is valuable enough that he deserves a spot in a rotation.",
    "positionRank": 11,
    "grade": 77.95
  },
  {
    "id": "adam-randall",
    "name": "Adam Randall",
    "position": "RB",
    "school": "Clemson",
    "rank": 158,
    "height": "6-2",
    "weight": "230",
    "year": "Senior",
    "analystRanks": {
      "B/R": 140,
      "PFF": 277,
      "PFSN": 233
    },
    "analysis": "Adam Randall joined the Clemson Tigers as a highly anticipated four-star wide receiver recruit back in 2022. But after hauling in just 48 catches for 533 yards and two touchdowns over his first three seasons, he made the switch to running back in 2025, and it ended up being a career-defining move. Randall ran for 814 yards and 10 TDs on 168 carries, and caught 36 passes for 254 yards and three scores -- eclipsing 1,000 yards from scrimmage for the first time in his career -- and earned a stellar 83.1 PFSN RB Impact grade.\n\nAs one might expect from a young player in just his first year at a position full-time, Randall's vision and creative instincts are very raw; when he has less space to use and less time to react, he can struggle. However, in space, Randall has the explosiveness, speed, and churning leg drive to chew up space and finish with physicality. He flashes above-average press and stem IQ when approaching blocks 1-on-1, and with his WR background, he's a naturally versatile pass-catching threat, who also proves competent as a blocker.\n\nIn the immediate timeline, Randall serves as a versatile rotational piece, but he has exciting upside if the RB position can slow down for him with more experience.",
    "positionRank": 12,
    "grade": 74.4
  },
  {
    "id": "louis-moore",
    "name": "Louis Moore",
    "position": "SAF",
    "school": "Indiana",
    "rank": 159,
    "height": "5-11",
    "weight": "200",
    "year": "Senior",
    "analystRanks": {
      "B/R": 68,
      "PFSN": 42
    },
    "analysis": "Louis Moore began his collegiate career as an unheralded recruit at JUCO Navarro College, and steadily built himself into one of the most prolific ball-hawks at the FBS level. Moore played at Navarro from 2019 through 2021 and joined the Indiana Hoosiers from 2022 through 2023, before playing one year at Ole Miss. Curt Cignetti brought Moore back to Bloomington in 2025, and Moore rewarded his trust with a first-team All-Big Ten and first-team All-American campaign, logging six interceptions as a key piece of Indiana's Championship defense.\n\nAt around 5'11\", 191 pounds, Moore is close to average size, with a below-average length profile, but he compensates with fluid athleticism, brisk closing speed, and an extremely calm, composed, and calculated intelligence that defines his game. He's one of the best in the class at managing positioning in zone, he reacts instantly to route breaks, and while his best plays come in space, he isn't afraid to be physical at contact, either. Bearing similarity to Julian Love, Moore is an older prospect, but has impact starter upside as a versatile split-field and single-high safety.",
    "positionRank": 12,
    "grade": 84.28
  },
  {
    "id": "febechi-nwaiwu",
    "name": "Febechi Nwaiwu",
    "position": "OG",
    "school": "Oklahoma",
    "rank": 160,
    "height": "6-4",
    "weight": "326",
    "year": "RS Senior",
    "analystRanks": {
      "PFSN": 63
    },
    "analysis": "Febechi Nwaiwu is one of the most compelling Day 3 offensive line targets if you're seeking reliability and positional versatility on the interior. A former walk-on at North Texas, Nwaiwu built himself up over a five-year collegiate career, and ended up being the only Oklahoma OL to start every single game across 2024 and 2025. Early in the season, Nwaiwu anchored at guard -- sometimes switching between left and right guard in a pinch within games -- before transitioning to center for the CFB Playoffs in the wake of injuries.\n\nAt center, Nwaiwu is still balancing snapping the ball and making swift hand contact, but he assuredly has the natural leverage, baseline flexibility, and anchor strength to potentially stick at the fulcrum. Meanwhile, at guard, Nwaiwu has the lateral mobility, heavy hand power, and clean technique to hold strong in pass protection, and he presents solid range, angle IQ, and ruthless driving physicality in the run game. At times, Nwaiwu displays moderate hip stiffness and peak athletic limitations, but his floor is exceedingly high, and he provides three-position flex inside.",
    "positionRank": 8,
    "grade": 83.31
  },
  {
    "id": "billy-schrauth",
    "name": "Billy Schrauth",
    "position": "OG",
    "school": "Notre Dame",
    "rank": 161,
    "height": "6-4",
    "weight": "304",
    "year": "RS Junior",
    "analystRanks": {
      "ESPN": 73
    },
    "positionRank": 9
  },
  {
    "id": "devin-moore",
    "name": "Devin Moore",
    "position": "CB",
    "school": "Florida",
    "rank": 162,
    "height": "6-3",
    "weight": "198",
    "year": "Senior",
    "analystRanks": {
      "ESPN": 71,
      "PFSN": 80
    },
    "positionRank": 18,
    "grade": 82.95
  },
  {
    "id": "carver-willis",
    "name": "Carver Willis",
    "position": "OT",
    "school": "Washington",
    "rank": 163,
    "height": "6-5",
    "weight": "312",
    "year": "RS Senior",
    "analystRanks": {
      "CBS": 80
    },
    "positionRank": 17
  },
  {
    "id": "chris-adams",
    "name": "Chris Adams",
    "position": "OT",
    "school": "Memphis",
    "rank": 164,
    "height": "6-5",
    "weight": "277",
    "year": "RS Senior",
    "analystRanks": {
      "CBS": 81
    },
    "positionRank": 18
  },
  {
    "id": "kelley-jones",
    "name": "Kelley Jones",
    "position": "CB",
    "school": "Mississippi State",
    "rank": 165,
    "height": "6-4",
    "weight": "195",
    "year": "RS Sophomore",
    "analystRanks": {
      "PFSN": 83
    },
    "positionRank": 19
  },
  {
    "id": "skyler-thomas",
    "name": "Skyler Thomas",
    "position": "SAF",
    "school": "Oregon State",
    "rank": 166,
    "height": "6-2",
    "weight": "212",
    "year": "RS Senior",
    "analystRanks": {
      "PFSN": 85
    },
    "positionRank": 13,
    "grade": 82.05
  },
  {
    "id": "matt-gulbin",
    "name": "Matt Gulbin",
    "position": "OC",
    "school": "Michigan State",
    "rank": 167,
    "height": "6-4",
    "weight": "312",
    "year": "Senior",
    "analystRanks": {
      "CBS": 119,
      "PFSN": 73
    },
    "analysis": "Matt Gulbin finished his collegiate career with double-digit starts at center, left guard, and right guard -- insulating his value as an immediate depth piece in an offensive line room. That said, he has legitimate starting appeal as an NFL center, and earned an elite PFSN OL Impact grade of 92.1 in 2025. Though Gulbin isn't quite the athlete that other early-round centers in the 2026 class are, he still brings great initial explosion off the line, and has good range climbing to the second level.\n\nIn the run game, his exceptional leverage acquisition and pad level management skills define his game, though he also boasts elite core strength when latched, and can use this to keep defenders inside his frame while driving lower-body power. Meanwhile, in pass protection, Gulbin excels at playing square to rushers, using carefully-timed punches and a suffocating anchor to limit opposing power output. Gulbin can still gain more experience identifying stunts and blitzes at the fulcrum, but he plays with patience and discipline, and isn't afraid to torque defenders off-balance and finish when given the opportunity.\n\nA high-floor player with translatable leveraging, hand power, and functional strength, Gulbin could be a mid-round steal.",
    "positionRank": 5,
    "grade": 82.53
  },
  {
    "id": "logan-taylor",
    "name": "Logan Taylor",
    "position": "IOL",
    "school": "Boston College",
    "rank": 168,
    "height": "6-7",
    "weight": "308",
    "year": "Senior",
    "analystRanks": {
      "B/R": 97
    },
    "positionRank": 1
  },
  {
    "id": "dan-villari",
    "name": "Dan Villari",
    "position": "TE",
    "school": "Syracuse",
    "rank": 169,
    "height": "6-4",
    "weight": "237",
    "year": "RS Senior",
    "analystRanks": {
      "PFSN": 97
    },
    "analysis": "Dan Villari is one of the more intriguing sleepers in the 2026 NFL Draft TE class. A dual-threat quarterback in high school, Villari first committed to play for the Michigan Wolverines, but transferred to Syracuse ahead of his third collegiate season. At Syracuse, Villari steadily made the transition from QB to tight end -- at first finding the field more as a gadget player and utility presence behind Oronde Gadsden II, before stepping into a starting role in 2025.\n\nThough the Orange's passing attack took a hit after losing Steve Angeli at QB, Villari was steady and efficient, catching 39 passes for 412 yards, while earning a strong 81.2 PFSN TE Impact score. Full stop: Villari has an argument to be the best route runner in the TE class. He's explosive, fleet-footed, and flexible as an athlete, with elite hip sink and stemming IQ, and he has enough speed to work up seams and box-out crashing safeties for tough catches.\n\nHe also flashes exciting RAC potential with his vision and energetic leg churn, and has been used as a designed carry threat in wildcat packages. Villari is still underweight and needs to improve his play strength as a blocker, but he has the separation skills to make an instant impact in the passing game and underlie starting upside, and his willingness and leverage acquisition bode well for his run-game development.",
    "positionRank": 15,
    "grade": 81.55
  },
  {
    "id": "keyron-crawford",
    "name": "Keyron Crawford",
    "position": "EDGE",
    "school": "Auburn",
    "rank": 170,
    "height": "6-4",
    "weight": "245",
    "year": "Senior",
    "analystRanks": {
      "CBS": 88,
      "PFSN": 108
    },
    "positionRank": 17,
    "grade": 81.02
  },
  {
    "id": "aamil-wagner",
    "name": "Aamil Wagner",
    "position": "OT",
    "school": "Notre Dame",
    "rank": 171,
    "height": "6-6",
    "weight": "295",
    "year": "RS Senior",
    "analystRanks": {
      "ESPN": 70,
      "PFF": 130
    },
    "positionRank": 19
  },
  {
    "id": "caden-curry",
    "name": "Caden Curry",
    "position": "EDGE",
    "school": "Ohio State",
    "rank": 172,
    "height": "6-3",
    "weight": "260",
    "year": "Senior",
    "analystRanks": {
      "CBS": 52,
      "PFSN": 159
    },
    "positionRank": 18
  },
  {
    "id": "justin-joly",
    "name": "Justin Joly",
    "position": "TE",
    "school": "NC State",
    "rank": 173,
    "height": "6-3",
    "weight": "251",
    "year": "Senior",
    "analystRanks": {
      "PFF": 86,
      "PFSN": 128
    },
    "analysis": "Justin Joly profiles as one of the better receiving tight ends in the 2026 NFL Draft, who remained consistent in an NC State passing attack that experienced year-to-year fluctuations. Joly first emerged as a top-flight producer as a sophomore in 2023, with 56 catches for 578 yards and two scores. He followed that up with a career-high 661 yards in 2024, and caught 49 passes for 489 yards and a career-high seven touchdowns in 2025.\n\nFor a slightly undersized TE at 6'3\", 251 pounds, Joly isn't as quick or twitched-up as desired, and slight hip stiffness limits his ultimate separation upside. Still, in spite of these modest limitations, he's a fairly nuanced separator with an affinity for sensing voids in zone and making himself available, as well as using his long-strider burst and speed to work up seams. For his height, Joly is a tank with a thickly-built frame and exceptional contact balance in the RAC phase, and at the catch point, he's a near-elite operator with body control, plus positioning skills, hand strength, and steely composure.\n\nEven in the blocking phase, Joly at least competes and contends, though he needs to improve his hand usage and power sustain. Joly profiles as a primary receiving TE early on in the NFL, but has the upside to become a quality two-phase starter.",
    "positionRank": 16,
    "grade": 78.66
  },
  {
    "id": "dezhaun-stribling",
    "name": "De'Zhaun Stribling",
    "position": "WR",
    "school": "Ole Miss",
    "rank": 174,
    "height": "6-2",
    "weight": "200",
    "year": "Senior",
    "analystRanks": {
      "PFF": 107
    },
    "positionRank": 23
  },
  {
    "id": "clay-patterson",
    "name": "Clay Patterson",
    "position": "DL",
    "school": "Stanford",
    "rank": 175,
    "height": "6-3",
    "weight": "280",
    "year": "RS Senior",
    "analystRanks": {
      "CBS": 109
    },
    "positionRank": 1
  },
  {
    "id": "aj-holmes-jr",
    "name": "A.J. Holmes Jr.",
    "position": "DT",
    "school": "Texas Tech",
    "rank": 176,
    "height": "6-3",
    "weight": "300",
    "year": "Junior",
    "analystRanks": {
      "CBS": 110
    },
    "positionRank": 16
  },
  {
    "id": "tristan-leigh",
    "name": "Tristan Leigh",
    "position": "OT",
    "school": "Clemson",
    "rank": 177,
    "height": "6-6",
    "weight": "310",
    "year": "Junior",
    "analystRanks": {
      "PFSN": 110
    },
    "analysis": "Tristan Leigh isn't a finished product yet, but he boasts one of the highest ceilings in the 2026 NFL Draft, for a likely non-Round 1 price. A distinguished three-year starter for a competitive Clemson team, Leigh boasts superlative explosiveness, raw power output, and physicality at 6'6\", 315 pounds, with domineering length and width. His energized motion and twitch sets him apart from most trench defenders, and he flashes jarring violence and stifling core strength as a pass protector.\n\nEven with his previous experience, Leigh still needs to improve his anchor footwork, hand precision and timing, and upper-lower synergy in pass protection, but he's a certified power generator and people-mover in the run game with astronomical two-phase upside. His development upside is extremely high at OT, but with an explosiven power element that translates in close quarters, a transition to guard is also on the table.",
    "positionRank": 20,
    "grade": 81.95
  },
  {
    "id": "jeff-caldwell",
    "name": "Jeff Caldwell",
    "position": "WR",
    "school": "Cincinnati",
    "rank": 178,
    "height": "6-5",
    "weight": "200",
    "year": "Senior",
    "analystRanks": {
      "CBS": 69,
      "PFF": 157
    },
    "positionRank": 24
  },
  {
    "id": "ethan-burke",
    "name": "Ethan Burke",
    "position": "EDGE",
    "school": "Texas",
    "rank": 179,
    "height": "6-6",
    "weight": "259",
    "year": "Senior",
    "analystRanks": {
      "CBS": 92,
      "PFSN": 135
    },
    "positionRank": 19
  },
  {
    "id": "cj-daniels",
    "name": "CJ Daniels",
    "position": "WR",
    "school": "Miami",
    "rank": 180,
    "height": "6-2",
    "weight": "205",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 72,
      "PFSN": 158
    },
    "analysis": "CJ Daniels's path at the collegiate level was a winding one. A sixth-year senior, Daniels originally began his career at Liberty. As a true freshman in 2020, Daniels flashed promise with 220 yards and three TDs on just 11 catches, averaging 20 yards per catch.\n\nHe'd expand his playmaking imprint in 2021, and after an injury-shortened 2022 season, he eclipsed 1,000 yards and 10 TDs in 2023. Daniels transferred to LSU for his first Power conference opportunity in 2024, but a stacked depth chart contributed to his transfer again in 2025, to the Miami Hurricanes. At Miami, Daniels thrived, catching 46 passes for 495 yards and seven scores.\n\nAt 6'2\", 205 pounds, Daniels is a long-limbed, acrobatic catch-point presence whom passers unequivocally trust, but he also has the route running nuance and vertical ability to support role versatility. His age, injury history, and non-elite production will likely temper his stock, but in the mid-to-late Day 3 range, he's a quality target with immediate rotational appeal.",
    "positionRank": 25
  },
  {
    "id": "albert-regis",
    "name": "Albert Regis",
    "position": "DT",
    "school": "Texas A&M",
    "rank": 181,
    "height": "6-1",
    "weight": "317",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 116
    },
    "positionRank": 17
  },
  {
    "id": "sam-hecht",
    "name": "Sam Hecht",
    "position": "OC",
    "school": "Kansas State",
    "rank": 182,
    "height": "6-4",
    "weight": "300",
    "year": "Senior",
    "analystRanks": {
      "B/R": 121,
      "PFSN": 112
    },
    "analysis": "Sam Hecht first joined the Kansas State Wildcats as a preferred walk-on in 2021, then grew to become a two-year starter and a potential early-round 2026 NFL Draft prospect at center. At a lean 6'4\", 300 pounds, Hecht doesn't have domineering size or power, but instead wins with hyper-elite athleticism, positioning, and flexibility. In the run game, Hecht has the fleet-footed, explosive range to effortlessly traverse gaps and reach landmarks, and he has the hip flexibility to flip around and seal while keeping control.\n\nMeanwhile, in pass protection, Hecht is balanced, well-leveraged, patient, and synergetic, with the ability to play square and keep positioning, as well as pick up stunts. His hand strength is below-average, and he can be outreached by longer defenders, but he compensates with quality leverage game and effective anchor footwork. Hecht projects best in zone schemes where he can operate on the move and out in space, but he has the angle IQ, intelligence, and athleticism to fulfill different roles, and he has impact starter upside if he can up his play strength.",
    "positionRank": 6,
    "grade": 80.95
  },
  {
    "id": "hezekiah-masses",
    "name": "Hezekiah Masses",
    "position": "CB",
    "school": "California",
    "rank": 183,
    "height": "6-1",
    "weight": "185",
    "year": "Senior",
    "analystRanks": {
      "PFF": 134,
      "PFSN": 99
    },
    "analysis": "Hezekiah Masses transferred to California from Florida International, after serving as a full-time starter for nearly three years on the Panthers' squad. It didn't take long for him to take off with his new opportunity at the ACC level. In 2025, Masses distinguished himself as one of the most prolific playmakers on the ball in college football, accruing five interceptions and 13 pass deflections.\n\nHe earned one of the best PFSN CB Impact grades in the league, with a figure of 92.1, and per TruMedia, he also achieved an excellent forced incompletion percentage of 20%. Masses passes the production test, and the tape test also rings true for the rising senior. At 6'1\", 185 pounds, he's long and lean with the right profile for dictation in press, but his coverage mobility is his foundation: Not his size or his physicality.\n\nHe's light and quiet on his feet, he's amped-up as an accelerator, and he has a fluid swivel on vertical transitions and overtop routes. Tackling and penalties remain areas for improvement, and Masses also lacks elite vertical speed, but he nonetheless has clear starting ability in man-heavy schemes.",
    "positionRank": 20,
    "grade": 81.66
  },
  {
    "id": "jahiem-lawson",
    "name": "Jahiem Lawson",
    "position": "EDGE",
    "school": "Clemson",
    "rank": 184,
    "height": "6-2",
    "weight": "255",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 118
    },
    "positionRank": 20
  },
  {
    "id": "bryce-lance",
    "name": "Bryce Lance",
    "position": "WR",
    "school": "North Dakota State",
    "rank": 185,
    "height": "6-3",
    "weight": "209",
    "year": "Senior",
    "analystRanks": {
      "PFF": 132,
      "PFSN": 105
    },
    "analysis": "Bryce Lance, the younger brother of former first-round pick Trey Lance, is one of the most compelling FCS prospects in the 2026 NFL Draft. A redshirt senior, Lance didn't emerge until 2024, but he did so dramatically, amassing 75 catches for 1,053 yards and 17 touchdowns. In 2025, he was similarly productive, accruing 1,079 yards and eight TDs while averaging over 21 yards per catch.\n\nLance's advanced numbers are jaw-dropping; per TruMedia, he achieved 3.8 yards per route run, a 21.05% catch rate over expectation, and 6.7 yards of RAC per reception -- over two yards more than his expected RAC. At 6'3\", 209 pounds, Lance's primary mode is as an explosive vertical threat who can attack seams and take the top off the defense, and in the FCS, he feasted within that role. He still needs to improve at proactively attacking the football and controlling catch-point positioning, and inconsistent hand technique can be the source of drops, but he nonetheless has the size, speed, stemming ability, body control, and underlying quickness to earn mid-round interest as a deep threat and RAC weapon with additional upside to unearth.",
    "positionRank": 26
  },
  {
    "id": "chris-mcclellan",
    "name": "Chris McClellan",
    "position": "DT",
    "school": "Missouri",
    "rank": 186,
    "height": "6-4",
    "weight": "323",
    "year": "Senior",
    "analystRanks": {
      "CBS": 62,
      "PFSN": 176
    },
    "positionRank": 18,
    "grade": 79.46
  },
  {
    "id": "cian-slone",
    "name": "Cian Slone",
    "position": "LB",
    "school": "NC State",
    "rank": 187,
    "height": "6-4",
    "weight": "235",
    "year": "Senior",
    "analystRanks": {
      "CBS": 120
    },
    "positionRank": 15
  },
  {
    "id": "red-murdock",
    "name": "Red Murdock",
    "position": "LB",
    "school": "Buffalo",
    "rank": 188,
    "height": "6-1",
    "weight": "240",
    "year": "RS Senior",
    "analystRanks": {
      "CBS": 127,
      "PFSN": 114
    },
    "positionRank": 16
  },
  {
    "id": "jordan-hudson",
    "name": "Jordan Hudson",
    "position": "WR",
    "school": "SMU",
    "rank": 189,
    "height": "6-1",
    "weight": "200",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 121
    },
    "analysis": "Jordan Hudson is a compelling sleeper in the 2026 class. A former four-star recruit who played his first season at TCU, Hudson transferred to SMU in 2023 and immediately produced as a go-to red-zone threat, with seven touchdowns on just 30 catches. Hudson progressed into a primary target in 2025, amassing 61 catches for 766 yards and six scores.\n\nThat production is solid if unspectacular on the surface, but his advanced numbers and efficiency metrics are glowing, particularly in an SMU offense that often went off-schedule. Hudson's 79.7 PFSN WR Impact score is strong, and per TruMedia, he boasted 2.35 yards per route run, a meager 3.7% drop rate, a 6.56% catch rate over expectation, and almost seven yards of RAC per attempt. On film, Hudson intrigues further.\n\nAt 6'1\", 193 pounds, he's close to average size, with good-not-great explosion and only above-average speed. Nevertheless, he's more quick than fast, and boasts excellent short-area agility and twitch, elite lateral explosive range and hip sink, and the retraction freedom and bend to excel as a route runner 1-on-1. And at the catch, he's one of the best in the class with his elite body control, flexibility, and high-end reactive quickness.\n\nHe needs to bring more consistent urgency as a blocker, but Hudson has clear WR2/3 appeal.",
    "positionRank": 27,
    "grade": 80.56
  },
  {
    "id": "alex-harkey",
    "name": "Alex Harkey",
    "position": "OT",
    "school": "Oregon",
    "rank": 190,
    "height": "6-6",
    "weight": "327",
    "year": "Senior",
    "analystRanks": {
      "CBS": 67,
      "PFSN": 180
    },
    "positionRank": 21,
    "grade": 78.81
  },
  {
    "id": "joey-aguilar",
    "name": "Joey Aguilar",
    "position": "QB",
    "school": "Tennessee",
    "rank": 191,
    "height": "6-3",
    "weight": "225",
    "year": "Senior",
    "analystRanks": {
      "B/R": 128
    },
    "positionRank": 10
  },
  {
    "id": "jalen-stroman",
    "name": "Jalen Stroman",
    "position": "SAF",
    "school": "Notre Dame",
    "rank": 192,
    "height": "6-1",
    "weight": "204",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 128
    },
    "positionRank": 14
  },
  {
    "id": "mikail-kamara",
    "name": "Mikail Kamara",
    "position": "EDGE",
    "school": "Indiana",
    "rank": 193,
    "height": "6-5",
    "weight": "250",
    "year": "Junior",
    "analystRanks": {
      "B/R": 162,
      "PFF": 96
    },
    "positionRank": 21
  },
  {
    "id": "brent-austin",
    "name": "Brent Austin",
    "position": "CB",
    "school": "California",
    "rank": 194,
    "height": "5-11",
    "weight": "180",
    "year": "Senior",
    "analystRanks": {
      "CBS": 83,
      "PFSN": 175
    },
    "positionRank": 21
  },
  {
    "id": "lance-mason",
    "name": "Lance Mason",
    "position": "TE",
    "school": "Wisconsin",
    "rank": 195,
    "height": "6-4",
    "weight": "250",
    "year": "Senior",
    "analystRanks": {
      "CBS": 70,
      "PFSN": 189
    },
    "positionRank": 17
  },
  {
    "id": "collin-wright",
    "name": "Collin Wright",
    "position": "CB",
    "school": "Stanford",
    "rank": 196,
    "height": "6-0",
    "weight": "195",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 130
    },
    "positionRank": 22,
    "grade": 80.22
  },
  {
    "id": "trey-moore",
    "name": "Trey Moore",
    "position": "EDGE",
    "school": "Texas",
    "rank": 197,
    "height": "6-5",
    "weight": "260",
    "year": "Senior",
    "analystRanks": {
      "PFF": 131
    },
    "positionRank": 22
  },
  {
    "id": "malik-muhammed",
    "name": "Malik Muhammed",
    "position": "CB",
    "school": "Texas",
    "rank": 198,
    "analystRanks": {
      "PFSN": 131
    },
    "positionRank": 23
  },
  {
    "id": "devon-marshall",
    "name": "Devon Marshall",
    "position": "CB",
    "school": "NC State",
    "rank": 199,
    "height": "5-11",
    "weight": "200",
    "year": "Senior",
    "analystRanks": {
      "PFF": 167,
      "PFSN": 101
    },
    "positionRank": 24,
    "grade": 81.44
  },
  {
    "id": "preston-hodge",
    "name": "Preston Hodge",
    "position": "CB",
    "school": "Colorado",
    "rank": 200,
    "height": "6-0",
    "weight": "200",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 134
    },
    "positionRank": 25,
    "grade": 80.16
  },
  {
    "id": "garrett-digiorgio",
    "name": "Garrett DiGiorgio",
    "position": "OL",
    "school": "UCLA",
    "rank": 201,
    "height": "6-7",
    "weight": "320",
    "year": "Senior",
    "analystRanks": {
      "B/R": 135
    },
    "positionRank": 1
  },
  {
    "id": "dj-campbell",
    "name": "DJ Campbell",
    "position": "OG",
    "school": "Texas",
    "rank": 202,
    "height": "6-3",
    "weight": "332",
    "year": "Senior",
    "analystRanks": {
      "PFF": 122,
      "PFSN": 148
    },
    "analysis": "DJ Campbell anchored the interior of Texas’ offensive line in 2025, as a 6'3\", 321-pound senior who held down the fort at right guard for three full seasons. Campbell overwhelms defenders with a dense, powerful frame and a natural anchor, giving him a high floor as a draft prospect. While he plays with heavy feet and is still polishing his hand placement on strikes, he often relies on raw physical gifts to win at the point of attack.\n\nWith improved technique and footwork, Campbell has the potential to develop into a dependable, power-driven guard at the next level. However, athletic limitations slightly cap his ceiling, and he projects better as a depth piece in the immediate timeline.",
    "positionRank": 10
  },
  {
    "id": "thaddeus-dixon",
    "name": "Thaddeus Dixon",
    "position": "CB",
    "school": "North Carolina",
    "rank": 203,
    "height": "6-1",
    "weight": "195",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 136
    },
    "positionRank": 26
  },
  {
    "id": "wesley-williams",
    "name": "Wesley Williams",
    "position": "EDGE",
    "school": "Duke",
    "rank": 204,
    "height": "6-3",
    "weight": "265",
    "year": "Senior",
    "analystRanks": {
      "CBS": 137
    },
    "positionRank": 23
  },
  {
    "id": "demonte-capehart",
    "name": "DeMonte Capehart",
    "position": "DT",
    "school": "Clemson",
    "rank": 205,
    "height": "6-5",
    "weight": "315",
    "year": "Senior",
    "analystRanks": {
      "CBS": 115,
      "PFF": 162
    },
    "analysis": "DeMonte Capehart is entering his sixth season with the Clemson Tigers, and of the five years he's accrued in Death Valley, he's been a starter for less than half. Capehart won't have the acclaim of former first-round picks from the school's ranks, or anticipated top prospect Peter Woods, but he nonetheless presents his own kind of appeal as a future NFL player. At 6'4\", 315 pounds, with near-34\" arms, Capehart is a long-levered gap occupier with the strength and dislodge resistance of a tree trunk.\n\nHe makes his money in the run game -- controlling blocks, one-gapping from as far inside as 0-tech and 1-tech, and puncturing holes in zone looks with his terse initial explosiveness -- and his linear burst and raw power produce a respectable disruptive imprint on passing downs.",
    "positionRank": 19
  },
  {
    "id": "aaron-anderson",
    "name": "Aaron Anderson",
    "position": "WR",
    "school": "LSU",
    "rank": 206,
    "height": "5-8",
    "weight": "188",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 139,
      "PFSN": 140
    },
    "analysis": "Aaron Anderson was a four-star recruit in 2022 who signed with Alabama, but didn't see the field in his first season. He would transfer to LSU, and emerged as a top receiving option for the Tigers in 2024, racking up 61 catches for 884 yards and five touchdowns, while earning a PFSN WR Impact grade of 81.5. In 2025, as the entire LSU offense regressed, Anderson quietly remained steady; he maintained a PFSN WR Impact score over 80, and per TruMedia, he achieved an impressive 2.64 yards per route run and 2.79 yards of RAC over expectation.\n\nAnderson needs to improve his hands, especially being at a natural size disadvantage, but he's one of the more tantalizing talents in the class for evaluators who favor natural separators and speed threats. As an athlete, Anderson is a hyper-explosive, energized mover with superlative ankle mobility and bend, and he has the speed to stretch seams, compound separation out of breaks, and accrue RAC. That same speed also grants him value as a kick returner, as evidenced by a return TD in 2024.\n\nA gasher of off-man and zone, Anderson has legitimate starting upside as a slot WR, but provides immediate utility as a rotational WR, a designed speed and RAC threat, and a special teams presence.",
    "positionRank": 28,
    "grade": 80.02
  },
  {
    "id": "josh-cuevas",
    "name": "Josh Cuevas",
    "position": "TE",
    "school": "Alabama",
    "rank": 207,
    "height": "6-3",
    "weight": "256",
    "year": "Senior",
    "analystRanks": {
      "PFF": 112,
      "PFSN": 168
    },
    "analysis": "Josh Cuevas emerged as a redshirt freshman at Cal Poly, catching 58 passes for 678 yards and six touchdowns. That early emergence put him on the radar of Power conference schools, and he transferred to Washington in 2023 as a result. Cuevas was primarily a rotational TE during Washington's Championship runner-up season, but flashed promise as a big-play threat.\n\nWhen Kalen DeBoer left Washington for Alabama, Cuevas was one of many who followed. He soon re-emerged as the team's TE1 in 2025, racking up 37 catches for 411 yards and four scores, earning a PFSN TE Impact grade of 79.6. Cuevas stands out as a well-rounded utility TE, whose value has always first come from his usage versatility and blocking.\n\nDespite having a shorter, short-armed frame, Cuevas is an explosive attacker with good compact mass, elite natural leverage, and eye-catching hand power at engagement. He can square up, drive, and displace defenders within multiple roles, and while his shorter arms affect his sustain in pass protection at times, he holds up well there, too. Meanwhile, as a receiver, Cuevas has good stem IQ, zone instincts, and sturdy hand strength through contact.\n\nHe likely doesn't quite have the flexibility, speed, or length to be a premier TE1, but he's a high-quality TE2 on day one, and could see stretches as a competent starter.",
    "positionRank": 18,
    "grade": 78.44
  },
  {
    "id": "travis-burke",
    "name": "Travis Burke",
    "position": "OL",
    "school": "Memphis",
    "rank": 208,
    "height": "6-9",
    "weight": "315",
    "year": "Senior",
    "analystRanks": {
      "CBS": 142
    },
    "positionRank": 2
  },
  {
    "id": "aaron-graves",
    "name": "Aaron Graves",
    "position": "DL",
    "school": "Iowa",
    "rank": 209,
    "height": "6-5",
    "weight": "295",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 143
    },
    "positionRank": 2
  },
  {
    "id": "alex-mclaughlin",
    "name": "Alex McLaughlin",
    "position": "SAF",
    "school": "Washington",
    "rank": 210,
    "height": "6-2",
    "weight": "201",
    "year": "Junior",
    "analystRanks": {
      "PFSN": 143
    },
    "positionRank": 15
  },
  {
    "id": "drayk-bowen",
    "name": "Drayk Bowen",
    "position": "LB",
    "school": "Notre Dame",
    "rank": 211,
    "height": "6-2",
    "weight": "235",
    "year": "Junior",
    "analystRanks": {
      "B/R": 144
    },
    "positionRank": 17
  },
  {
    "id": "kobe-baynes",
    "name": "Kobe Baynes",
    "position": "OG",
    "school": "Kansas",
    "rank": 212,
    "height": "6-4",
    "weight": "315",
    "year": "Senior",
    "analystRanks": {
      "PFF": 144
    },
    "positionRank": 11
  },
  {
    "id": "tacario-davis",
    "name": "Tacario Davis",
    "position": "CB",
    "school": "Washington",
    "rank": 213,
    "height": "6-4",
    "weight": "190",
    "year": "Senior",
    "analystRanks": {
      "PFF": 151,
      "PFSN": 137
    },
    "analysis": "Tacario Davis looked like a future Top 50 pick coming off of a standout 2023 campaign that saw him put up 15 pass breakups and a pick. His 2024 season, however, saw him experience a sharp regression. Davis transferred from Arizona to Washington in the 2025 offseason, following former Arizona head coach Jedd Fisch and his former teammate Ephesians Prysock.\n\nIn a familiar scheme with familiar surroundings, Davis enjoyed a return to prominence, achieving a strong PFSN CB Impact score of 87.3 while allowing an opposing passer rating of just 52.5, per TruMedia. At 6'3\", 190 pounds, with over 33\" arms, Davis' size can overwhelm the opposition, and at his size, he has excellent burst, short-area quickness, processing in zone, and press-man matching ability. As one might expect, Davis does experience slight fluidity and sink limitations with his build, and he doesn't quite have elite long speed or vertical range.\n\nNevertheless, in schemes that marry Cover 3 side-saddle and press-man based on situational factors, Davis stands out as an ideal mid-round target with experience, technical versatility, playmaking reach and proactivity, and a solid, dependable run support profile.",
    "positionRank": 27,
    "grade": 80.04
  },
  {
    "id": "sabastian-harsh",
    "name": "Sabastian Harsh",
    "position": "DE",
    "school": "NC State",
    "rank": 214,
    "height": "6-3",
    "weight": "263",
    "year": "Junior",
    "analystRanks": {
      "CBS": 145
    },
    "positionRank": 1
  },
  {
    "id": "keagen-trost",
    "name": "Keagen Trost",
    "position": "OG",
    "school": "Missouri",
    "rank": 215,
    "height": "6-4",
    "weight": "316",
    "year": "Senior",
    "analystRanks": {
      "B/R": 161,
      "CBS": 130
    },
    "positionRank": 12
  },
  {
    "id": "deshon-singleton",
    "name": "DeShon Singleton",
    "position": "SAF",
    "school": "Nebraska",
    "rank": 216,
    "height": "6-3",
    "weight": "210",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 146
    },
    "positionRank": 16,
    "grade": 79.9
  },
  {
    "id": "jacob-thomas",
    "name": "Jacob Thomas",
    "position": "SAF",
    "school": "James Madison",
    "rank": 217,
    "height": "6-1",
    "weight": "212",
    "year": "Senior",
    "analystRanks": {
      "B/R": 147
    },
    "positionRank": 17
  },
  {
    "id": "seth-mcgowan",
    "name": "Seth McGowan",
    "position": "RB",
    "school": "Kentucky",
    "rank": 218,
    "height": "6-1",
    "weight": "215",
    "year": "Senior",
    "analystRanks": {
      "PFF": 95,
      "PFSN": 201
    },
    "analysis": "Seth McGowan's collegiate career has been a redemptive arc. He was a highly-touted recruit upon arriving at Oklahoma in 2020, but after an arrest connected to a robbery in 2021, he was dismissed from the team. He spent three months in jail, and after fulfilling his sentence, he had few paths forward save for the JUCO level.\n\nMcGowan began rebuilding himself at Butler CC, then earned a chance at New Mexico State in 2024, and then returned to the Power Four in 2025 with Kentucky, logging 725 yards, 12 touchdowns, and a strong 81.3 PFSN RB Impact score. McGowan has spoken at length about his maturation process, and his reinvention on and off the field gives merit to his words. He's still the explosive, energized size-adjusted athlete he was as a HS talent, but he showcased impressive vision, spatial instincts, and receiving versatility in 2025, and while his pass blocking technique can improve, he's a willing participant on later downs.\n\nMcGowan will be an older rookie with a shorter prime at RB, but he stands as one of the best potential value players of the 2025 class with his size, athleticism, intangibles, and seasoned perspective, and he can be a rotational asset early in his career.",
    "positionRank": 13,
    "grade": 78.09
  },
  {
    "id": "jaeden-roberts",
    "name": "Jaeden Roberts",
    "position": "OG",
    "school": "Alabama",
    "rank": 219,
    "height": "6-5",
    "weight": "327",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 148
    },
    "analysis": "Jaeden Roberts only spent one season as a full-time starter for the Alabama Crimson Tide, but his physical framework should nonetheless earn mid-to-late round interest from NFL evaluators in April. At 6'5\" and 327 pounds, Roberts' length and imposing mass are central to his game, and his physicality stands out routinely on tape. In the run game, Roberts can use his superlative length to strike and fully extend against gap defenders, and he's also able to pull to the C-gap and slab crashing ends.\n\nMeanwhile, in pass protection, his wide base and violent punches lend well to early advantages at contact. Balance through engagement is still a major issue for Roberts, who can be slow and lumbering with his recovery footwork and inconsistent with his pad level management, and his stunt vision can improve as well. However, in spite of his limitations with recovery athleticism and flexibility, Roberts has the size, power, and physicality to hold up in a phone booth, and seal off corridors in gap schemes.\n\nHe projects as solid interior depth right away, and could take notable reps as a replacement-level starter.",
    "positionRank": 13
  },
  {
    "id": "nick-barrett",
    "name": "Nick Barrett",
    "position": "DT",
    "school": "South Carolina",
    "rank": 220,
    "height": "6-3",
    "weight": "322",
    "year": "Senior",
    "analystRanks": {
      "CBS": 94,
      "PFSN": 203
    },
    "positionRank": 20,
    "grade": 77.95
  },
  {
    "id": "beau-stephens",
    "name": "Beau Stephens",
    "position": "IOL",
    "school": "Iowa",
    "rank": 221,
    "height": "6-5",
    "weight": "315",
    "year": "Senior",
    "analystRanks": {
      "B/R": 127,
      "PFSN": 171
    },
    "analysis": "Beau Stephens was a central part of the Iowa Hawkeyes' Joe Moore Award-winning offensive line, and also boasts PFSN's highest individual OL Impact score of the 2025 season, with a grade of 94.1. At around 6'5\", 315 pounds, Stephens has above-average size and mass, and is a solid athlete for his size, with very good burst off the line and even better range in space when he's able to open up his strides. Stephens is ultra-physical and tenacious in the run game, and technically sound in pass protection, with very good footwork efficiency, synergetic feel, and awareness.\n\nStephens' sub-32\" arms can be a limitation at times; he's powerful in spite of that measurement, but he can be baited into over-reaching and lurching, and his latches aren't as strong against longer opponents. Additionally, in pass protection, Stephens still has room to improve his play strength and anchor footwork, and his balance at engagement is inconsistent. Nevertheless, Stephens passes the desired athletic and intangible thresholds, he's a gnarly competitor who relishes contact, and his flexibility is a surprising trump card that enables him to acquire leverage and engage his base consistently.\n\nHe projects as an instant depth piece and future starter.",
    "positionRank": 2,
    "grade": 78.71
  },
  {
    "id": "jordan-van-den-berg",
    "name": "Jordan van den Berg",
    "position": "DL",
    "school": "Georgia Tech",
    "rank": 222,
    "height": "6-3",
    "weight": "310",
    "year": "Senior",
    "analystRanks": {
      "CBS": 112,
      "PFSN": 188
    },
    "positionRank": 3
  },
  {
    "id": "pat-coogan",
    "name": "Pat Coogan",
    "position": "OC",
    "school": "Indiana",
    "rank": 223,
    "height": "6-5",
    "weight": "310",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 160,
      "PFF": 141
    },
    "positionRank": 7
  },
  {
    "id": "aiden-fisher",
    "name": "Aiden Fisher",
    "position": "LB",
    "school": "Indiana",
    "rank": 224,
    "height": "6-1",
    "weight": "235",
    "year": "Senior",
    "analystRanks": {
      "B/R": 152,
      "PFF": 154
    },
    "positionRank": 18
  },
  {
    "id": "chase-roberts",
    "name": "Chase Roberts",
    "position": "WR",
    "school": "BYU",
    "rank": 225,
    "height": "6-4",
    "weight": "210",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 153
    },
    "positionRank": 29
  },
  {
    "id": "khalil-dinkins",
    "name": "Khalil Dinkins",
    "position": "TE",
    "school": "Penn State",
    "rank": 226,
    "height": "6-5",
    "weight": "255",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 155
    },
    "positionRank": 19
  },
  {
    "id": "bishop-fitzgerald",
    "name": "Bishop Fitzgerald",
    "position": "SAF",
    "school": "USC",
    "rank": 227,
    "height": "5-11",
    "weight": "205",
    "year": "Senior",
    "analystRanks": {
      "PFF": 155
    },
    "positionRank": 18
  },
  {
    "id": "cole-brevard",
    "name": "Cole Brevard",
    "position": "DI",
    "school": "Texas",
    "rank": 228,
    "analystRanks": {
      "PFF": 156
    },
    "positionRank": 1
  },
  {
    "id": "rohan-jones",
    "name": "Rohan Jones",
    "position": "TE",
    "school": "Arkansas",
    "rank": 229,
    "analystRanks": {
      "PFSN": 156
    },
    "positionRank": 20
  },
  {
    "id": "cj-fite",
    "name": "C.J. Fite",
    "position": "DT",
    "school": "Arizona State",
    "rank": 230,
    "height": "6-2",
    "weight": "305",
    "year": "Junior",
    "analystRanks": {
      "B/R": 157
    },
    "positionRank": 21
  },
  {
    "id": "jalen-mcmurray",
    "name": "Jalen McMurray",
    "position": "CB",
    "school": "Tennessee",
    "rank": 231,
    "height": "6-0",
    "weight": "187",
    "year": "RS Senior",
    "analystRanks": {
      "PFSN": 157
    },
    "positionRank": 28,
    "grade": 79.19
  },
  {
    "id": "miles-kitselman",
    "name": "Miles Kitselman",
    "position": "TE",
    "school": "Tennessee",
    "rank": 232,
    "height": "6-5",
    "weight": "255",
    "year": "Senior",
    "analystRanks": {
      "PFF": 143,
      "PFSN": 177
    },
    "positionRank": 21
  },
  {
    "id": "george-gumbs-jr",
    "name": "George Gumbs Jr.",
    "position": "EDGE",
    "school": "Florida",
    "rank": 233,
    "height": "6-4",
    "weight": "250",
    "year": "Senior",
    "analystRanks": {
      "PFF": 161
    },
    "positionRank": 24
  },
  {
    "id": "zavion-thomas",
    "name": "Zavion Thomas",
    "position": "WR",
    "school": "LSU",
    "rank": 234,
    "height": "5-10",
    "weight": "195",
    "year": "Senior",
    "analystRanks": {
      "PFF": 163
    },
    "positionRank": 30
  },
  {
    "id": "charles-demmings",
    "name": "Charles Demmings",
    "position": "CB",
    "school": "SF Austin",
    "rank": 235,
    "height": "6-2",
    "weight": "180",
    "year": "Senior",
    "analystRanks": {
      "ESPN": 92,
      "PFSN": 235
    },
    "positionRank": 29,
    "grade": 73.62
  },
  {
    "id": "reuben-unije",
    "name": "Reuben Unije",
    "position": "OT",
    "school": "UCLA",
    "rank": 236,
    "height": "6-6",
    "weight": "330",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 165
    },
    "positionRank": 22
  },
  {
    "id": "erick-hunter",
    "name": "Erick Hunter",
    "position": "LB",
    "school": "Morgan State",
    "rank": 237,
    "analystRanks": {
      "PFSN": 166
    },
    "positionRank": 19
  },
  {
    "id": "vinny-anthony-ii",
    "name": "Vinny Anthony II",
    "position": "WR",
    "school": "Wisconsin",
    "rank": 238,
    "height": "6-0",
    "weight": "190",
    "year": "Senior",
    "analystRanks": {
      "CBS": 117,
      "PFSN": 216
    },
    "positionRank": 31,
    "grade": 77.34
  },
  {
    "id": "nadame-tucker",
    "name": "Nadame Tucker",
    "position": "DE",
    "school": "Western Michigan",
    "rank": 239,
    "height": "6-3",
    "weight": "250",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 149,
      "PFSN": 184
    },
    "positionRank": 2,
    "grade": 78.46
  },
  {
    "id": "devonta-smith",
    "name": "DeVonta Smith",
    "position": "CB",
    "school": "Notre Dame",
    "rank": 240,
    "height": "5-11",
    "weight": "195",
    "year": "Senior",
    "analystRanks": {
      "CBS": 140,
      "PFF": 197
    },
    "positionRank": 30
  },
  {
    "id": "isaiah-nwokobia",
    "name": "Isaiah Nwokobia",
    "position": "SAF",
    "school": "SMU",
    "rank": 241,
    "height": "6-1",
    "weight": "202",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 169
    },
    "positionRank": 19
  },
  {
    "id": "max-llewellyn",
    "name": "Max Llewellyn",
    "position": "EDGE",
    "school": "Iowa",
    "rank": 242,
    "height": "6-5",
    "weight": "263",
    "year": "Senior",
    "analystRanks": {
      "PFF": 170
    },
    "positionRank": 25
  },
  {
    "id": "jack-strand",
    "name": "Jack Strand",
    "position": "QB",
    "school": "Minnesota State Moorhead",
    "rank": 243,
    "height": "6-5",
    "weight": "240",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 173
    },
    "analysis": "Jack Strand is a notable sleeper in the 2026 NFL Draft, who's set to play in front of NFL scouts and evaluators at the American Bowl. At 6'5\", 240 pounds, Strand quietly has many of the diagnostic qualities sought after in a NFL backup or developmental starter. He's a plus athlete at his size, with a live arm and elite arm elasticity, arm angle flexibility, and off-platform freedom.\n\nOn top of his strong physical foundation, Strand has shown he can ID coverages quickly and work through progressions, and though his trigger can be a bit faster still, he's capable of operating both in-structure and on the move at a high level. Strand still has room to clean up his mechanics and get more comfortable with faster-paced defenses, but he has very real upside worth banking on in the middle rounds.",
    "positionRank": 11,
    "grade": 79.9
  },
  {
    "id": "romello-brinson",
    "name": "Romello Brinson",
    "position": "WR",
    "school": "SMU",
    "rank": 244,
    "height": "6-2",
    "weight": "190",
    "year": "Senior",
    "analystRanks": {
      "B/R": 139,
      "PFSN": 209
    },
    "positionRank": 32,
    "grade": 77.68
  },
  {
    "id": "xavier-nwankpa",
    "name": "Xavier Nwankpa",
    "position": "SAF",
    "school": "Iowa",
    "rank": 245,
    "height": "6-2",
    "weight": "210",
    "year": "Senior",
    "analystRanks": {
      "B/R": 98,
      "PFF": 254
    },
    "analysis": "Xavier Nwankpa came into Iowa City with a great deal of hype as a five-star recruit, and flashes in 2023 hinted at greater upside in 2024. Instead, Nwankpa's early-season struggles cascaded, and he lost reps on the defensive side of the ball down the stretch. He had his bright spots and flashed his tantalizing athletic upside, but there remains a need for greater consistency and further technical refinement as Nwankpa enters his fourth season.\n\nA move from strong safety to free safety should help for the 6'2\", 215-pound playmaker; he thrived as a middle-field ball-hawk in high school with 16 career HS picks. However, improvement with pedal and weave technique will be key in helping Nwankpa reach his ceiling.",
    "positionRank": 20
  },
  {
    "id": "faalili-faamoe",
    "name": "Fa'alili Fa'amoe",
    "position": "OT",
    "school": "Wake Forest",
    "rank": 246,
    "height": "6-5",
    "weight": "320",
    "year": "Senior",
    "analystRanks": {
      "PFF": 203,
      "PFSN": 149
    },
    "positionRank": 23,
    "grade": 79.85
  },
  {
    "id": "jmari-taylor",
    "name": "J'Mari Taylor",
    "position": "RB",
    "school": "Virginia",
    "rank": 247,
    "height": "5-9",
    "weight": "204",
    "year": "Senior",
    "analystRanks": {
      "PFF": 137,
      "PFSN": 217
    },
    "positionRank": 14,
    "grade": 77.31
  },
  {
    "id": "michael-wortham",
    "name": "Michael Wortham",
    "position": "WR",
    "school": "Montana",
    "rank": 248,
    "height": "5-9",
    "weight": "177",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 179
    },
    "positionRank": 33
  },
  {
    "id": "dane-key",
    "name": "Dane Key",
    "position": "WR",
    "school": "Nebraska",
    "rank": 249,
    "height": "6-3",
    "weight": "210",
    "year": "Senior",
    "analystRanks": {
      "PFF": 180
    },
    "positionRank": 34
  },
  {
    "id": "tyler-onyedim",
    "name": "Tyler Onyedim",
    "position": "DT",
    "school": "Texas A&M",
    "rank": 250,
    "height": "6-3",
    "weight": "295",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 181
    },
    "positionRank": 22,
    "grade": 78.48
  },
  {
    "id": "nolan-rucci",
    "name": "Nolan Rucci",
    "position": "OT",
    "school": "Penn State",
    "rank": 251,
    "height": "6-8",
    "weight": "310",
    "year": "Senior",
    "analystRanks": {
      "PFF": 182
    },
    "positionRank": 24
  },
  {
    "id": "vincent-anthony-jr",
    "name": "Vincent Anthony Jr.",
    "position": "EDGE",
    "school": "Duke",
    "rank": 252,
    "height": "6-5",
    "weight": "250",
    "year": "Senior",
    "analystRanks": {
      "PFF": 195,
      "PFSN": 174
    },
    "positionRank": 26,
    "grade": 78.65
  },
  {
    "id": "desmond-reid",
    "name": "Desmond Reid",
    "position": "RB",
    "school": "Pittsburgh",
    "rank": 253,
    "height": "5-8",
    "weight": "175",
    "year": "Senior",
    "analystRanks": {
      "PFF": 168,
      "PFSN": 202
    },
    "positionRank": 15
  },
  {
    "id": "jakobe-thomas",
    "name": "Jakobe Thomas",
    "position": "SAF",
    "school": "Miami (FL)",
    "rank": 254,
    "height": "6-2",
    "weight": "200",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 186
    },
    "positionRank": 21,
    "grade": 78.13
  },
  {
    "id": "kaelon-black",
    "name": "Kaelon Black",
    "position": "RB",
    "school": "Indiana",
    "rank": 255,
    "height": "5-10",
    "weight": "210",
    "year": "Senior",
    "analystRanks": {
      "B/R": 163,
      "PFF": 210
    },
    "positionRank": 16
  },
  {
    "id": "tj-hall",
    "name": "TJ Hall",
    "position": "CB",
    "school": "Iowa",
    "rank": 256,
    "height": "6-0",
    "weight": "190",
    "year": "Senior",
    "analystRanks": {
      "PFF": 212,
      "PFSN": 162
    },
    "positionRank": 31,
    "grade": 78.83
  },
  {
    "id": "tj-guy",
    "name": "TJ Guy",
    "position": "ED",
    "school": "Michigan",
    "rank": 257,
    "analystRanks": {
      "PFF": 188
    },
    "positionRank": 1
  },
  {
    "id": "markel-bell",
    "name": "Markel Bell",
    "position": "OT",
    "school": "Miami (FL)",
    "rank": 258,
    "height": "6-8",
    "weight": "335",
    "year": "Junior",
    "analystRanks": {
      "B/R": 159,
      "PFSN": 219
    },
    "positionRank": 25,
    "grade": 77.27
  },
  {
    "id": "robert-henry-jr",
    "name": "Robert Henry Jr.",
    "position": "RB",
    "school": "UTSA",
    "rank": 259,
    "height": "5-9",
    "weight": "205",
    "year": "Senior",
    "analystRanks": {
      "PFF": 186,
      "PFSN": 194
    },
    "analysis": "Robert Henry Jr. was a small-school high school star who was forced to take the JUCO route early in his collegiate career. After distinguishing himself at Jones College in Mississippi, he was able to leverage his unheralded talent into a three-year opportunity with the UTSA Roadrunners.\n\nThree years later, Henry is a legitimate NFL Draft prospect, after having amassed 408 carries for 2,339 yards and 27 touchdowns in his career. In 2025 alone, Henry rushed for a career-high 1,045 yards at almost seven yards per attempt. On film, it's not hard to see why Henry has been one of the most dynamic players in the Group of Six over the past few years.\n\nAt 5'9\", 205 pounds, Henry is undersized, but as a mover, he's springy and explosive, with light feet, nimble lateral range, acute cutting flexibility, and the long-strider burst to take advantage of creases and cutback lanes. His natural creative athleticism as a runner is only maximized by his quick processing speed, cutback anticipation, pressing IQ, and adaptability. He'll turn 25 years old at the tail end of his rookie season, but Henry has the profile of an immediate contributor as a change-of-pace back, and he could produce even beyond that.",
    "positionRank": 17,
    "grade": 78.25
  },
  {
    "id": "noah-thomas",
    "name": "Noah Thomas",
    "position": "WR",
    "school": "Georgia",
    "rank": 260,
    "height": "6-5",
    "weight": "205",
    "year": "Senior",
    "analystRanks": {
      "PFF": 190
    },
    "positionRank": 35
  },
  {
    "id": "noah-whittington",
    "name": "Noah Whittington",
    "position": "RB",
    "school": "Oregon",
    "rank": 261,
    "height": "5-10",
    "weight": "203",
    "year": "Senior",
    "analystRanks": {
      "B/R": 124,
      "PFF": 257
    },
    "positionRank": 18
  },
  {
    "id": "cole-wisniewski",
    "name": "Cole Wisniewski",
    "position": "SAF",
    "school": "Texas Tech",
    "rank": 262,
    "height": "6-4",
    "weight": "220",
    "year": "Senior",
    "analystRanks": {
      "PFF": 191
    },
    "positionRank": 22
  },
  {
    "id": "jmichael-sturdivant",
    "name": "J. Michael Sturdivant",
    "position": "WR",
    "school": "Florida",
    "rank": 263,
    "analystRanks": {
      "PFF": 192
    },
    "positionRank": 36
  },
  {
    "id": "terion-stewart",
    "name": "Terion Stewart",
    "position": "RB",
    "school": "Virginia Tech",
    "rank": 264,
    "height": "5-9",
    "weight": "222",
    "year": "Junior",
    "analystRanks": {
      "PFF": 193
    },
    "positionRank": 19
  },
  {
    "id": "cam-miller",
    "name": "Cam Miller",
    "position": "CB",
    "school": "Rutgers",
    "rank": 265,
    "height": "6-0",
    "weight": "185",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 193
    },
    "positionRank": 32,
    "grade": 78.27
  },
  {
    "id": "dj-harvey",
    "name": "DJ Harvey",
    "position": "CB",
    "school": "USC",
    "rank": 266,
    "analystRanks": {
      "PFF": 194
    },
    "positionRank": 33
  },
  {
    "id": "jaydn-ott",
    "name": "Jaydn Ott",
    "position": "RB",
    "school": "Oklahoma",
    "rank": 267,
    "year": "Senior",
    "analystRanks": {
      "PFF": 160,
      "PFSN": 231
    },
    "analysis": "Jaydn Ott looked like a future early-round pick after a true sophomore season at California that saw him amass 1,315 yards and 12 touchdowns on 246 carries, earning first-team All-Pac-12 honors in the process. Ott's efficiency tanked in 2024, however, and a transfer to Oklahoma quickly proved fruitless; with the Sooners, Ott exited the summer buried on the depth chart, and barely saw the field in his final season. At his best, Ott proved he's an exciting talent.\n\nHe's quick and explosive, with a particular affinity for north-south running with his instinctive gap processing and vertical speed, and he's flashed high-level receiving versatility and RAC ability before. But NFL evaluators will have to vet his stark regression over the past two seasons, and even at his peak, he's lacking in terms of physicality, peripheral vision, and pass blocking utility. As it stands, Ott has immense buy-low potential on Day 3, with the natural talent to grow into a quality rotational sparkplug, but pressing questions to answer as well.",
    "positionRank": 20,
    "grade": 75.94
  },
  {
    "id": "nate-boerkircher",
    "name": "Nate Boerkircher",
    "position": "TE",
    "school": "Texas A&M",
    "rank": 268,
    "height": "6-4",
    "weight": "250",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 171,
      "PFSN": 221
    },
    "analysis": "Nate Boerkircher is a prime candidate to emerge as a \"Jackson Hawes\" style of late-round TE. He caught just 38 passes in a five-year career at Texas A&M, but distinguished himself in other ways for the Aggies. At around 6'4\", 250 pounds, with solid functional length, Boerkircher is built well as a two-phase TE, and he makes his most effusive mark in the blocking phase.\n\nHe has a functional strength and power profile that can contend right away in the NFL, and he's a tenacious, technically-sound blocker as well. He acquires leverage well and consistently drives his feet through blocks, he understands attack angles, he engages with forceful hands and imposing push, and he's a competent pass protector who can serve as a sixth blocker on passing downs with his steady footwork and anchor. The same functional athleticism that makes Boerkircher so imposing as a moving blocker also underlies some moderate receiving upside; he's quick and explosive for his size, and flashes good hip mobility and stem IQ.\n\nThat said, his route tree is relatively under-developed, he's not the most flexible catch-point controller, and his hands can be inconsistent, particularly when gathering RAC passes. Boerkircher fits best as a TE2 or TE3 whose prime function is as an immediate run game catalyst.",
    "positionRank": 22,
    "grade": 76.9
  },
  {
    "id": "lake-mcree",
    "name": "Lake McRee",
    "position": "TE",
    "school": "USC",
    "rank": 269,
    "height": "6-4",
    "weight": "250",
    "year": "Senior",
    "analystRanks": {
      "PFF": 196
    },
    "positionRank": 23
  },
  {
    "id": "caleb-douglas",
    "name": "Caleb Douglas",
    "position": "WR",
    "school": "Texas Tech",
    "rank": 270,
    "height": "6-4",
    "weight": "210",
    "year": "Senior",
    "analystRanks": {
      "PFF": 187,
      "PFSN": 206
    },
    "positionRank": 37,
    "grade": 77.75
  },
  {
    "id": "gary-smith-iii",
    "name": "Gary Smith III",
    "position": "DT",
    "school": "UCLA",
    "rank": 271,
    "height": "6-2",
    "weight": "290",
    "year": "Senior",
    "analystRanks": {
      "PFF": 267,
      "PFSN": 126
    },
    "positionRank": 23
  },
  {
    "id": "lewis-bond",
    "name": "Lewis Bond",
    "position": "WR",
    "school": "Boston College",
    "rank": 272,
    "height": "5-11",
    "weight": "199",
    "year": "Senior",
    "analystRanks": {
      "PFF": 291,
      "PFSN": 104
    },
    "analysis": "Lewis Bond developed from an unheralded three-star recruit in 2021 to an ultra-dependable primary option for the Boston College Eagles in 2025. In his final season, he accmulated 88 catches, 993 yards, and a touchdown, and he also put together a strong analytical profile. His PFSN WR Impact grade was a rock-solid 80.5, and per TruMedia, Bond also registered 2.29 yards per route run, a catch rate over expectation of 13.88%, and a miniscule 2.7% drop rate.\n\nDespite being under 5'11\" and 190 pounds, with sub-30\" arms, Bond plays up to and beyond his size with his catch-point composure and hand strength, and he's an incredibly nuanced route runner and separator with high-level hip fluidity and flexibility underpinning his separation framework. At his size, Bond lacks ideal functional athleticism, as his speed and explosiveness measure closer to average than elite. That said, he's an exceedingly sound football player both before and at the catch, and he has the thickly-built midsection and lower body to supplement play strength in the RAC phase as well.\n\nA likely mid-to-late-round target, Bond has immediate rotational appeal, and could be a future starting slot WR.",
    "positionRank": 38,
    "grade": 81.4
  },
  {
    "id": "rahsul-faison",
    "name": "Rahsul Faison",
    "position": "RB",
    "school": "South Carolina",
    "rank": 273,
    "height": "6-0",
    "weight": "218",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 198,
      "PFSN": 198
    },
    "analysis": "Rahsul Faison ran for almost 3,000 yards and 42 touchdowns as a high school senior, but academic issues derailed his early college career. He opted to take the JUCO path after greyshirting at Marshall -- first spending a year at Lackawanna College, before moving to Snow College in 2021. In 2022, Faison saw the field and produced at an efficient clip, and at last began cultivating FBS interest again.\n\nAt Utah State in 2023 and 2024, Faison totaled 1,845 yards and 14 TDs, before transferring to South Carolina for his final season. With the Gamecocks, Faison was mainly a rotational back, who was kept out of pass blocking duties more often than not, but his raw talent nonetheless flashed. At almost 220 pounds, Faison has unique explosive athleticism and elite hip flexibility and bend as a mover, and working in space, he shows glimpses of high-level peripheral vision and creative freedom, with a vast move arsenal at his size.\n\nFaison will be a 26-year old rookie with an uncertain floor and ceiling, but as a late-round or PFA addition, he has the rare creative upside and receiving versatility to be a short-tenure gem in the right environment.",
    "positionRank": 21,
    "grade": 78.2
  },
  {
    "id": "reggie-virgil",
    "name": "Reggie Virgil",
    "position": "WR",
    "school": "Texas Tech",
    "rank": 274,
    "height": "6-3",
    "weight": "190",
    "year": "Senior",
    "analystRanks": {
      "PFF": 242,
      "PFSN": 154
    },
    "positionRank": 39,
    "grade": 79.2
  },
  {
    "id": "ceyair-wright",
    "name": "Ceyair Wright",
    "position": "CB",
    "school": "Nebraska",
    "rank": 275,
    "height": "6-0",
    "weight": "180",
    "year": "Senior",
    "analystRanks": {
      "PFF": 200
    },
    "positionRank": 34
  },
  {
    "id": "hank-beatty",
    "name": "Hank Beatty",
    "position": "WR",
    "school": "Illinois",
    "rank": 276,
    "height": "5-11",
    "weight": "185",
    "year": "Senior",
    "analystRanks": {
      "B/R": 133,
      "PFF": 269
    },
    "positionRank": 40
  },
  {
    "id": "james-thompson-jr",
    "name": "James Thompson Jr.",
    "position": "DT",
    "school": "Illinois",
    "rank": 277,
    "height": "6-5",
    "weight": "295",
    "year": "Senior",
    "analystRanks": {
      "PFF": 202
    },
    "positionRank": 24
  },
  {
    "id": "diego-pavia",
    "name": "Diego Pavia",
    "position": "QB",
    "school": "Vanderbilt",
    "rank": 278,
    "height": "6-0",
    "weight": "207",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 175,
      "PFSN": 230
    },
    "analysis": "Diego Pavia was one of the stars of the 2025 college football season. He began his collegiate career at New Mexico Military Institute after being overlooked as a high scool recruit, and leveraged a dominant second season at NMMI into an opportunity with the New Mexico State Aggies. With the Aggies, Pavia distinguished himself as a dynamic two-phase playmaker, and eventually ascended to the SEC as Vanderbilt's field general.\n\nIn 2025, Pavia was a Heisman finalist, and earned the top PFSN QB Impact score in the nation, with a grade of 94.8. Pavia's analytics inspire hope; he's an efficient, fairly accurate passer who avoids ill-advised risks, and he boasts a juiced-up and gritty running style. However, his on-field evaluation does leave questions.\n\nHis processing isn't quite NFL-caliber, nor is his arm strength, and even his athleticism might not be as prevalent against NFL talent. Pavia has the desired mobility, toughness, and quick-game utility to function as an NFL backup, but his ceiling is likely capped beyond that.",
    "positionRank": 12,
    "grade": 64.89
  },
  {
    "id": "behren-morton",
    "name": "Behren Morton",
    "position": "QB",
    "school": "Texas Tech",
    "rank": 279,
    "height": "6-2",
    "weight": "220",
    "year": "Senior",
    "analystRanks": {
      "B/R": 145,
      "PFF": 263
    },
    "analysis": "Behren Morton started at least four games in four of his five collegiate seasons, and was a full-time starter when available in his final three years. Though his career ended with a two-interception dud against the Oregon Ducks in the CFB Playoff Quarterfinal, Morton at least produced enough quality tape to make his way onto the NFL radar. At under 6'2\" and just over 200 pounds, Morton isn't quite a protoypical passer, nor does he have the desired athleticism or high-end arm strength.\n\nHis durability has also been a recurring issue over the past few years. Those factors alone, when combined with his inconsistent post-snap processing and accuracy, likely set his ceiling as an NFL backup and spot-starter. That said, Morton at least has the arm elasticity to launch from different arm angles and layer pace and touch on throws, and he has some platform versatility in spite of his middling athleticism.\n\nIf he can keep refining his mental game and accuracy, he can carve out a respectable career.",
    "positionRank": 13
  },
  {
    "id": "eli-heidenreich",
    "name": "Eli Heidenreich",
    "position": "WR",
    "school": "Navy",
    "rank": 280,
    "height": "6-0",
    "weight": "206",
    "year": "Senior",
    "analystRanks": {
      "PFF": 205
    },
    "positionRank": 41
  },
  {
    "id": "athan-kaliakmanis",
    "name": "Athan Kaliakmanis",
    "position": "QB",
    "school": "Rutgers",
    "rank": 281,
    "height": "6-3",
    "weight": "212",
    "year": "Senior",
    "analystRanks": {
      "PFF": 244,
      "PFSN": 170
    },
    "positionRank": 14
  },
  {
    "id": "jager-burton",
    "name": "Jager Burton",
    "position": "OC",
    "school": "Kentucky",
    "rank": 282,
    "height": "6-4",
    "weight": "323",
    "year": "Senior",
    "analystRanks": {
      "PFF": 208
    },
    "positionRank": 8
  },
  {
    "id": "harrison-wallace-iii",
    "name": "Harrison Wallace III",
    "position": "WR",
    "school": "Ole Miss",
    "rank": 283,
    "height": "6-1",
    "weight": "195",
    "year": "Senior",
    "analystRanks": {
      "PFF": 272,
      "PFSN": 144
    },
    "positionRank": 42,
    "grade": 79.91
  },
  {
    "id": "matthew-henry",
    "name": "Matthew Henry",
    "position": "WR",
    "school": "Western Kentucky",
    "rank": 284,
    "analystRanks": {
      "PFSN": 208
    },
    "positionRank": 43
  },
  {
    "id": "bryce-boettcher",
    "name": "Bryce Boettcher",
    "position": "LB",
    "school": "Oregon",
    "rank": 285,
    "height": "6-2",
    "weight": "225",
    "year": "RS Senior",
    "analystRanks": {
      "B/R": 149,
      "PFF": 268
    },
    "positionRank": 20
  },
  {
    "id": "ethan-onianwa",
    "name": "Ethan Onianwa",
    "position": "OT",
    "school": "Ohio State",
    "rank": 286,
    "height": "6-6",
    "weight": "332",
    "year": "Senior",
    "analystRanks": {
      "PFF": 211
    },
    "positionRank": 26
  },
  {
    "id": "kyle-walljasper",
    "name": "Kyle Walljasper",
    "position": "QB",
    "school": "Minnesota-Duluth",
    "rank": 287,
    "height": "6-2",
    "weight": "215",
    "year": "RS Senior",
    "analystRanks": {
      "PFSN": 211
    },
    "positionRank": 15
  },
  {
    "id": "luke-altmyer",
    "name": "Luke Altmyer",
    "position": "QB",
    "school": "Illinois",
    "rank": 288,
    "height": "6-2",
    "weight": "215",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 204,
      "PFSN": 220
    },
    "analysis": "Luke Altmyer was a four-star recruit out of high school, who ended up starting three seasons for the Illinois Fighting Illini. He closed out his collegiate career with his best season, completing 67% of his passes while throwing for over 3,000 yards, 22 touchdowns, and just five interceptions, while earning a strong PFSN QB Impact score of 85.6. As a prospect, Altmyer visibly lacks any elite traits.\n\nHis size is close to average, and his arm is only above-average at best. He's not a dynamic creator, nor is he a consistently elite anticipator. That said, he does have very good pre-snap and post-snap vision, he's reasonably accurate, he has good pocket depth discipline and navigation skills, and he's shown he can get the ball out decisively while not placing passes in harm's way.\n\nAltmyer likely won't emerge as a long-term starter in the NFL, but he has the well-rounded -- if unspectacular -- profile to be a quality backup candidate on Day 3.",
    "positionRank": 16,
    "grade": 71.69
  },
  {
    "id": "sawyer-robertson",
    "name": "Sawyer Robertson",
    "position": "QB",
    "school": "Baylor",
    "rank": 289,
    "height": "6-4",
    "weight": "220",
    "year": "Senior",
    "analystRanks": {
      "PFF": 206,
      "PFSN": 218
    },
    "analysis": "Sawyer Robertson was one of the more productive quarterbacks on the college football stage over the past two seasons. Starting four games in 2023, Robertson's game was much less consistent over that early-career stretch, but he returned as a passer reimagined in 2024, throwing for over 3,000 yards and almost 30 scores while leading his team to a 7-4 record. In 2025, Robertson achieved career-highs in yardage (3,681) and passing TDs (31), and earned a spot on the Panini Senior Bowl roster.\n\nAs a likely Day 3 selection, Robertson has plenty of appealing qualities. Though his arm is above-average at best, he's a prototypical passer with very good creation capacity and underlying touchness, and with an extra year of starting experience, his pre-snap and post-snap vision, as well as his mechanical control, markedly improved in 2025. He can still experience shoulder misalignment and situational imprecision at times, and will attempt to force throws his arm doesn't quite have the juice for, but he has the baseline physical talent, mental acuity, and toughness of an ideal backup QB and safety blanket.",
    "positionRank": 17,
    "grade": 73.53
  },
  {
    "id": "cole-payton",
    "name": "Cole Payton",
    "position": "QB",
    "school": "North Dakota State",
    "rank": 290,
    "height": "6-3",
    "weight": "232",
    "year": "Senior",
    "analystRanks": {
      "PFF": 213,
      "PFSN": 214
    },
    "analysis": "Cole Payton redshirted his first year at NDSU, and from 2022 through 2024, he was the backup to Cam Miller. He was utilized most often as a designed runner, but finally got his shot as a full-time starter in 2025. In his last season of eligibility, Payton passed for 2,719 yards, 16 touchdowns, and four interceptions on over 70% completion, while also running for 717 yards and 13 additional TDs.\n\nAdditionally, he ended the year with the second-highest PFSN QB Impact score in the FCS (89.7). The crux of Payton's appeal as a prospect is his physical talent. At 6'3\", 233 pounds, he's a well-built prototype with elite explosive athleticism, bristling long speed, and a rocket arm that can generate high-end velocity from multiple launch points and angles.\n\nBut as a one-year starter, he's sorely lacking in-game reps, and his processing runs on the slow side as a result. Payton shouldn't be thrown into the fire right away as a field general, and is a developmental QB first, who could be utilized in certain Taysom Hill-esque packages early on. If he enters the right situation and has time to acclimate before getting needed reps, starting upside is present.",
    "positionRank": 18,
    "grade": 75.14
  },
  {
    "id": "jeadyn-lukus",
    "name": "Jeadyn Lukus",
    "position": "CB",
    "school": "Clemson",
    "rank": 291,
    "analystRanks": {
      "PFF": 214
    },
    "positionRank": 35
  },
  {
    "id": "tommy-castellanos",
    "name": "Tommy Castellanos",
    "position": "QB",
    "school": "Florida State",
    "rank": 292,
    "analystRanks": {
      "PFF": 215
    },
    "positionRank": 19
  },
  {
    "id": "jalen-farmer",
    "name": "Jalen Farmer",
    "position": "OG",
    "school": "Kentucky",
    "rank": 293,
    "height": "6-5",
    "weight": "318",
    "year": "RS Senior",
    "analystRanks": {
      "PFSN": 215
    },
    "analysis": "Jalen Farmer declared for the 2026 NFL Draft as a redshirt junior, after starting two full seasons for the Kentucky Wildcats and earning a strong 87.4 PFSN OL Impact score in his final season. As one might expect from a slightly younger prospect, Farmer is a bit underdeveloped in some technical areas, most notably his hand usage. His inconsistent hand replacement can allow pass-rushers to decouple and generate pressure later in reps, and at times, he's over-reliant on his explosion and mass as an obstructor in the run game.\n\nNevertheless, Farmer is a young and ascending prospect with an enticing physical foundation. At 6'5\", 317 pounds, he has excellent lean mass, a thick and strong lower body, and good proportional length. With his initial explosion, mass, length, and mean mauler mentality, he can slab interior defenders off the line, as well as torque through and seal off gaps with his core strength.\n\nAnd in pass protection, he has a naturally strong anchor and above-average leverage acquisition skills. His game needs more refinement before he can reach his ceiling, but that ceiling is a quality starter.",
    "positionRank": 14,
    "grade": 77.41
  },
  {
    "id": "josh-moten",
    "name": "Josh Moten",
    "position": "CB",
    "school": "Southern Miss",
    "rank": 294,
    "height": "6-0",
    "weight": "185",
    "year": "Senior",
    "analystRanks": {
      "PFF": 216
    },
    "positionRank": 36
  },
  {
    "id": "josh-braun",
    "name": "Joshua Braun",
    "position": "G",
    "school": "Kentucky",
    "rank": 295,
    "analystRanks": {
      "PFF": 217
    },
    "positionRank": 1
  },
  {
    "id": "patrick-payton",
    "name": "Patrick Payton",
    "position": "EDGE",
    "school": "LSU",
    "rank": 296,
    "height": "6-4",
    "weight": "260",
    "year": "Senior",
    "analystRanks": {
      "PFF": 218
    },
    "analysis": "Patrick Payton arrives at LSU as a fifth-year senior and one of college football's most experienced edge defenders, bringing 31.5 career tackles for loss and 16 sacks after starting 26 games at Florida State. Towering at 6'6\", 255 pounds, Payton stands out for his long, twitchy frame and the ability to anchor the edge with length and power, shutting down run lanes and using his burst to disrupt upfield. While still raw as a pass rusher, he’s easily projectable thanks to his physical tools, outstanding pursuit range, and flexibility to flatten around the arc.\n\nIf he can continue developing his hand usage and add strength, Payton has the upside to become an early-round NFL Draft pick.",
    "positionRank": 27
  },
  {
    "id": "jalen-catalon",
    "name": "Jalen Catalon",
    "position": "SAF",
    "school": "Missouri",
    "rank": 297,
    "height": "5-11",
    "weight": "205",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 219
    },
    "positionRank": 23
  },
  {
    "id": "miller-moss",
    "name": "Miller Moss",
    "position": "QB",
    "school": "Louisville",
    "rank": 298,
    "height": "6-2",
    "weight": "210",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 220
    },
    "positionRank": 20
  },
  {
    "id": "elijah-pritchett",
    "name": "Elijah Pritchett",
    "position": "OT",
    "school": "Nebraska",
    "rank": 299,
    "height": "6-6",
    "weight": "310",
    "year": "Junior",
    "analystRanks": {
      "PFF": 221
    },
    "positionRank": 27
  },
  {
    "id": "seydou-traore",
    "name": "Seydou Traore",
    "position": "TE",
    "school": "Mississippi State",
    "rank": 300,
    "height": "6-4",
    "weight": "223",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 222
    },
    "positionRank": 24
  },
  {
    "id": "tyreek-chappell",
    "name": "Tyreek Chappell",
    "position": "CB",
    "school": "Texas A&M",
    "rank": 301,
    "height": "5-11",
    "weight": "180",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 223
    },
    "positionRank": 37
  },
  {
    "id": "caden-barnett",
    "name": "Caden Barnett",
    "position": "OG",
    "school": "Wyoming",
    "rank": 302,
    "height": "6-5",
    "weight": "320",
    "year": "Senior",
    "analystRanks": {
      "PFF": 250,
      "PFSN": 196
    },
    "positionRank": 15
  },
  {
    "id": "dj-rogers",
    "name": "DJ Rogers",
    "position": "TE",
    "school": "TCU",
    "rank": 303,
    "height": "6-4",
    "weight": "250",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 223
    },
    "analysis": "DJ Rogers profiles as one of the more well-rounded two-phase TE prospects in the 2026 NFL Draft. He joined the Horned Frogs in 2021 and redshirted that year, and only caught seven passes through his first three seasons. The 2024 campaign saw Rogers become more involved as a primary TE, but he saved his best for last in 2025, catching 34 passes for 319 yards and two touchdowns, while putting up a PFSN TE Impact score of 78.6.\n\nRogers grades out as solid but unspectacular in most areas. He doesn't have elite explosion, speed, or quickness, but at least passes the requisite threshold in all athletic categories. As a route runner, he has a solid route tree and very good functional stem IQ, with the range to threaten vertically up seams and accrue RAC with creases of space.\n\nAnd as a blocker, while he can still improve his play strength a bit, he has a good power profile, excels at squaring up his assignments and acquiring leverage, and is competent as an extra pass protector when called upon. With his non-elite athleticism, size, and at-times inconsistent hands, Rogers might never be a starting TE, but he can be a very good TE2 with multi-phase utility.",
    "positionRank": 25,
    "grade": 76.78
  },
  {
    "id": "eric-oneill",
    "name": "Eric O'Neill",
    "position": "ED",
    "school": "Rutgers",
    "rank": 304,
    "analystRanks": {
      "PFF": 224
    },
    "positionRank": 2
  },
  {
    "id": "logan-fano",
    "name": "Logan Fano",
    "position": "EDGE",
    "school": "Utah",
    "rank": 305,
    "height": "6-5",
    "weight": "260",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 225
    },
    "positionRank": 28
  },
  {
    "id": "deven-eastern",
    "name": "Deven Eastern",
    "position": "DT",
    "school": "Minnesota",
    "rank": 306,
    "height": "6-6",
    "weight": "300",
    "year": "RS Senior",
    "analystRanks": {
      "PFSN": 225
    },
    "positionRank": 25,
    "grade": 76.51
  },
  {
    "id": "riley-nowakowski",
    "name": "Riley Nowakowski",
    "position": "TE",
    "school": "Indiana",
    "rank": 307,
    "height": "6-1",
    "weight": "249",
    "year": "Senior",
    "analystRanks": {
      "PFF": 226
    },
    "positionRank": 26
  },
  {
    "id": "barion-brown",
    "name": "Barion Brown",
    "position": "WR",
    "school": "LSU",
    "rank": 308,
    "height": "5-11",
    "weight": "185",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 226
    },
    "positionRank": 44,
    "grade": 76.43
  },
  {
    "id": "trebor-pena",
    "name": "Trebor Pena",
    "position": "WR",
    "school": "Penn State",
    "rank": 309,
    "analystRanks": {
      "PFF": 227
    },
    "positionRank": 45
  },
  {
    "id": "micah-morris",
    "name": "Micah Morris",
    "position": "OG",
    "school": "Georgia",
    "rank": 310,
    "height": "6-4",
    "weight": "330",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 228
    },
    "positionRank": 16
  },
  {
    "id": "carsen-ryan",
    "name": "Carsen Ryan",
    "position": "TE",
    "school": "BYU",
    "rank": 311,
    "height": "6-4",
    "weight": "250",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 253,
      "PFSN": 204
    },
    "positionRank": 27
  },
  {
    "id": "jake-retzlaff",
    "name": "Jake Retzlaff",
    "position": "QB",
    "school": "Tulane",
    "rank": 312,
    "analystRanks": {
      "PFF": 230
    },
    "positionRank": 21
  },
  {
    "id": "connor-tollison",
    "name": "Connor Tollison",
    "position": "C",
    "school": "Missouri",
    "rank": 313,
    "analystRanks": {
      "PFF": 232
    },
    "positionRank": 1
  },
  {
    "id": "kaleb-elarms-orr",
    "name": "Kaleb Elarms-Orr",
    "position": "LB",
    "school": "TCU",
    "rank": 314,
    "height": "6-2",
    "weight": "230",
    "year": "RS Senior",
    "analystRanks": {
      "PFSN": 232
    },
    "positionRank": 21,
    "grade": 75.48
  },
  {
    "id": "fernando-carmona-jr",
    "name": "Fernando Carmona",
    "position": "G",
    "school": "Arkansas",
    "rank": 315,
    "analystRanks": {
      "PFF": 275,
      "PFSN": 190
    },
    "analysis": "Fernando Carmona Jr. transferred to Arkansas from San Jose State in 2024, after starting two full seasons at left tackle and earning honorable mention All-Mountain West recognition in 2023. Upon arriving at Arkansas, he began his tenure with the Razorbacks at LT, but a streaky acclimation to SEC play led him to kick inside to left guard for his final season.\n\nAt guard, Carmona looked more comfortable -- registering an elite PFSN OL Impact grade of 91 -- and that's likely where he'll stick at the NFL level. Carmona's linear athleticism pops, and he has hyper-elite raw power capacity when he's able to work on the attack as a puller and climber. He's not shy about finishing opponents in the dirt, either -- though he can employ better discipline at times (10 penalties in 2025).\n\nHe's not overly flexible; he especially lacks in knee bend, and he needs to improve his leverage acquisition and pad level in pass protection. Still, Carmona brings experience, explosive straight-line athleticism, menacing power capacity, and relentless physicality. With improvements in leverage play and hand replacement, he can be an effective starter inside, with a particular affinity for gap schemes.",
    "positionRank": 2,
    "grade": 78.29
  },
  {
    "id": "dillon-bell",
    "name": "Dillon Bell",
    "position": "WR",
    "school": "Georgia",
    "rank": 316,
    "height": "6-1",
    "weight": "210",
    "year": "Senior",
    "analystRanks": {
      "PFF": 233
    },
    "positionRank": 46
  },
  {
    "id": "chip-trayanum",
    "name": "Chip Trayanum",
    "position": "RB",
    "school": "Toledo",
    "rank": 317,
    "height": "5-11",
    "weight": "227",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 234
    },
    "positionRank": 22
  },
  {
    "id": "jack-kelly",
    "name": "Jack Kelly",
    "position": "LB",
    "school": "BYU",
    "rank": 318,
    "height": "6-2",
    "weight": "242",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 234
    },
    "positionRank": 22,
    "grade": 74.28
  },
  {
    "id": "jerry-wilson",
    "name": "Jerry Wilson",
    "position": "CB",
    "school": "Florida State",
    "rank": 319,
    "analystRanks": {
      "PFF": 235
    },
    "positionRank": 38
  },
  {
    "id": "alex-afari-jr",
    "name": "Alex Afari Jr.",
    "position": "LB",
    "school": "Kentucky",
    "rank": 320,
    "height": "6-2",
    "weight": "227",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 236
    },
    "positionRank": 23,
    "grade": 71.79
  },
  {
    "id": "jaren-kanak",
    "name": "Jaren Kanak",
    "position": "TE",
    "school": "Oklahoma",
    "rank": 321,
    "height": "6-2",
    "weight": "233",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 237
    },
    "positionRank": 28
  },
  {
    "id": "vj-payne",
    "name": "VJ Payne",
    "position": "SAF",
    "school": "Kansas State",
    "rank": 322,
    "height": "6-3",
    "weight": "212",
    "year": "Senior",
    "analystRanks": {
      "PFF": 245,
      "PFSN": 229
    },
    "positionRank": 24,
    "grade": 76.12
  },
  {
    "id": "jordan-davis",
    "name": "Jordan Davis",
    "position": "OT",
    "school": "South Alabama",
    "rank": 323,
    "height": "6-5",
    "weight": "306",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 237
    },
    "positionRank": 28,
    "grade": 71.17
  },
  {
    "id": "mason-reiger",
    "name": "Mason Reiger",
    "position": "EDGE",
    "school": "Wisconsin",
    "rank": 324,
    "height": "6-5",
    "weight": "248",
    "year": "Senior",
    "analystRanks": {
      "PFF": 238
    },
    "positionRank": 29
  },
  {
    "id": "duce-chestnut",
    "name": "Duce Chestnut",
    "position": "SAF",
    "school": "Syracuse",
    "rank": 325,
    "height": "5-11",
    "weight": "200",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 238
    },
    "positionRank": 25,
    "grade": 70.56
  },
  {
    "id": "jamal-haynes",
    "name": "Jamal Haynes",
    "position": "RB",
    "school": "Georgia Tech",
    "rank": 326,
    "height": "5-9",
    "weight": "190",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 239
    },
    "positionRank": 23
  },
  {
    "id": "desmond-purnell",
    "name": "Desmond Purnell",
    "position": "LB",
    "school": "Kansas State",
    "rank": 327,
    "height": "6-0",
    "weight": "232",
    "year": "RS Senior",
    "analystRanks": {
      "PFSN": 239
    },
    "positionRank": 24,
    "grade": 70.34
  },
  {
    "id": "joe-fagnano",
    "name": "Joe Fagnano",
    "position": "QB",
    "school": "UConn",
    "rank": 328,
    "height": "6-4",
    "weight": "225",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 240
    },
    "positionRank": 22
  },
  {
    "id": "alan-herron",
    "name": "Alan Herron",
    "position": "OT",
    "school": "Maryland",
    "rank": 329,
    "height": "6-6",
    "weight": "320",
    "year": "Senior",
    "analystRanks": {
      "PFSN": 240
    },
    "positionRank": 29,
    "grade": 69.48
  },
  {
    "id": "keyshawn-james-newby",
    "name": "Keyshawn James-Newby",
    "position": "EDGE",
    "school": "New Mexico",
    "rank": 330,
    "height": "6-2",
    "weight": "240",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 241
    },
    "positionRank": 30
  },
  {
    "id": "will-kacmarek",
    "name": "Will Kacmarek",
    "position": "TE",
    "school": "Ohio State",
    "rank": 331,
    "height": "6-6",
    "weight": "258",
    "year": "RS Senior",
    "analystRanks": {
      "PFSN": 242
    },
    "analysis": "Will Kacmarek spent his first three seasons at Ohio, before transferring to play for the regional blue-blood: The Ohio State Buckeyes. At Ohio State, he served as a quality TE2 for two seasons, peaking in 2025 with 15 catches for 168 yards and a respectable PFSN TE Impact score of 76.7. Kacmarek never emerged as a starting talent at Ohio State, and lost reps to Max Klare in the passing game.\n\nThat said, Kacmarek maintained his value as a high-quality blocking presence. At 6'5\", 259 pounds, with plus length and play strength, Kacmarek sizes up well in contact situations, and while his leverage, pad level maintenance, and leg drive post-contact can be more consistent, he engages with force, is capable of operating as a sixth pass-protector, and can be difficult for defenders to unlatch. As a receiver, Kacmarek's upside is visibly capped.\n\nAthletically, he's not overly explosive, fluid, or balanced, with visible hip stiffness that constricts his route tree, and he's not very flexible in contortion situations. That said, Kacmarek's arm reach and strong hands provide measured value in red-zone and conversion scenarios. Best as a late-round pick or PFA, Kacmarek projects as a rotational TE and primary blocking TE in heavy personnel sets, whose toughness and role versatility set a stable floor.",
    "positionRank": 29,
    "grade": 67.11
  },
  {
    "id": "kyron-drones",
    "name": "Kyron Drones",
    "position": "QB",
    "school": "Virginia Tech",
    "rank": 332,
    "height": "6-2",
    "weight": "235",
    "year": "Senior",
    "analystRanks": {
      "PFF": 243
    },
    "positionRank": 23
  },
  {
    "id": "tomas-rimac",
    "name": "Tomas Rimac",
    "position": "OG",
    "school": "Virginia Tech",
    "rank": 333,
    "height": "6-6",
    "weight": "318",
    "year": "Junior",
    "analystRanks": {
      "PFF": 247
    },
    "positionRank": 17
  },
  {
    "id": "caullin-lacy",
    "name": "Caullin Lacy",
    "position": "WR",
    "school": "Louisville",
    "rank": 334,
    "height": "5-10",
    "weight": "190",
    "year": "Senior",
    "analystRanks": {
      "PFF": 287,
      "PFSN": 207
    },
    "positionRank": 47,
    "grade": 77.74
  },
  {
    "id": "riley-mahlman",
    "name": "Riley Mahlman",
    "position": "OT",
    "school": "Wisconsin",
    "rank": 335,
    "height": "6-7",
    "weight": "308",
    "year": "Senior",
    "analystRanks": {
      "PFF": 248
    },
    "analysis": "Riley Mahlman has started 31 games to this point at Wisconsin, all at right tackle, and he's trending toward an NFL ascent. Standing at 6'7\", 308 pounds, with arms that might measure shorter than 33\", Mahlman has an unorthodox build, without ideal natural leverage or reach. And yet, he's a surprisingly well-rounded, if unspectacular, OT prospect.\n\nFor his size, he has impressive knee bend and flexibility, and can play with controlled lean to acquire leverage at contact. He's a nimble mover with stellar lateral recovery and balance, he brings visible knockback power on punches and latches, and he has superb hand carriage, nuance, and synergetic feel in pass protection. He's better suited in pass-heavy schemes with his skill set, but Mahlman has a sound two-phase profile, and projects as a potential starter.",
    "positionRank": 30
  },
  {
    "id": "rj-maryland",
    "name": "RJ Maryland",
    "position": "TE",
    "school": "SMU",
    "rank": 336,
    "analystRanks": {
      "PFF": 249
    },
    "positionRank": 30
  },
  {
    "id": "keeshawn-silver",
    "name": "Keeshawn Silver",
    "position": "DI",
    "school": "USC",
    "rank": 337,
    "analystRanks": {
      "PFF": 251
    },
    "positionRank": 2
  },
  {
    "id": "eric-gentry",
    "name": "Eric Gentry",
    "position": "LB",
    "school": "USC",
    "rank": 338,
    "height": "6-6",
    "weight": "225",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 252
    },
    "positionRank": 25
  },
  {
    "id": "bryce-foster",
    "name": "Bryce Foster",
    "position": "OC",
    "school": "Kansas",
    "rank": 339,
    "height": "6-5",
    "weight": "310",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 255
    },
    "positionRank": 9
  },
  {
    "id": "ben-bell",
    "name": "Ben Bell",
    "position": "ED",
    "school": "Virginia Tech",
    "rank": 340,
    "analystRanks": {
      "PFF": 256
    },
    "positionRank": 3
  },
  {
    "id": "davion-carter",
    "name": "Davion Carter",
    "position": "G",
    "school": "Texas Tech",
    "rank": 341,
    "analystRanks": {
      "PFF": 258
    },
    "positionRank": 3
  },
  {
    "id": "jack-velling",
    "name": "Jack Velling",
    "position": "TE",
    "school": "Michigan State",
    "rank": 342,
    "height": "6-5",
    "weight": "246",
    "year": "RS Junior",
    "analystRanks": {
      "PFF": 259
    },
    "analysis": "Jack Velling enters his senior year at Michigan State coming off a 36-411-1 receiving line in 2024. At 6'4\", 256 pounds, Velling excels as a vertical seam threat and middle-of-the-field target, leveraging his sizable catch radius and toughness working through traffic to consistently find soft spots in zone coverage. While he lacks top-end speed and acceleration, limitations that can leave him stuck in man coverage, Velling’s sure hands, ability to track passes, and knack for uncovering in space make him a reliable, high-IQ weapon.\n\nHe profiles as a dependable chain-mover and steady red-zone target with the skill set to carve out an NFL role as a complementary tight end.",
    "positionRank": 31
  },
  {
    "id": "brandon-cleveland",
    "name": "Brandon Cleveland",
    "position": "DT",
    "school": "NC State",
    "rank": 343,
    "height": "6-4",
    "weight": "315",
    "year": "Senior",
    "analystRanks": {
      "PFF": 260
    },
    "positionRank": 26
  },
  {
    "id": "dean-connors",
    "name": "Dean Connors",
    "position": "RB",
    "school": "Houston",
    "rank": 344,
    "height": "6-0",
    "weight": "206",
    "year": "Senior",
    "analystRanks": {
      "PFF": 261
    },
    "positionRank": 24
  },
  {
    "id": "luke-petitbon",
    "name": "Luke Petitbon",
    "position": "OC",
    "school": "Florida State",
    "rank": 345,
    "height": "6-2",
    "weight": "295",
    "year": "Senior",
    "analystRanks": {
      "PFF": 262
    },
    "positionRank": 10
  },
  {
    "id": "jack-pyburn",
    "name": "Jack Pyburn",
    "position": "EDGE",
    "school": "LSU",
    "rank": 346,
    "height": "6-4",
    "weight": "264",
    "year": "Senior",
    "analystRanks": {
      "PFF": 283,
      "PFSN": 241
    },
    "positionRank": 31,
    "grade": 68.77
  },
  {
    "id": "squirrel-white",
    "name": "Squirrel White",
    "position": "WR",
    "school": "Florida State",
    "rank": 347,
    "height": "5-10",
    "weight": "178",
    "year": "Junior",
    "analystRanks": {
      "PFF": 264
    },
    "positionRank": 48
  },
  {
    "id": "micah-pettus",
    "name": "Micah Pettus",
    "position": "OT",
    "school": "Florida State",
    "rank": 348,
    "height": "6-6",
    "weight": "346",
    "year": "Senior",
    "analystRanks": {
      "PFF": 265
    },
    "positionRank": 31
  },
  {
    "id": "jeremiah-wright",
    "name": "Jeremiah Wright",
    "position": "OG",
    "school": "Auburn",
    "rank": 349,
    "height": "6-4",
    "weight": "340",
    "year": "Senior",
    "analystRanks": {
      "PFF": 266
    },
    "positionRank": 18
  },
  {
    "id": "austin-brown",
    "name": "Austin Brown",
    "position": "SAF",
    "school": "Wisconsin",
    "rank": 350,
    "height": "6-1",
    "weight": "213",
    "year": "Senior",
    "analystRanks": {
      "PFF": 271
    },
    "positionRank": 26
  },
  {
    "id": "landon-robinson",
    "name": "Landon Robinson",
    "position": "DT",
    "school": "Navy",
    "rank": 351,
    "height": "6-0",
    "weight": "287",
    "year": "Senior",
    "analystRanks": {
      "PFF": 273
    },
    "positionRank": 27
  },
  {
    "id": "jeff-persi",
    "name": "Jeff Persi",
    "position": "T",
    "school": "Pittsburgh",
    "rank": 352,
    "analystRanks": {
      "PFF": 274
    },
    "positionRank": 1
  },
  {
    "id": "scooby-williams",
    "name": "Scooby Williams",
    "position": "LB",
    "school": "Texas A&M",
    "rank": 353,
    "height": "6-2",
    "weight": "230",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 278
    },
    "positionRank": 26
  },
  {
    "id": "cj-donaldson",
    "name": "CJ Donaldson",
    "position": "RB",
    "school": "Ohio State",
    "rank": 354,
    "height": "6-2",
    "weight": "232",
    "year": "Senior",
    "analystRanks": {
      "PFF": 279
    },
    "positionRank": 25
  },
  {
    "id": "jeremiah-franklin",
    "name": "Jeremiah Franklin",
    "position": "TE",
    "school": "Boston College",
    "rank": 355,
    "analystRanks": {
      "PFF": 280
    },
    "positionRank": 32
  },
  {
    "id": "diego-pounds",
    "name": "Diego Pounds",
    "position": "OL",
    "school": "Ole Miss",
    "rank": 356,
    "height": "6-6",
    "weight": "340",
    "year": "Senior",
    "analystRanks": {
      "PFF": 281
    },
    "positionRank": 3
  },
  {
    "id": "josh-thompson",
    "name": "Josh Thompson",
    "position": "G",
    "school": "LSU",
    "rank": 357,
    "analystRanks": {
      "PFF": 282
    },
    "positionRank": 4
  },
  {
    "id": "xavian-sorey-jr",
    "name": "Xavian Sorey Jr.",
    "position": "LB",
    "school": "Arkansas",
    "rank": 358,
    "height": "6-3",
    "weight": "231",
    "year": "RS Senior",
    "analystRanks": {
      "PFF": 284
    },
    "positionRank": 27
  },
  {
    "id": "stephen-hall",
    "name": "Stephen Hall",
    "position": "CB",
    "school": "Missouri",
    "rank": 359,
    "analystRanks": {
      "PFF": 285
    },
    "positionRank": 39
  },
  {
    "id": "jalen-huskey",
    "name": "Jalen Huskey",
    "position": "SAF",
    "school": "Maryland",
    "rank": 360,
    "height": "6-2",
    "weight": "201",
    "year": "Senior",
    "analystRanks": {
      "PFF": 286
    },
    "positionRank": 27
  },
  {
    "id": "grayson-james",
    "name": "Grayson James",
    "position": "QB",
    "school": "Boston College",
    "rank": 361,
    "analystRanks": {
      "PFF": 288
    },
    "positionRank": 24
  },
  {
    "id": "logan-diggs",
    "name": "Logan Diggs",
    "position": "HB",
    "school": "Ole Miss",
    "rank": 362,
    "analystRanks": {
      "PFF": 289
    },
    "positionRank": 1
  },
  {
    "id": "jaden-dugger",
    "name": "Jaden Dugger",
    "position": "LB",
    "school": "Louisiana",
    "rank": 363,
    "height": "6-5",
    "weight": "239",
    "year": "Senior",
    "analystRanks": {
      "PFF": 290
    },
    "positionRank": 28
  }
]